Some of Hillary's favorite family-owned businesses on the campaign trail: https://t.co/llCLzTsYAJ https://t.co/QccMhezOd6From Olivia, age 12: “I am a little feminist growing up to help all women with equal rights.” Read her letter ⬇ https://t.co/81NmApY5ge
Hillary Rodham and Bill Clinton met at law school—and she made the first move. https://t.co/GJVMz7PpjV
Hillary's known the importance of small businesses ever since her dad owned one.
https://t.co/Fy2SA8ZjWt
Support small businesses today! They are the backbone of our economy and represent the best of American ingenuity. -H
Today and every day, we #StandWithPP. https://t.co/oifqTQLx1X
How did Hillary and @billclinton feel about dropping @ChelseaClinton off at college? “We were both wrecks.”
https://t.co/QiM7Ee0xPN
Our diversity should be celebrated—not denigrated. https://t.co/PttGbVx4SJ
"She has a light and energy about her that makes you want to be your best." @OITNB’s @UzoAduba and Dascha Polanco
https://t.co/0lJJOAxDZ4
So much to be thankful for. Wishing a happy Thanksgiving to you and yours. -H https://t.co/BxnKu5CKwt
We're thankful for our official campaign supporters. Add your name to become one! https://t.co/KCrp9P4yET
Senior policy advisor @mayaharris_ talks #BlackLivesMatter and being a working mom with @ELLEmagazine: https://t.co/tELMwoy3dV
From Hillary’s record to whether she wears a wig(?!), @creynoldsnc has your back for awkward family political talk. https://t.co/LplkWSDoeL
Sign up and we’ll send you a guide to winning your Thanksgiving table debate: https://t.co/IPQg6CYgzM
Statement of Hillary Clinton on the shooting of Laquan McDonald: https://t.co/xcvQMUrbFP
En un chat Telemundo por la web, Hillary habló de Donald Trump, la educación, y los tacos. https://t.co/bUUI9v753X
There’s no place for second-class status in the United States of America. https://t.co/L53sSZGq4o
Hillary answers: What’s it like to watch football with your family? 🏈
https://t.co/j1DrUnQ7qG
From immigration to education, Trump to tacos: Hillary’s Q&amp;A with @TelemundoNews → https://t.co/9ggDWwJML7
Politicians have no right to interfere with women's access to health care—not in Texas, not anywhere. https://t.co/GvKoAxGqFB
Today, @POTUS awards Shirley Chisholm, the first African American congresswoman, with the #MedalOfFreedom. https://t.co/4bu5n0yo7E
Latinas no deberían ganar 56 centavos por cada dólar que gana un hombre anglosajón. https://t.co/zfJ5oXb8bk
Americans who have served their sentences deserve to have their rights restored. Thank you, Gov. Beshear. https://t.co/GhANLwE3KE
¡Hillary is doing a Q&amp;A on the @TelemundoNews Facebook page en vivo! Join the conversation: https://t.co/ZWQKNlI2kT
Providing care for an elderly or sick loved one should not mean sacrificing your own secure retirement.
Families caring for sick or elderly family members shouldn't have to struggle to pay the bills. https://t.co/XtzuegTmNa
Proud to #StandWithPP in the fight for affordable health care. Don’t mess with Texas women's health. https://t.co/PnxV6yI5Xv
Take an in-depth look at Hillary's plan to defeat ISIS with the campaign's foreign policy expert, @rosenbergerlm: https://t.co/0CN59dcBq8
This feminist dad is making sure nothing stands in the way of his daughters’ success. Read his letter to them: https://t.co/yOzWVnQVgW
Caregiving for elderly and disabled family members in the US in 2013 was estimated to be worth $470 billion. Caregivers deserve our support.
Every survivor of sexual assault deserves to be heard, believed, and supported. https://t.co/mkD69RHeBL
Important words from someone who found refuge in America: https://t.co/yGdMuUXxhM https://t.co/Pjycs3Y1ag
With a GOP majority in Congress, how will Hillary pass laws? See her response to this Q from an astute young lady.
https://t.co/wYQ9Dd98OR
How will Hillary’s college plan help you? Find out with this flowchart: https://t.co/7oBYrlK8VS https://t.co/1GnJLqlzei
We need to protect our communities from the scourge of gun violence. Thank you, @Bradybuzz. https://t.co/FylLgwFw2D
It's snowing in Iowa right now—and organizers and volunteers are still knocking on doors for Hillary. https://t.co/0uapkGzgst
"Who would you pick to play you in a movie?" –@kellyripa

"Well, Meryl Streep of course!" –Hillary
https://t.co/M4Yn0O7WpB
Our values are stronger than fear. Slamming the door on refugees isn’t who we are.
https://t.co/ISEisdQbWf
Louisiana: Today is Election Day! Text VOTE to 47246 to find your polling place—then go make your voice heard!
We’re better than that. https://t.co/ZI9bt8h2a2
Have you ever met a president? RSVP today for a chance to meet President @billclinton! https://t.co/F9Vz02oCfE https://t.co/YHV3n1P4rD
DAPA would keep millions of law-abiding families together—and its fate is in the hands of the next president. https://t.co/jzUo3kpRTb
We need to say with one voice that transgender people are valued, loved, and deserve to be treated that way. #TDOR https://t.co/RGU9XjMwra
I will fight for DAPA so millions of children won't fear coming home to empty houses. Strengthening families means keeping them together. -H
Today, @CoryBooker joins @HillaryforSC for a Twitter chat about what's at stake in this election. Join in→ #CoryinSC https://t.co/JsfYfCHX42
This is shocking rhetoric. It should be denounced by all seeking to lead this country. -H 
https://t.co/qs2TJI5spu
No one working full-time in America should have to raise their kids in poverty.
.@KellyandMichael asked Hillary: What do you think would be some of the advantages of having a woman president?
https://t.co/xyukcpeyhj
Hillary Clinton called out Republicans for slamming the door on Syrian refugees: “We’re better than that.” https://t.co/qIFY9wQu0o
When workers organize for their rights, it helps fix our unbalanced economy and makes families stronger. #worktogether
Did you miss Hillary’s big speech on combating terrorism? Here are 3 things you should know: https://t.co/NQ73BRsQeu
Turning away orphans, discriminating against Muslims, slamming the door on Syrian refugees—that is not who we are.
https://t.co/VAkf6HENpG
Hillary on confronting an ideology of hate: https://t.co/Hl6iKdsdQY
"This is not a time for scoring political points... This is a time for American leadership." —Hillary on defeating ISIS &amp; the refugee crisis
"It would be a cruel irony indeed if ISIS can force families from their homes &amp; then also prevent them from ever finding new ones." —Hillary
"Remember: many of these Syrian refugees are fleeing the same terrorists who threaten us." —Hillary
"Turning away orphans, applying a religious test, discriminating against Muslims...that’s just not who we are. We’re better than that."
"We cannot allow terrorists to intimidate us into abandoning our values and our humanitarian obligations." —Hillary
"We are in a contest of ideas against an ideology of hate—and we have to win." —Hillary https://t.co/URx9h8eN87
"Repeating the specific words 'radical Islamic terrorism' is just a distraction...Our priority should be how to fight the enemy." —Hillary
"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism."
"This is a worldwide fight—and America must lead it." —Hillary on defeating radical jihadism
"Our goal is not to deter or contain ISIS, but to defeat and destroy ISIS." —Hillary
We "can’t sacrifice our values or turn our backs on those in need. We must choose resolve—and we must lead the world to meet this threat."
"After a major terrorist attack, every society faces a choice between fear and resolve." —Hillary
Happening now: Hillary lays out her plan to combat terrorism and defeat ISIS. Watch → https://t.co/nsPEP8Nsjq
The deck is stacked for the wealthiest Americans—and it’s time to reshuffle.
https://t.co/tRzvymEhtl
The defining economic challenge of our time is raising incomes for hardworking families so they can afford everyday life.
The loss of lives to terrorism is tragic and abhorrent, in Nigeria as in Europe. We must all come together to end this scourge. -H
After the events in Paris and with thousands of gun deaths in the US each year, hard to fathom this from the GOP. https://t.co/CQp8sCKx7G -H
.@billclinton popped the question three times before Hillary said yes. How she remembers the proposal that worked: https://t.co/gvn9tS985h
Born on this day in 1945, Wilma Mankiller was the first woman elected chief of the @CherokeeNation. https://t.co/vC9XOeM6y5
Proud to have @SEIU on this team. https://t.co/i6skAsTxnG https://t.co/pjNOmt96VY
Hillary is proud to be a champion for workers, and honored to stand with @SEIU.
https://t.co/BWNQbpTUmP
The Affordable Care Act helps millions of Americans. We should build on that progress—not go back to square one. https://t.co/WRlMFRDXXy
If you like puppies, dancing, and calling out Republicans, you'll love the hillaryclinton Snapchat. https://t.co/3mKmqJvIpb
51% of the kids in our public schools are eligible for free or reduced cost lunches. We need to raise wages to lift families out of poverty.
The @SEIU, representing 2 million workers, has voted to endorse Hillary! https://t.co/Obakxpm0pj
We've seen a lot of hateful rhetoric from the GOP. But the idea that we'd turn away refugees because of religion is a new low. -H
Thank you, @SEIU.

https://t.co/3Pz951cx9T
Hillary and her supporters take a lot of selfies—and she’s learned a few things along the way.
https://t.co/Eow4QerNXA
Come for the coffee. Stay for the conversation—about one of this campaign's most important issues. ☕️  https://t.co/zGfTENgQsq
“It shows her at her wonkish best." https://t.co/2mXmIL6ud6 https://t.co/eIA5yjPmWt
We asked Senator @clairecmc what a Republican president would mean for women. https://t.co/GgyrAUavZp https://t.co/EZsDjxLVtv
No American should work full-time and struggle to get by. Raising the minimum wage will help lift millions out of poverty.
Thank you, @JimObergefell. Our work isn’t over yet. https://t.co/Uk3OZcLIyl
How will Hillary’s college compact help you? Find out with this flowchart. https://t.co/Zoq3FGaRJm
Quality time in Ames, Iowa. https://t.co/W45JRKOS5Q
Americans deserve a raise. https://t.co/uJAadCjehT
Your hard work should be reflected in a rising paycheck. https://t.co/P1Flqso3Fi
The president’s job is to do everything she can do to lift up the people of this country.
https://t.co/UgcxhclOCP
An artist live-sketched the second #DemDebate. Here’s what caught her attention: https://t.co/O8h9zGsHje https://t.co/QYp1fzmGBM
7 of Hillary's best moments at the #DemDebate, including one line every little girl should hear. https://t.co/azhqXJcKda
"Our prayers are with the people of France tonight, but that is not enough." —Hillary https://t.co/vFQltalvzF https://t.co/q1Zb7XSKg9
"I’m very proud that...a majority of my donors are women." —Hillary at the #DemDebate
https://t.co/iUozjULVvQ
Hillary summed up one of the most important issues of this election at the #DemDebate. https://t.co/wtwMLo6HtL
Girl Scouts stick together.  https://t.co/PEulNsoNz6
Are you ready for the first woman president? #DemDebate #Hillary2016
El trabajo de un presidente o una presidenta es hacer todo lo posible para que todos puedan salir adelante. —Hillary #DemDebate
Want Hillary's first thoughts after the #DemDebate? Text ImWithHer now to 47246 to get a message from her!
Stand with Hillary and sign up to get a free #ImWithHer sticker in the mail: https://t.co/BOSoratpZ9 https://t.co/vjH1ATC96g
"I think the president's job is to do everything possible—everything she can do—to lift up the people of this country." —Hillary #DemDebate
For too long, issues affecting women and families—from childcare to paid leave—have been dismissed as "women's issues." Those days are over.
La reforma de salud es demasiado importante para ser revocada. #DemDebate
"The Affordable Care Act—I don't think we should have to be defending it among Democrats." —Hillary #DemDebate
We must make community colleges tuition-free across America. #DemDebate
What Hillary believes: No American should have to take out a loan to pay tuition at a public college. #DemDebate
It's 2015. Every woman deserves equal pay. Full stop. #DemDebate https://t.co/l0kBI6hPtp
"President Obama deserves more credit than he gets for what he got done." —Hillary #DemDebate
We cannot accept 33,000 gun deaths per year as “normal.” Most Americans—including law-abiding gun owners—believe we can and must do better.
Hay que hacer todo lo posible para detener la violencia con armas de fuego sin importar lo que diga el NRA. #DemDebate
There have been approximately 2,800 gun deaths since the last #DemDebate one month ago. We can't wait any longer to act on gun violence.
We cannot give up on preventing gun violence. We—and our next president—have to stand up to the NRA. #DemDebate https://t.co/tTeliBglji
Gun dealers and manufacturers should be held accountable when they endanger communities. #DemDebate https://t.co/KiCM0mhxBa
"My plan is tougher and more effective because I go after all of Wall Street—not just the big banks." —Hillary #DemDebate
We need to rein in risk on Wall Street, and make sure middle class American families never have to bail it out again. #DemDebate
Como presidenta, Hillary protegerá, renovará, y expandirá DACA y DAPA, las órdenes ejecutivas. No cree en separar a las familias. #DemDebate
Hillary will fight to protect DACA/DAPA, pass comprehensive immigration reform, and keep families together. #DemDebate
Hillary will defend President Obama’s executive actions on immigration—and if Congress refuses to act, do everything possible to go further.
There is no place in America for second-class citizenship. Hard-working immigrant families deserve a path to full and equal citizenship.
Hillary on the terror attacks in Paris at the #DemDebate:
https://t.co/ov0lBwpS4W
We should build on the progress we've made on health care—not go back to square one. #DemDebate https://t.co/24rXGZDReo
We should make the tax system fairer: close loopholes for Wall Street money managers and millionaires and give the middle class a tax break.
A higher minimum wage will help close the pay gap, help lift millions of women out of poverty, and have a ripple effect across our economy.
Nuestro desafío como país no solo es ayudar a aquellos que trabajan duro, pero también asegurar que todos puedan salir adelante. #DemDebate
--&gt; https://t.co/L7Dd6ULJqp #DemDebate
"Hardworking middle class families need a raise—not a tax increase." —Hillary #DemDebate
If you're not watching the #DemDebate, we can email you the highlights! Sign up here: https://t.co/RyqZrtnMqp https://t.co/ZdfCr2vDnY
"We're not at war with Islam…we’re at war with violent extremism." —Hillary #DemDebate
America must continue to lead in a dangerous world—and we do so by exercising smart leadership grounded firmly in our values. #DemDebate
Esta elección no solo se trata de elegir a un presidente—también se trata de elegir a un comandante en jefe. —Hillary #DemDebate
"We have to look at ISIS as the leading threat of an international network. It cannot be contained—it must be defeated." —Hillary #DemDebate
"All of the other issues we want to deal with depend on our country being secure and strong." —Hillary #DemDebate
"This election is not only about choosing a president—it's also about choosing our next Commander-in-chief." —Hillary #DemDebate
"Our prayers are with the people of France tonight but that is not enough." —Hillary #DemDebate
Send Hillary a message of support as she heads into the #DemDebate: https://t.co/oLhmoTCmhi https://t.co/sQ6mh4sgpY
"Even after this darkest night, Paris remains the City of Light." https://t.co/RvnZ4oHbsX
The reports from Paris are harrowing. Praying for the city and families of the victims. -H
Follow #Hillary2016 campaign staff to stay in the know during tomorrow’s #DemDebate: https://t.co/Ab57ZumWw9
A five-star review from a four-star general. Thank you, @GeneralClark. https://t.co/emocYkno9P
Proud of my friend Aung San Suu Kyi and the people of Burma for never giving up in the long struggle to bring change to their country. -H
The story of 2 women with moms named Dorothy, sharing beers of the same name, toasting to the first woman president. https://t.co/ZM2anns4Cg
That time Donald Trump gushed about one of the most shameful periods in our country’s history: https://t.co/ezEqiVJJMs
#TBT to when Hillary declared she’s not *just* a progressive at last month’s Democratic Debate. https://t.co/I1waajSkUk
We've come too far to see our progress ripped away.https://t.co/obBV1uXu0V
Create your own #Hillary2016–inspired cross-stitch. Here’s the pattern to DIY: https://t.co/EIdmMpIj2X https://t.co/y452tnL0L0
The U.S. economy would have produced an additional $447.6 billion in 2013 if women received equal pay. https://t.co/tsR4IVlY9E
We need to keep guns out of the hands of domestic abusers and convicted stalkers. https://t.co/mGPKEgwaho https://t.co/ENvnWqIKoL
In 1991 Hillary Clinton filed her husband's papers to run for president. In 2015 she filed her own. https://t.co/hbmPBXBgkv
.@Bustle: "6 Feminist Points In Hillary Clinton's Veterans Plan That Are Awesomely Inclusive" → https://t.co/SHEKnnJLcA
Being a good parent has nothing to do with sexual orientation—thousands of families prove that. https://t.co/xQLh25RAYR
Mentions of Hillary at #GOPdebate: Over 40.
Mentions of equal pay, paid leave, LGBT rights, or racial justice: 0. https://t.co/MOrjgg69iR
Our veterans have done so much for us; now we need to do more for them. Read Hillary’s op-ed in the @MilitaryTimes: https://t.co/a5i6IYOlGh
“To all our veterans, and the men and women now serving: You represent the very best that our country has to offer.”
https://t.co/qIqdJGHwKX
What those who served and sacrificed want you to know this Veterans Day: https://t.co/TWlmE1BQnj
The idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American. No, Trump. -H https://t.co/uZyqAWXUdh
And if anything's clear from last night's #GOPdebate: "They don't have a plan—they just hate mine." @Lin_Manuel  https://t.co/VMicarTaO3
On Veterans Day, to all who have served—you deserve our gratitude, respect, and the best care and benefits in the world. -H
The "winners" from last night's #GOPDebate: https://t.co/dH8dKopxbZ https://t.co/vMs8b3O5vG
If you're proud to be a Democrat after watching tonight's #GOPdebate, add your name here: https://t.co/gcsfX41UyE
#GOPdebate https://t.co/vqbB3Tpf5r
Times Republicans offered helpful ideas for the middle class: 0. 
Times Republicans attacked Hillary: We lost count. 
#GOPdebate
Newsflash: You don’t have to be a scientist to know that climate change is real, and act to combat it. #GOPdebate
Yep—Hillary’s resume is full of accomplishments. #GOPdebate https://t.co/QSyZ6fTRWm
It’s not the big banks that need relief from Washington—it’s small banks and small businesses. #GOPdebate
Ningún candidato en el escenario apoya una reforma migratoría con un camino a la ciudadanía. Ninguno. #GOPdebate
Apoyar a las familias incluye la baja de maternidad pagada, aumentar el salario mínimo, y acceso a guarderías infantiles. #GOPdebate
The @CFPB protects borrowers from unfair and deceptive Wall Street practices. Attacks against it are unfounded and outrageous.
What’s really pro-family: Supporting equal pay, paid leave, affordable child care, and Planned Parenthood. #GOPdebate
These candidates don't seem to mind a "big government" when it's politicians interfering in women's personal health decisions. #GOPdebate
#GOPdebate translation: Doubling down on trickle-down economics. 

America needs an economy that works for everyone.
For 35 years, Republicans have argued that more wealth at the top will trickle down—and twice, a Democrat has had to clean up the mess.
Republicans who want to repeal the ACA should try telling that to the 18 million people who have health coverage because of it. #GOPdebate
Note to candidates who boast that they'd repeal Obamacare: Health care should be a right—not just a privilege for those who can afford it.
Más posturas absurdas del Partido ReTrumplicano—no vamos a deportar a 11 milliones de personas. No vamos a separar a familias. #GOPdebate
The idea that the US will deport 11 million people is absurd. We should not be in the business of tearing families apart. #GOPdebate
Comprehensive immigration reform that brings millions of hardworking people out of the shadows and into the economy: A policy no-brainer.
It's hard to declare a "winner" in the #GOPDebate when every candidate is trying to move our country backward. https://t.co/lCAYkhm8CZ
There is something wrong when top CEOs make 300x more than the typical worker. #GOPdebate
How do we get more in the workforce? Paid leave, equal pay, child care—won't hear that from Republicans. https://t.co/xUQEFdxnWO #GOPdebate
President Obama doesn't get the credit he deserves for strengthening our economy. We need to build on that progress, not go backwards.
.@JohnKasich is right on one thing: The budget was balanced under President Bill Clinton. #GOPdebate
Millionaires don't need tax breaks. Middle class Americans do. #GOPDebate
An idea you won't hear at the #GOPdebate: If you work hard, you should be able to succeed—no matter who you are or where you come from.
Two fewer candidates, but the same number of new ideas as the last #GOPdebate: zero.
Republicans have it wrong on many issues facing Americans this election. Tell us: What are you fighting for? https://t.co/Bak9Dwvxb4
Every woman deserves to make her own decisions about birth control—without interference from politicians or her boss. #ThxBirthControl
Hillary’s dad prepared thousands of sailors during WWII—after he died, Hillary received letters from men he trained.
https://t.co/zZUfzdNNxX
Celebrating 240 years of @USMC service and sacrifice, from Tun Tavern to Helmand. Happy birthday, Marines!
Hillary’s veterans plan will “ensure access to timely, high quality health care and modernize veterans’ benefits.” https://t.co/3GLLKmyU86
Vets deserve better. My plan will address issues like this by upgrading VA technology &amp; requiring accountability. https://t.co/m3Zok741f1 -H
La Corte del 5to Circuito se equivocó. La Corte Suprema tiene que validar a DACA/DAPA para que millones de familias puedan vivir sin miedo.
The 5th Circuit is wrong on immigration. SCOTUS should uphold DACA/DAPA so millions of families can stop living in fear. -H
Happy Diwali! Wishing a bright year ahead to all celebrating the Festival of Lights.
“The future that scientists have warned us about has arrived.” —Hillary to @LCVoters
https://t.co/kuBWhdPNoF
Fast-food, home care, child care workers: Your advocacy is changing our country for the better. #Fightfor15 -H
2015 is on track to be the hottest year on record. Climate change is not only real, it's already present.
This ice cream shop named a sundae after Hillary Clinton. But that’s only part of the story. https://t.co/Hp2Qa3AXQA
"Why are you running for president?"

"Because I want to help little kids."
https://t.co/r3ZKOxoPnZ
“When things get tough, Hillary does not back down.” —@repjohnlewis https://t.co/6jqrRIvBC4
“When it comes to fighting the climate crisis, the stakes couldn’t be higher.” —@LCVoters https://t.co/ngjjNRPMkX https://t.co/2zONDStLVv
Yet another Republican refuses to make it easier to vote. What part of democracy are they so afraid of? -H https://t.co/P4Y4VHr6nS
Women shouldn’t make less than men in 2015. Period. https://t.co/NUbM0Fa2eV
What would it mean to have a former secretary of state in the White House? This. https://t.co/G1zjo2uRQd
Today marks one year from the presidential election. Here’s what’s at stake, in one terrifying flow chart: https://t.co/xsbuCQRoYT
Tune in to @newsone Monday morning at 7 ET for more from Hillary’s South Carolina town hall with @rolandsmartin: https://t.co/QMZg1jq6fN
We quantified Hillary’s career—take a look at the numbers. https://t.co/pgyGWnDn08
“This has to end.” Hillary on gun violence at the First in the South Democratic Candidates Forum.
https://t.co/OrbVa5rXio
Ten women senators say why they’re supporting one of their own: https://t.co/RhDqFmFGIo https://t.co/X0zdOBHBcl
A young man asked Hillary: What did you learn from @GirlScouts that you would use to be a successful president?
https://t.co/4fJOJveiMh
“I helped launch African Americans for Hillary. This is my story.” -@KarenCivil https://t.co/vy2mwYEGt2
“It’s hard for me to understand why the suspension and expulsion rate is so much higher for black kids.” —Hillary
https://t.co/RldOVxhayk
Watch live: Hillary joins @RolandMartin for the @NewsOne Town Hall in South Carolina #NewsOneNow → https://t.co/lADpr4Ccts
Follow @HillaryforSC for updates on Hillary’s trip to the Palmetto State and today’s @newsone town hall: https://t.co/lADpr4kBBU #HRCinSC
Hillary Clinton sat down with the mothers of Eric Garner and Dontre Hamilton—here’s what they talked about: https://t.co/z3zPRwwoAN
Si tuviera que aprender un idioma, Hillary dijo que sería el idioma de Gabriel García Márquez. #DemForum
"If you stand for equal rights, if you stand against discrimination, you don't just do it once—you've got to keep fighting." —Hillary
On foreign policy, the use of force "should always be the last resort—not the first choice." —Hillary
We can't wait any longer to act on gun violence prevention. #DemForum
"It is hard to understand why the suspension and expulsion rate is so much higher for black kids than for white kids." —Hillary
"Anybody who thinks that they can influence what I will do doesn't know me very well." —Hillary
"Pres. Obama doesn't get the credit he deserves for the job he's done...I want to build on that progress—but I want to go further." —Hillary
"I have been committed to and working on issues that I think are important...in particular to people who are marginalized." —Hillary
Watch now: Hillary joins @maddow at the #FirstintheSouth Democratic Candidates Forum in Rock Hill, SC → https://t.co/68f9wJQYiy
Our favorites from the Internet this week. https://t.co/kn0TXo2T20
#FF @HillaryforSC for tonight’s Democratic candidate forum with @maddow. Great weekend ahead in the Palmetto State! 🌴#HRCinSC
Hillary on criminal justice reform and more in @EBONYMag: https://t.co/QBAD1iIrqf https://t.co/nvzE5dmYSY
The right call. Now it's time to make America a clean energy superpower. -H https://t.co/d6kSvldOLI
.@MikeyLikesItNY helps people with criminal records find jobs, one scoop at a time. https://t.co/gHAs0Etddn
Hillary is ready to be president. Want to help make it happen? Apply to be a Hillary for America intern: https://t.co/iSbArYiedG
What do you call the male spouse of a female president? Hillary and @JimmyKimmel have some ideas.
https://t.co/QU0THUPn90
Hillary’s spent 40 years in public service, and the numbers speak for themselves. https://t.co/tsj4DYQ4It
Today on @Snapchat: 10 little girls who are ready for the first woman president. Follow us! 👻 hillaryclinton https://t.co/TJmcOnY89w
Backstage at @JimmyKimmelLive—tune in tonight! https://t.co/39BrorRCE2
#TBT to the time Hillary had a @DollyParton-themed birthday party in 1995. 🎤 https://t.co/f4NZVUJGc3
Working hand in hand with tribal nations, the US government can help ensure the strength of Native communities. https://t.co/GjxVAqV0Kb
50 years ago, @repjohnlewis marched—and bled—for the right to vote. His message today: “We must use the vote.”
https://t.co/NoNHImLS51
Malala is brave, inspiring—and really onto something here. https://t.co/c3dWxopG7B (via @EmWatson) https://t.co/Zqxxn9sAhx
Our criminal justice system is broken. Here are 3 things we can do to start fixing it: https://t.co/H2WHRkOrFy https://t.co/NdgnofiDu0
Meet Olivia, the 12-year-old feminist who wrote Hillary this letter: https://t.co/1PLC2hrymq https://t.co/STEECewzkM
We can't sit by while more people die. It's time to stand up to the NRA once and for all. https://t.co/jse2vAytjl
A 10% price reduction is insulting. As I've said before, the FDA and FTC need to step in to protect consumers. https://t.co/guopHDGOBz -H
Guilty as charged. 🍕 https://t.co/qnKHHsAUE2
We should not put 650,000+ promising young people at risk for deportation. Sen. Rubio is wrong on this. -H 
https://t.co/763Ok5xBtS
Hillary’s answer shows *exactly* what it would mean to have a former secretary of state in the Oval Office. https://t.co/tWkN1ablD9
In 1976, @BarbaraJWalters became the first woman co-anchor on a major network. https://t.co/w6F7J3FZYs
Racial profiling is demeaning, wrong, and unconstitutional. It's time to put that practice behind us.
Everyone deserves full and equal protection under the law. This is a reminder of the work still left to do.  https://t.co/r68QAHxxPT
Congrats @simone_biles, the most decorated woman gymnast of all time! Can’t wait to watch your next winning routine. https://t.co/XotGpSOq6P
Federal law doesn't prohibit convicted stalkers from purchasing or possessing guns. https://t.co/2tONgsL1Ti https://t.co/0vfxhMfaLe
Our criminal justice system is in crisis—but we can start changing that now. https://t.co/gdBkpPjBEZ https://t.co/L54c868qHl
.@GregAbbott_TX is right about one thing: equality is one of Hillary's values. Houston—vote #YesOnProp1 today. https://t.co/AI0IWnqhB7
When unions are strong, America is strong. Thank you, @AFSCME. https://t.co/wWVOq9WEZe
Voting is one of our most important and sacred rights. If there's an election near you today, make your voice heard—go vote! -H
A 12-year-old feminist named Olivia wrote Hillary this brave, heartwarming letter. Olivia 2040, anybody? https://t.co/5ZEKdOpTrQ
Watch our new ad—why Hillary is working to prevent gun violence:
https://t.co/S7RuSmwzfi
While in Chicago discussing the way forward, another child dies from gun violence just miles away. Devastating. https://t.co/3mXyMSTsxk -H
Republicans continue to play politics with families who want to contribute to our economy. Eso no es liderazgo. https://t.co/tl55HEIWwR
Grateful to spend time today with mothers who have lost a child to violence and turned their grief into a national call to action. -H
Their faces say it all. https://t.co/vB2FrSHgDJ
The top 25 hedge fund managers make more than all kindergarten teachers in the US—combined. We need to fix that. https://t.co/zTkCxPUd46
“We need to end private prisons and detention centers once and for all.” —Hillary in Atlanta https://t.co/f6S3zQ3CFQ
On the day of the first Democratic debate, Hillary’s granddaughter Charlotte had a big surprise for her.
https://t.co/yxRM6gcTnJ
¡Feliz Día de los Muertos! Text LATINOS to 47246 to join Latinos for Hillary. https://t.co/kC56iMB4nn
More than 1 in 100 American adults is behind bars. Here's how we can start fixing that. https://t.co/Qdz9h116G3
"I support Hillary because Hillary supports me." @OITNB’s @UzoAduba &amp; Dascha Polanco are on Team Hillary.
https://t.co/wauAhWHLnJ
An inside look at an issue that will shape our economy for years to come (yeah, it’s that important). https://t.co/88VTl6B8ec
While Republicans swapped out-of-touch ideas at the #GOPdebate, Hillary was live-texting her reactions. https://t.co/OFyM5HEYbZ
Top CEOs earn 300 times more than the typical American worker. That's wrong.
https://t.co/SUFDsLTG3m
Thank you for the support, @BilldeBlasio. https://t.co/ylEKVsIpnx
“I can't stop asking myself once again: Where does my community go from here?” -@claynmiddleton https://t.co/eakToXxU9h
Happy Halloween! 🎃 https://t.co/kjfUE0YO8U
More lives lost. We need sensible gun violence prevention measures, and we need them now. https://t.co/uwcYLj1IRi
Republican debate-speak, decoded. https://t.co/vQwkoDt11x
Too often, women still make less on the dollar than men. It's time for equal pay now.
https://t.co/5HdYQXtQE2
Rated “O” for out of touch and out of date: The Zombie Policies. https://t.co/gso2dmzlq1
Glad to see @USArmy knocking down more barriers to women serving on the front lines. https://t.co/SPbcZxcmG6
Add your name for the chance to party with Hillary at @xtina's house in Los Angeles! https://t.co/XVf5cqQxpl https://t.co/PBY52r7Xpo
No pagarle lo mismo a las campeonas del mundo de fútbol es más injusto que ganar el mundial con "la mano de Díos." https://t.co/TWmzEETe7v
Race still plays a role in who gets ahead and who gets held back. Hillary will fight to change that. Join her: https://t.co/eG2ciTEQ4K
Hillary calls to "ban the box": "People who have paid their debt to society need to be able to find jobs, not just closed doors and hearts."
"I’m pledging to eliminate the disparity in sentencing between crack and cocaine, which disproportionately impacts African Americans."
"We need to end private prisons. Protecting public safety...should never be outsourced or left to unaccountable corporations." —Hillary
"We have to end the era of mass incarceration." —Hillary
"Racial profiling...is wrong, demeaning, doesn’t keep us safe or help solve crimes—it’s time to put that practice behind us." —Hillary
Happening now: Hillary kicks off African Americans for Hillary with @repjohnlewis in Atlanta! Watch → https://t.co/HZ1LppKszD
It's intolerable that black children in our country feel unsafe in their own skin. A powerful reminder: https://t.co/afY33gjdsx -H
Whether you're a teacher, an executive, or a world-champion soccer player, you deserve equal pay. Red card, GOP. https://t.co/TWmzEETe7v
40 million Americans have student debt. We need to make college affordable once and for all. https://t.co/Hl7pGiZ4iQ
We can’t afford to have a Republican in the White House. If you're with Hillary, add your name: https://t.co/3AOKQEfdIA
An estimated 1.5 million black men are missing from their communities because of incarceration and premature death. https://t.co/cCSANbV4X1
Everyone who works hard and does their part should see that work reflected in a rising paycheck.
Texts from Hillary, #GOPdebate edition. https://t.co/KT21PtrHVP
No one should face discrimination for who they are or who they love—I support efforts for equality in Houston &amp; beyond. #HERO #YesOnProp1 -H
Why are @OITNB’s @UzoAduba &amp; Dascha Polanco on Team Hillary? "She cares about the things that are important to us."
https://t.co/uKBY0c0NDg
"Do you think that when you’re president, you’ll be paid as much as a man?"
https://t.co/2uQMq2v5ev
Tonight's #GOPDebate made it clear: We cannot afford a Republican in the White House. Get your free sticker: https://t.co/o662Sz9ACJ
#GOPdebate https://t.co/rBT90JvCmM
Will repeat this as often as needed: Women—not the politicians on stage—should make decisions about their own health. #GOPdebate
Republicans are looking out for the wealthy and well-connected. Hillary is looking out for us. #GOPdebate
https://t.co/zTkCxPCBFw
Republicans are refusing to act on climate change. Hillary has a plan to take it on. https://t.co/Jb7DXwL9WS https://t.co/YbSmmW8mW6
We can't wait any longer to keep our communities safe. We need to act on gun violence prevention. https://t.co/37QVIbRnpd #GOPdebate
There is no place in America for second-class citizenship. We can't wait any longer for comprehensive immigration reform. #GOPdebate
Commercial break: While Republicans work for those at the top, Hillary is going to bat for middle-class Americans.
https://t.co/TrYTnwSmWu
We need to fight for policies that break down barriers to good jobs and help balance work and family: equal pay, child care, and paid leave.
Commercial break: Hillary wants to make college affordable for every American. Republicans? #GOPdebate
https://t.co/f5iUYZ8Ysp
Every woman deserves equal pay. Period. https://t.co/F5uzo79moY #GOPdebate
Las mujeres deberían de ganar lo mismo por hacer el mismo trabajo que los hombres. Punto. #GOPdebate
Here's what we can't afford: A Republican in the White House. https://t.co/d5zyMz7NgY #GOPdebate
For people who claim to hate big government, Republicans love using it to try and make health care decisions for women. #GOPdebate
Text WATCH to 47246 to get live texts from Hillary during the #GOPDebate! https://t.co/eMl4lCpNSP
We need to rein in risky behavior on Wall Street. Hillary's plan: https://t.co/eYdefYHM9a #GOPdebate https://t.co/TOwkGleBJv
No American should have to choose between getting the health care they need and paying rent. #GOPdebate
Commercial break: Hillary is fighting for equal pay for women. Republicans are fighting against it. #GOPdebate
https://t.co/ebzv1UawBM
Los Republicanos siguen pensando que darle más recursos a los ricos beneficiará a la clase media. #GOPdebate
Here's the thing: Republicans' ideas are trickle-down economics in disguise. We can't let them take us back to policies that don't work.
Millionaires don't need tax breaks. Middle-class Americans do. https://t.co/jfTAzxfHGq #CNBCGOPDebate
The deck has been stacked in favor of the wealthy and well-connected for too long. https://t.co/nW2JqXGZT9 https://t.co/8wurGMNZIs
La retórica ofensiva de los candidatos Republicanos sobre los Latinos es vergonzosa y no tiene lugar en la política. #CNBCGOPDebate
Comprehensive immigration reform will strengthen families, our economy, and our country. #CNBCGOPDebate
In the past two Republican debates, no one said a word about equal pay. Maybe the third time's the charm? #GOPdebate
Which GOP candidate would you want to see Hillary take on in a debate? Cast your vote! https://t.co/IAf9qEWt7g https://t.co/LdvZ4HytVS
.@clairecmc on what a GOP president means for women: “June Cleaver? Would people get that?” https://t.co/sYWtTuHgGf https://t.co/1Z34B6koES
We need to reauthorize the Export-Import Bank and help American businesses stay in business.
"If you're looking for someone to say what is wrong with America, I'm not your candidate. I think there is more right than wrong." —Hillary
"Paid family leave isn't just good for women." —Hillary at #PoliticsAndEggs
.@StephenAtHome on "Hillary for Halloween" costume ideas: Dress up however you want, but stay for 11 hours.
https://t.co/scXyiutlaE
That feeling when you picked *just* the right outfit. https://t.co/cOdpX0rzDU
.@StephenAtHome: "I was playing a character who did not care for you."

Hillary: "I can say it now—it was mutual."
https://t.co/RP8cPdEoh3
Don’t miss Hillary’s first meeting with the real @stephenathome, tonight on @colbertlateshow! https://t.co/cCUqPSpPU7
Some of America's most powerful women tell us why they support Hillary: https://t.co/6jEh4h6odZ https://t.co/a87Gq7tYhY
Cosign, @POTUS. https://t.co/NEBLEl7hkt
No hay ninguna excusa para usar violencia en nuestras escuelas. Punto. #AssaultAtSpringValleyHigh https://t.co/vIuWOAPFi2
“Strong women help create strong families!” Read @katyperry’s note for Hillary's birthday: https://t.co/657n4LeA36 https://t.co/N78xLo4OfZ
Humorous! https://t.co/3zbyqTIn0O
There is no excuse for violence inside a school. The #AssaultAtSpringValleyHigh is unacceptable—schools should be safe places. -H
Hillary has a plan to make affordable childcare a reality—and this supporter in Alexandria, Virginia knows it.
https://t.co/BorYwrNJCv
Giving students a world class education also means making sure adjunct faculty are paid fairly. #CampusEquityWeek https://t.co/jRsMhHWeRg
The GOP should stop trying to roll back consumer protections—standing with @POTUS to defend middle class savings. -H https://t.co/fi0BaHq013
Well done, Ole Miss. Symbols of hate have no business flying over a place of learning. -H https://t.co/t3WL4pJcjV
It's her 👇 birthday! https://t.co/OokdGojmJJ https://t.co/3p34BYrX3K
♪ ♪ Qué linda está la mañana en que vengo a saludarte, venimos todos con gusto y placer a felicitarte... ♪ ♪ https://t.co/lGDjG7Dk9q
Quick questions with Hillary: What family memories still make you laugh?
https://t.co/5dm5GOWmHE
Today is Hillary's birthday! Sign her card–it will make her day: https://t.co/1M7kkxbKLw https://t.co/RF7okkxPnk
Hillary is fighting for all of us. #IDPJJ https://t.co/VG2IKJItST
.@ricky_martin tiene razón—hay que ser respetuoso y Hillary continuará demandando que los Republicanos lo sean. https://t.co/HLTxSHr5Ct
It was quite a week. Catch up on these stories before you start the new one. https://t.co/jkI929GhSL
Highlights and behind-the-scenes moments from a big day in Iowa. https://t.co/Cd83dyGlPb #IDPJJ
"If talking about equal pay, paid family leave, child care, &amp; women's health is playing the gender card—deal me in."
https://t.co/hu1ELwXVp9
Hillary stands with parents and educators in calling for better, fairer, and fewer tests. On @usedgov's new plan: https://t.co/w53TrBGp8L
Hillary's birthday is tomorrow—and she's still on track to be the youngest woman US president ever. Sign her card! https://t.co/cLhVnvmvp1
Happy birthday, @KatyPerry! 🎉 https://t.co/JO1BI6SxJz
.@katyperry, you bring the campaign dress code to the next level. Thanks for hanging out with us in Iowa! -H https://t.co/nctt1B4ilH
"Go win this thing, Madam Secretary." Thanks, @davidplouffe. https://t.co/inR1TAxdVu
Hillary and @maddow talked about everything from Syria to health care—but first, Rachel was curious about one thing. https://t.co/oNtp766MgM
A roaring good time at the Iowa JJ. https://t.co/2VzV5u2fQe
Did Hillary rock at #IDPJJ? https://t.co/Y8tu28CEKa
"Together we’re going to build an America where...a father can tell his daughter, 'you can be anything you want to be—including president.'"
"I’m listening to you. I’m fighting for you. And with your support, I’m going to deliver." —Hillary at #IDPJJ
"I’ve spent my life working for children, women, families, and our country...and I’m just getting warmed up." —Hillary at #IDPJJ
Why Hillary fights to prevent gun violence: "You should be safe when you go to school, when you go to the movies, when you go to church."
"Yes—Black Lives Matter." —Hillary at #IDPJJ
"When you short-change women, you short-change families and you short-change America." —Hillary on why she's fighting for equal pay #IDPJJ
Hillary at the #IDPJJ: https://t.co/reLfQa31DJ
"Companies that ship jobs and profits overseas shouldn’t get a tax break—you should." —Hillary at #IDPJJ
Hillary on what she's fighting for: "At the top of the list is this: Americans need a raise." #IDPJJ
"As a smart man once said, there’s nothing wrong with America that can’t be fixed by what is right with America." —Hillary #IDPJJ
"It’s not enough just to rail against the Republicans or the billionaires. We have to...make a difference in people’s lives." —Hillary
Hillary at the Iowa Jefferson-Jackson dinner. #ImWithHer https://t.co/TchCBBw7hp
"For people who claim they hate big government, Republicans sure love using government to step in and make decisions for women." —Hillary
"We are going to stop Wall Street hurting Main Street." —Hillary at the #IDPJJ
"There is something wrong when the top 25 hedge fund managers make more than all the kindergarten teachers in America combined." —Hillary
"We need to defend the progress we’ve made under President Obama and build on it." —Hillary at #IDPJJ
"When there’s a Democrat in the White House, America creates more jobs, the economy grows faster, and deficits are smaller." —Hillary
Hillary on the GOP debates: "It's reality TV—with a cast of characters who don't care much about actual reality." #IDPJJ
WATCH LIVE: Hillary speaks at the Iowa Jefferson-Jackson dinner, 100 days before the #IAcaucus → https://t.co/SMrVPsIJDM #IDPJJ
Thank you, @davidplouffe​. https://t.co/rRXnLazrPU -H
Agreed, President @billclinton! https://t.co/rsAiHQ2ma7
"Sometimes, you just have to ROAR!" —Hillary after @katyperry's performance at the @HillaryforIA rally in Des Moines. #HillYes
"I'm tired of the stranglehold that women have had on presidential spouse.” —President @billclinton at the @HillaryforIA rally in Des Moines
Live from Des Moines, Iowa: @billclinton, @KatyPerry, and team @HillaryforIA! Watch → https://t.co/aKD8HTHf9b #HillYes
Thanks for following our incredible day in Iowa—stay tuned to hear @katyperry, @billclinton, and Hillary! #HillYes https://t.co/f24SyhXI9Z
SO EXCITED to see @katyperry—but while we wait, she's taking over Hillary's Instagram! https://t.co/FMBZnWcMdY https://t.co/fJkSnaLGZ7
Why #ImWithHer: I trust Hillary. She will make the world better for me, my husband, and my mom. #HillYes https://t.co/jeNEQJjecb
There are people across IA doing what I do every day: knocking on doors, making calls, and doing our part to win the caucus on Feb 1!
My team has become a 2nd family. Here’s us the day the Supreme Court legalized marriage equality—I’m in the middle. https://t.co/IUGrptxYqd
I organize in rural Iowa. Knocking doors here means driving 20 minutes between each house—but it's not all bad. https://t.co/9NBq1m0F6Z
I got to introduce Hillary at an event in Dubuque a few months ago—it was an experience I’ll never forget. #HillYes https://t.co/yy6Y4Bsyd5
As a military spouse, I stand with Hillary on national security—&amp; she'll make sure I won't have to worry about getting fired for who I love.
As a military spouse, I stand with Hillary on national security—&amp; she'll make sure I won't have to worry about getting fired for who I love.
More than anyone, Hillary knows that the decisions she will make as President affect me and my family. #HillYes https://t.co/DwR2Ec3A5N
Before Iowa, I was in NC with my husband Aaron &amp; our cat Pretzel. When Hillary announced I knew I had to be here. https://t.co/IRmyhhpoi8
As an organizer in Iowa, I spend my days talking to folks in my community about Hillary and her vision for America. https://t.co/9aUQXzHAhk
Hi! I’m James, a @HillaryforIA organizer in NE Iowa. I’ll be tweeting today ahead of the Jefferson-Jackson dinner! https://t.co/2nGjODKbHS
Hillary on the stakes of this election on @maddow tonight: https://t.co/JdxOTmQbDv
Post-hearing activities: "We sat around eating Indian food and drinking wine &amp; beer." Tune in to @maddow at 9pm ET! https://t.co/pv74TfXmxG
Hillary and Rachel. Tune in to @maddow at 9:00 pm ET!
Anyone who’s sick of Hillary standing up for women had better get ready for a long campaign. https://t.co/6yfsZLIgr7
11 hours. One candidate who showed she’s ready to be president. https://t.co/C48a403ei0
Welcome to @sesamestreet, Julia! Kudos to @SesameWorkshop &amp; @autismspeaks for educating parents &amp; kids about autism. https://t.co/v0gDxpVdjj
To everyone in the path of #HurricanePatricia, follow @CENAPRED_mex for shelter locations and emergency info. Thinking of you—stay safe. -H
“I am a little feminist growing up to help all women with equal rights.” Meet Olivia: https://t.co/xN2sFbF4Rm
"I'm running for President, because after listening to people across our country, your fights are my fights." https://t.co/h8qECEPqsx
Watch live as Hillary takes the stage in Alexandria, VA with @TerryMcAuliffe → https://t.co/8hVpwXewIi
Thanks for your support, brothers &amp; sisters of @AFSCME. You never stop fighting for working families, &amp; I'll never stop fighting for you. -H
Hillary on those who tell her to "stop shouting" on issues that matter. https://t.co/pmZ4FJihvH
"I'm doing everything I can to make sure the issues that matter most to women and families are front and center in this election." —Hillary
If you're proud to stand with Hillary, show the world with your free sticker → https://t.co/0Xb1A8C8L3
11 hours in → #ImWithHer https://t.co/0t9V3oqZGQ https://t.co/wxtU2atLte
If you're standing with Hillary, let her know: https://t.co/6CRK1JCS8t
Hillary's email use can be summed up in four sentences: https://t.co/N8ba4DBSBx #BenghaziCommittee
If you're standing with Hillary today, let her know: https://t.co/6CRK1JCS8t
As Secretary, Hillary implemented reforms to protect diplomats and help prevent future attacks. #BenghaziCommittee
https://t.co/PbkQZVlxLI
America must continue to lead in a dangerous world. To do otherwise would mean drawing the wrong lesson from the Benghazi tragedy.
A lesson from Benghazi: Congress needs to do its part to ensure that our diplomats in dangerous parts of the world are as safe as possible.
We need leadership that puts national security ahead of politics and ideology. #BenghaziCommittee
https://t.co/8nBtzV0E6K
Hillary this morning at the House Select Committee on Benghazi. https://t.co/ZxhcSJVAfI
"The American people expect us to lead. To learn the right lessons. To rise above partisanship and reach for statesmanship." —Hillary
"I am here, despite all the previous investigations...to honor those we lost and to do what I can to aid those who serve us still." —Hillary
"We should debate on the basis of fact, not fear. We should resist denigrating the patriotism or loyalty of those who disagree with us."
America "has a long history of bipartisan cooperation on foreign policy...I know it’s possible to find common ground because I’ve done it."
"We need leadership at home to match our leadership abroad. Leadership that puts national security ahead of politics and ideology." —Hillary
"Efforts to establish a modern joint training center are being held up by Congress. The men and women who serve our country deserve better."
"There is more to do, and no administration can do it alone. Congress has to be our partner as it has been after previous tragedies."
"I pledged that...every one [of the Accountability Review Board's recommendations] would be on the way to implementation. And they were."
"We have a responsibility to provide diplomats with the resources &amp; support they need to do their jobs as safely &amp; effectively as possible."
Hillary on fallen Americans in Libya: "They believed—as I do—that America is greatest force for peace &amp; progress the world has ever known."
"We need creative, confident...leadership that integrates and balances the tools of diplomacy, development, and defense." —Hillary
"Retreat from the world is not an option. America cannot shrink from our responsibility to lead." —Hillary
"We have learned the hard way when America is absent, especially from unstable places, there are consequences." —Hillary #BenghaziCommittee
"If you ask our most experienced ambassadors, they’ll tell you they can’t do their jobs for us from bunkers." —Hillary
Hillary at the #BenghaziCommittee. https://t.co/Op750p9avA
"We inevitably must accept a level of risk to protect our country and advance our interests and values." —Hillary
"America must lead in a dangerous world, and our diplomats must continue representing us in dangerous places." —Hillary
"Today I would like to share three observations about how we can learn from this tragedy and move forward as a nation." —Hillary
"I launched reforms to better protect our people in the field and help reduce the chances of another tragedy happening." —Hillary
"I am here to honor the service of those four men...and the work their colleagues do every single day all over the world." —Hillary
The #BenghaziCommittee explained, by @johnpodesta. https://t.co/g4Br5qrJT4
The @HouseBenghazi hearing is starting now. Follow @TheBriefing2016 for the facts you need to know. https://t.co/rneb003Nzs
This morning, Hillary testifies before @HouseBenghazi. Follow @TheBriefing2016 for fact-checks from the hearing. https://t.co/CWUkoewxD3
Hillary is testifying before @HouseBenghazi today. Here's what you need to know. https://t.co/1U6IIHE1pe
Thank you, @POTUS, for taking these critical steps to end the quiet epidemic of substance abuse. https://t.co/tnV5nfjXlm -H
Tomorrow, Hillary will testify in front of @HouseBenghazi. Let her know you’re with her. https://t.co/xbv34IrGBk https://t.co/RMy8CbmLwm
An investigation into the deaths of four Americans has been twisted into a partisan attack on Hillary. The facts: https://t.co/M0hm0INHAE
Hillary championed LGBT equality around the world: “The strongest defense ever in terms of gay rights.”
https://t.co/R03iFA5MrB
.@VP is a good friend and a great man. Today and always, inspired by his optimism and commitment to change the world for the better. -H
Hillary is a longtime fighter for reproductive rights, education, and equal pay. https://t.co/hUO0zHHlur
As Secretary of State, Hillary prioritized the education of women &amp; girls to build peaceful and prosperous nations.
https://t.co/VMXkFLVGOe
What did Hillary accomplish as Secretary of State? @SenSchumer weighs in: https://t.co/QYIq2iHAtk
It’s good for our economy when companies prosper by innovating, creating new products, and investing in workers. https://t.co/karaoU0Zmx
Dorothy, la madre de Hillary, le enseñó la importancia de trabajar duro y de nunca rendirse.
https://t.co/6KI9lHxgYD
“She was able to restore the credibility of the United States.” —Leon Panetta
https://t.co/IPgeqEd48A
As secretary of state, Hillary led the international negotiations that paved the way for the Iran Deal. https://t.co/CxYa9zurSv
Take it from a fellow Secretary of State: No one used smart power better than Hillary during her tenure.
https://t.co/y6WwpIXGQf
Before Hillary was running for president, Republicans had the nicest things to say about her. https://t.co/uRr2doIX4K
Hillary has the experience, skills, and vision we need in our next Commander-in-chief. Just ask @madeleine: https://t.co/2ETq3t5GBv
Watch: Hillary’s diplomacy united unlikely allies around sanctions that got Iran to the negotiating table. https://t.co/zb59ne5yRT
Former Senior Advisor to President Obama @davidaxelrod on Hillary's greatest accomplishments as Secretary of State: https://t.co/1yaBsfZkUG
WATCH: As Sec. of State, Hillary paved the way for the deal that will stop Iran from ever getting a nuclear weapon. https://t.co/OCcqTwsonz
If you’re a progressive who believes in getting things done, sign up for your free sticker: https://t.co/r51BIC475X https://t.co/Xhx536rMGr
¡Celebración in Texas! Julián Castro endorses Hillary: https://t.co/Vvr9D4CbPX https://t.co/F2c9JwJIQ8
After battling it out in the primaries, Hillary got a call from President Obama to serve—and she answered.
https://t.co/KMY836O2Pk
The world is a better place because Hillary was Secretary of State. Here’s why: https://t.co/zUEcuPNekw https://t.co/2VIbnulOD7
Patients who rely on prescription drugs should not have their health and lives put at risk because of price gouging.
https://t.co/HYIi3IAswE
"I don't think I have ever met someone more prepared to be president." —@Madeleine Albright
https://t.co/D6nCGEDC6v
Carly Fiorina challenged Democrats to name an accomplishment of Hillary’s. Senator @BarbaraBoxer accepted: http://t.co/rvSs9FXtpB
Hillary has what it takes to lead America. Watch the new video on her accomplishments as Secretary of State:
https://t.co/NHCzrdNskT
Hillary's mission as president: raise incomes for hardworking middle-class families.
https://t.co/vw0IIRfVFi
"What part of democracy are all these candidates afraid of?" Read why Hillary is fighting to protect voting rights. http://t.co/z6SHW4ChQF
“In 2016, the Latino community is going to play a critical role in electing our next president.” -Julián Castro
https://t.co/vRbKqY7AOV
Over four decades, Hillary has taken on her share of tough fights—here are a few of her biggest accomplishments. http://t.co/fM8R3CrFrj
http://t.co/PgJKbM0OEE
Attempting to deny citizenship to immigrants' children born here is wrong—and undermines who we are as a country. http://t.co/UEYjq4cruO -H
As President, Hillary will take on the epidemic of gun violence—with or without Congress’s help. http://t.co/WCzGOEa3Uy
What needs to change on Wall Street, according to the “Economikes.” http://t.co/aJfimOIB9C
We can’t ignore America’s racial inequities. http://t.co/lfcpVSlzp2
If you’re a progressive who believes in getting things done, sign up for your free sticker! http://t.co/croZqCscnM http://t.co/PlIyHKMwvY
Strong step forward by @WhiteHouse. We shouldn't put a national treasure like the Arctic at risk. https://t.co/wpayAgroeN
As usual, @madeleine is right: We need to strengthen America's leadership—not go backwards. #GrandmothersKnowBest -H https://t.co/eAvYCqt8k5
On Oct. 16, 1916, Planned Parenthood opened their first health center and changed life for women in America. Here's to the next 99 years. -H
Yesterday in San Antonio, three-time mayor of San Antonio Julián Castro announced his support for Hillary. http://t.co/HZKpp103Q1
Transgender people deserve respect, safety, and equal treatment everywhere. Good move by @TSA. https://t.co/9ZZV0NV6IW
Brava, Jennifer. It's hard to speak up against inequity and risk being unpopular—but equal pay matters for us all. http://t.co/g29cRkq5ln
¿Sabías que Hillary Clinton trabajó destripando pescados? http://t.co/zkCagavfeE
The number of American lives lost to gun violence is more than three times the rate as the next developed country. http://t.co/VxoYBfhgLr
Me gusta ser "La Hillary," pero también soy "Tu Hillary." #LatinosforHillary
¡Gracias, @JulianCastro, por tu apoyo! #LatinosforHillary
No puede ser que las latinas ganen en promedio 55 centavos por cada dólar que gana un hombre blanco. #LatinaEqualPay
Ever had to tell a prime minister about your bad hair day?
https://t.co/4n4YyQL0Gx
Women still make less than men, with women of color facing an even bigger gap. This isn't just holding women back—it's holding America back.
We should be doing everything we can to get young people more engaged in our democracy, not putting up obstacles. https://t.co/OaVWrU1U8s
To everyone who's ever been bullied for being who you are: You're perfect, and I'm proud of you. #SpiritDay -H
It's time to stand up to the NRA. We have to #KeepShoutingOnGuns until our families are safe from gun violence.
https://t.co/9PpdgPE7Ik
"Yo estoy contigo. That's a promise." —Hillary #LatinosForHillary
"I've been told by some to quit shouting about this. Well, I'll tell you: I will not be silenced...I will keep taking on the NRA." —Hillary
"It is both heartbreaking and infuriating that we lose an average of 90 Americans every day because of guns." —Hillary
“I'm running for president to protect our families and communities from the plague of gun violence.” —Hillary
"I will fight any effort, anywhere, to disenfranchise any American." —Hillary in San Antonio #LatinosForHillary
"Every American deserves access to quality, affordable health care—even new Americans." —Hillary #LatinosforHillary
Watch live: Hillary speaks at a Latinos for Hillary event in San Antonio, Texas → http://t.co/4QDB9eEIwA
"I salute the Black Lives movement for raising this issue to the high priority it is."—Hillary on race and criminal justice reform at #USHCC
"We cannot grow the economy unless we end the unequal pay that women in the workplace are still suffering under." —Hillary at #USHCC
"Comprehensive immigration reform where we bring people out of the shadows will be good for our economy." —Hillary
"Immigration is good for America. Immigration built our country." —Hillary at @USHCC
Watch live: Hillary speaks at @USHCC. Don't miss this → http://t.co/ovA9XAULgP
Hillary's been a fighter for LGBT equality for years—and she's just getting warmed up. Read her fiercest quotes: http://t.co/zu5vBC573H
Go behind the scenes with Hillary at the #DemDebate: http://t.co/M5XAMWZFNx http://t.co/fQf48HHNMW
She has a point: The economy does do better with a Democrat in the White House.
https://t.co/ijhQK1uNGs
The feeling when a GOP candidate says it's acceptable to be fired for being gay. https://t.co/cF9mw5k8fq http://t.co/cYFvcW27mQ
Last night, Hillary was the only candidate to confront GOP attacks on Planned Parenthood. http://t.co/kHpSMSC4C5
Your fights are Hillary's fights. http://t.co/OKwDwbqqaS
No senior should have to choose between paying their Medicare premium and buying groceries. http://t.co/uQM4y4JBYz https://t.co/E5nVyk1sAP
We can protect the Second Amendment while also protecting our families and communities from gun violence. http://t.co/K3DN9ORtrk
"I can't think of anything more outsider than electing the first woman president." —Hillary #DemDebate
https://t.co/3OiUNf6Xhb
Last night, Hillary showed that she has the vision, the plans, and the determination to move this country forward.
https://t.co/lKhqx4Q3a5
“Finally, fathers will be able to say to their daughters: you too can grow up to be president.” #DemDebate
https://t.co/pan4VXnmgT
A highlight of #DemDebate: Hillary stands up against Republican attacks on women's rights. #ImWithHer
https://t.co/9OBNNSpaRf
RT this if you’re proud to stand with Hillary. #ImWithHer #DemDebate http://t.co/gNnlOqnBq3
Are you with Hillary? Let her know: http://t.co/cpNtT9GLNf #DemDebate #ImWithHer http://t.co/67aQwmoeoy
We cannot go back to the failed policies of the past. We will not go back. America's best days are still ahead. #DemDebate
"In this debate, we tried to deal with the very tough issues facing our country—in stark contrast to the Republicans." -Hillary #DemDebate
Hillary ha luchado toda su vida por los derechos de las mujeres y no va a parar ahora. #DemDebate
Hillary has fought for women her whole life—and she's just getting started. #ImWithHer #DemDebate http://t.co/vr1z1APQxJ
Hillary on the enemies she's proud to have made: "The NRA, health insurance companies, drug companies, the Iranians...and the Republicans."
We cannot afford to have a Republican succeed Barack Obama as President of the United States. #DemDebate
Attacks on Planned Parenthood are attacks on women's health and rights. We can't let them take us backwards. http://t.co/AwABjhfCjg
For too long, issues affecting women—from reproductive rights to paid leave—have been dismissed as "women's issues." Those days are over.
No politician should interfere with a woman's personal medical decisions. Full stop. #DemDebate #ImWithHer
No matter what @carlyfiorina says, paid family leave is good for women, good for families, and good for America. #DemDebate
No matter what @carlyfiorina says, paid family leave is good for women, good for families, and good for America. #DemDebate
Equal pay, paid leave, childcare: These aren't just "women's issues," they're family issues and economic growth issues. #DemDebate
Climate change is real, and threatens us all. We need to act. http://t.co/Jb7DXwL9WS
#ImWithHer ⬇️ http://t.co/1iL3Iwh9T0
"I can't think of anything more outsider than being the first woman president." -Hillary #DemDebate
It's time the entire country stood up against the NRA. http://t.co/l1MEhGvtwt #DemDebate
We need to find the right balance between civil liberties and national security. #DemDebate
There is no place in America for second-class citizenship. #DemDebate http://t.co/vlE5KChnzO
While the GOP focuses on villifying immigrants, Hillary will fight to protect DACA/DAPA and pass comprehensive immigration reform.
We can't wait any longer for comprehensive immigration reform.
Hillary va a mantener a las familias unidas. Expandirá DACA y DAPA, las órdenes ejecutivas, porque es lo correcto.
Los altos costos asociados con la universidad no deberían de ser un obstáculo para todos los que quieren estudiar.
No student should have to borrow money to pay tuition at a public college. http://t.co/7DIAKMjrr4
We need to make college more affordable. http://t.co/McCVDVPPXi
No one is too big to jail–even on Wall Street. #DemDebate
We need to enforce regulations to make sure that middle class families never have to bail out Wall Street again.
Subir los salarios y apoyar a la clase media es una de las prioridades más importantes para el país.
The defining economic challenge of our time is raising incomes for working Americans. http://t.co/Jzsn687rPs
Racial inequality is not merely a symptom of economic inequality.
We can't move forward until we tackle racial inequality that still exists—from economic opportunity to education to community safety.
We cannot keep imprisoning more people than anyone else in the world. #DemDebate
"We need to tackle mass incarceration." -Hillary #DemDebate
"[Benghazi] committee is basically an arm of the RNC—I intend to keep talking about the issues that matter to the American people." -Hillary
Hillary is a progressive who gets things done. #DemDebate
https://t.co/a8Mx1t8ybX
Hillary has the experience we need to navigate a dangerous world and keep us safe as our next commander-in-chief. http://t.co/KeQgNCXD2W
“President Obama asked me to be his Secretary of State. He valued my judgment." -Hillary #DemDebate
We can't allow guns to fall into the hands of domestic abusers, violent criminals, and the seriously mentally ill. http://t.co/PeHPnhuV6K
When it comes to gun violence, we cannot give up. We can't sit by while more good people die. We have to act. http://t.co/ZOptDini2l
Gun dealers and manufacturers who endanger Americans should be held accountable. #DemDebate http://t.co/WPixGaBDLY
Las matanzas no pueden continuar, tenemos un problema con las armas y Hillary va a hacer todo lo posible para solucionarlo.
Gun ownership is part of the fabric of many law-abiding communities—but too many families in America have suffered from gun violence.
We can protect the Second Amendment while also protecting our families and communities from gun violence. #DemDebate
"This has gone on too long, and it's time that the entire country stood up against the NRA." -Hillary on gun violence #DemDebate
We can't wait any longer to act on gun violence prevention. #DemDebate
http://t.co/14HKSnzkUY
"I'm a progressive, but I'm a progressive who gets things done." -Hillary #DemDebate
"I've spent my entire adult life looking for ways to even the odds...to allow each child to live up to its potential." -Hillary #DemDebate
¡El debate entre los candidatos demócratas a la presidencia está por empezar! Véanlo aquí → http://t.co/MnJRIdURQU
Let's do this. #DemDebate http://t.co/y31OQXaa9b
Hillary doesn’t give up and she'll never quit fighting for families—but she needs your help: http://t.co/TtLbKAN2Oe
https://t.co/rBrTa46vY6
One third of black men born today face the prospect of incarceration in their lifetimes. We can do better. http://t.co/2vtiRQZd9v
Hillary takes the stage for the first #DemDebate tonight. Join the conversation—follow these #Hillary2016 staff: http://t.co/4QmPIo5kaB
Happy birthday, @USNavy! Proud of the generations of brave sailors serving our country and the families who love them. #240NavyBday
Today we celebrate Dolores Huerta—teacher, organizer, activist—for her civic leadership and trailblazing spirit. http://t.co/5rWRDcy3O1
Hillary talks sexism in the workplace with @Buzzfeed’s @AnotherRound: http://t.co/R4FNFAWCJY http://t.co/Ustefl9Sjw
Hillary's been debating important issues since high school. Let her know you’re on her team: http://t.co/QPIWimMvL1 http://t.co/aAFnSIcGwK
“One of the merits is I am a woman.” http://t.co/v3W8c6sASU
Thoughts and prayers aren’t enough—we must act to protect families from gun violence. http://t.co/KDBBuXp6W5
“As a woman...you’re expected to be both strong and vulnerable at the same time. That’s not easy to do.” -Hillary http://t.co/kLCYETQ9MG
.@Pharrell: “It’s Hillary time.” http://t.co/fWqT513Esg
https://t.co/kpJ7qdn8SY
We’re not going to “get over it,” @JohnKasich, we’re going to protect Social Security for the next generation. https://t.co/IZrT8dWPRS
Sending support to Tamir Rice's loved ones. Too many black families are mourning the loss of a child. We need to change that reality. -H
"We need their voices, we need their activism." Hillary on the Black Lives Matter movement on @anotherround: http://t.co/R4FNFAWCJY
When Hillary’s mother Dorothy needed a champion, someone was there. Today, Hillary’s fighting for all the Dorothys.
https://t.co/spHT5JgRmH
Honored to have Congressman @repjohnlewis's support. http://t.co/vIxs9BLRMg
“I’ve told @KanyeWest that he might want to wait.” Hillary to @AnotherRound—listen to the full interview tonight. https://t.co/MAnqd9GyCl
Just 30% of girls around the world are enrolled in secondary school. Together, we can change that: http://t.co/Ai12QdbJX0 #DayoftheGirl
"You will surprise yourself with what you’re capable of and the incredible things you [do]." #NationalComingOutDay
https://t.co/Ks0VR4Xomt
40 years ago, I married the cute guy from the library. Happy anniversary, @billclinton—you've still got it! -H http://t.co/H6AaXAKdek
On #NationalComingOutDay, we remember that our work isn’t done until everyone can be who they are and is treated with dignity.
The Republicans are spending millions to try and stop her, but Hillary will never quit fighting for you.
https://t.co/tgwEW7iFQT
Make history and help shatter one of the highest glass ceilings. Apply to be a Hillary for America intern today: http://t.co/BUjkdhZ3Ak
Thank you, @JerryBrownGov. Every state should follow your lead and make it easier to vote.
https://t.co/HWarCEXN8B
.@KatyPerry’s coming to Iowa to support Hillary! RSVP for the Des Moines rally here: http://t.co/6Q3mAppXUq https://t.co/yPQwnegc9j
This #WorldMentalHealthDay, let's commit to ending stigma and making sure those who seek treatment are supported and taken seriously.
Volunteers serenaded Hillary with "Lean on Me" to let her know she has friends in the Granite State.
https://t.co/PhLNLLYNxO
We can protect the Second Amendment while also protecting our families and communities from gun violence. http://t.co/4UBTUq9Po2
.@people is right, we can’t give up. It’s time to act on gun violence. https://t.co/YvHxXm9hNm
Last week, Hillary joined @MarcAnthony on stage at his concert in Miami. Thanks for the warm welcome, Marc!
https://t.co/JeTgFK1oBH
¡Gracias @DoloresHuerta por apoyar a Hillary Clinton! Para escuchar el mensaje de Dolores, envía HUERTA al 47246.
Racism is America's original sin. To those I met with today, thank you for sharing your ideas. -H https://t.co/ICqYepExxB
Ever sent a kid to college? Hillary talks about how she and Bill handled dropping Chelsea off the first time:
https://t.co/LcqpYLHPDT
Thank you, @repjohnlewis. http://t.co/qGmkKWf6UP
If you work on Wall Street and commit a crime, you deserve to go to jail. http://t.co/3ZwT2C7MjG http://t.co/eoA6jneibw
An important question from a young man: “Can you fix the prison problems?”
https://t.co/yDCR348i5G
Hillary sólo tiene una palabra para los Republicanos que insultan a los latinos: ¡Basta! #CHCI http://t.co/uCG4Y5Tqho
Hillary at #CHCI to Republican candidates: Basta. Enough. http://t.co/AiJh6ym58S
My plan for Wall Street: Hold individuals and corporations accountable. Make tough rules and enforce them. http://t.co/xcG7SxrWl9 -H
We need to enforce regulations on Wall Street to make sure that the 2008 crisis never happens again. http://t.co/kc2uUT3AxY
Jeb should stop attacking voting rights and explain what about citizens exercising their right to vote scares him. https://t.co/Xtgz0wcpdl
How about this @KevinMcCarthy for speaker instead? https://t.co/HAwL2D56xu
We need to make sure there’s accountability on Wall Street so there can be prosperity on Main Street.
Hillary on standing up to the NRA: “We can’t just say, OK, nothing we can do about it...We have got to fight back.”
https://t.co/kwRJpE13mp
"You were great on Saturday Night Live...so, can you do for us the Donald Trump impression?"
https://t.co/3V4sZMZEY1
Pres. Obama's student aid bill of rights is critical given ongoing predatory practices by student loan servicers. http://t.co/TG9oleEMje -H
It’s time to end discrimination against LGBT Americans once and for all. http://t.co/9gcJwDFS1Y
Stop the delay, price gouging, and profiting off of others' illnesses. Tell @MartinShkreli to drop the price now. http://t.co/HOS4OXq1ES -H
Hillary's statement on the Trans-Pacific Partnership: http://t.co/dL3f5cCvFP
Diversity is a source of strength and should be celebrated—not denigrated. Proud to launch Latinos for Hillary. http://t.co/FNjXs45QFK
"An act of high political courage." @NYDailyNews on Hillary's gun violence prevention plan. http://t.co/d66WkBOw32
Republicans say they don’t think Hillary has accomplished anything—so she sent them a gift. http://t.co/nO5hZUCEkI http://t.co/EJerPjx4TX
Sorry about the mean tweets you’ve been getting, @KevinMcCarthy—been there! https://t.co/HAwL2D56xu
Add your name if you think it’s time to take action on gun violence: http://t.co/d5G3nBLwbw http://t.co/L2y4gtp9pO
We need comprehensive immigration reform with a real path to full citizenship. There is no place in America for second-class citizenship.
Thank you, @wendydavis. http://t.co/JWPxdyaBr2
We must act to stop gun violence, and we cannot wait any longer. http://t.co/3Qiew1BXiU
Hillary’s commonsense steps will help reduce gun violence and save lives, say @GabbyGiffords and @ShuttleCDRKelly. http://t.co/Q6kczch6Cy
Watch Hillary talk about the best advice her mom ever gave her.
https://t.co/NEbs67GSSn
Being a good parent has nothing to do with sexual orientation or gender identity. http://t.co/q7Qg338Oln
As Republicans spend millions of taxpayer dollars fighting Hillary, she does what she's always done: fight for you.
https://t.co/jIEaUbIU5Q
“It's time for us to say, we're better than this." Hillary's plan to prevent gun violence: http://t.co/2DB7SLJujT http://t.co/xhJW1eY9sB
Protecting communities should be our number one priority—not the interests of the NRA. http://t.co/FkAaMqJSNN
🎵Voy a reir, voy a bailar... 🎵Lanzando Latinos por Hillary con @MarcAnthony. http://t.co/XDyR0defEF
Nicole Hockley—mother of Sandy Hook victim Dylan and founder of @sandyhook—joined Hillary's gun violence town hall.
https://t.co/E1fzpdk69d
It’s time to act on gun violence. http://t.co/V6RP1utuy3
If Congress refuses to act to end this epidemic of gun violence, I'll take administrative action to do so. -H
As president, I'll push to close background check loopholes like the "Charleston loophole" that let the shooter get a gun. -H
It's time to act on gun violence. We simply cannot accept as normal 33,000 gun deaths a year. -H
"It’s time for us to say, wait a minute. We’re better than this. Our country is better than this." —Hillary on gun violence
Watch live: Hillary unveils her gun violence prevention policy in New Hampshire → http://t.co/VfohmlYfvs
Hillary believes it’s time to act on gun violence. Read her plan here: http://t.co/2DB7SM15It
Tune in to @todayshow for Hillary’s live town hall with @savannahguthrie, starting at 7:30 AM ET. #HillaryTODAY
In this week's Facebook Q&amp;A, Hillary took on Jeb’s claim that Democrats use "free stuff" to appeal to minorities. http://t.co/nx2FrUKl5G
With the dangerous weather hitting South Carolina, please stay safe first and foremost. Take care, @HillaryforSC, and all affected. -H
LGBT rights are human rights and human rights are LGBT rights -- period. http://t.co/Plj2NjuRHD
Hillary finally gets to meet the mischievous, trash-eating puppy from the campaign launch video, “Getting Started.” http://t.co/B6YQEu7JkT
We can’t wait any longer to act on gun violence prevention. http://t.co/EZrJVtu8OC
"Let us then tap our fists in friendship." http://t.co/RkRru8dqNE
A vote for Hillary is a vote for four more years of Kate McKinnon's impression. #citizens http://t.co/8WFlf1dy9n
“Congress must pass the Federal Equality Act.” Read Hillary’s remarks to the @HRC: http://t.co/k4uMCAwp61
Hillary on the epidemic of gun violence. http://t.co/FkAaVf0WpC
Grateful to have @NEAtoday on Team Hillary. Educators are the frontline fighters building a stronger America. http://t.co/cdBeoumR8v
"Congress must pass the Federal Equality Act [to] finally outlaw discrimination against LGBT people basically everywhere." -Hillary
"It’s outrageous that, in 2015, you can still be fired for being gay...this kind of discrimination goes against everything we stand for."
"As President, I will push to cut off federal funding for any public child welfare agency that discriminates against LGBT people." -Hillary
"Eleven states ban same-sex couples and LGBT individuals from adopting....one of the cruelest vestiges of anti-gay bigotry." -Hillary
"We need to say with one voice that transgender people are valued, they are loved, they are us" -Hillary at @HRC today
La riqueza de la comunidad latina es su gran diversidad. Estamos orgullosos de lanzar Latinos por Hillary. http://t.co/qSx4bqzeqU
Hillary finally gets to meet the mischievous, trash-eating puppy from the campaign launch video, “Getting Started.”
https://t.co/Hiz2r7qRou
Today the Immigration and Nationality Act turns 50. It was a first step towards making our system fair, but our work remains unfinished.
¡Bienvenido a Latinos por Hillary, @marcanthony! Para también unirte textea LATINOS a 47246. http://t.co/PucWkRU7l0
Join Hillary and @marcanthony: Text LATINOS to 47246 to be part of Latinos for Hillary! http://t.co/5m2FoZc00g
"I am well aware that this is a political mountain to climb....I will, as your president, never relent on trying to work on this." -Hillary
"Republicans keep refusing to do anything to protect our communities. They put the NRA ahead of American families. It is wrong." -Hillary
"We don't just need to pray...We need to act...Republicans and the NRA say, now is not the time to talk about guns. Yes, it is." -Hillary
"What is wrong with us that we can't stand up to the NRA and the gun lobby and the gun manufacturers they represent?" -Hillary
Thanks to #KnowTomorrow student activists, we're better prepared than ever to face the climate challenge. http://t.co/moaclrevjX
Yet another reason we need to restore key protections of the Voting Rights Act. We're better than this. -H https://t.co/HYM1j2irkm
Proud to have @wendydavis on Team Hillary. http://t.co/Ck3TxLbCL5
Another devastating shooting. We need sensible gun control measures to save lives, and I will do everything I can to achieve that. -H
Raising the minimum wage isn’t just a women’s issue -- it’s also a family issue and an economic issue.
https://t.co/Nc3IZrWrRy
The United States is the only country in the developed world without guaranteed paid leave. That has to change. http://t.co/qafJ7MrTRi
In case you were wondering, you should be following hillaryclinton on Snapchat. 👻 http://t.co/eigWQMKXjj
Hillary’s working to earn every vote, but needs your support. Donate by tonight's deadline: http://t.co/XlRpuEsjSi http://t.co/yGBds5whPW
http://t.co/TZG8tREcR1
The @HillaryforNV team held a focus group with some of Hillary's littlest supporters. 👭
https://t.co/OAx1VdOh1M
You shouldn't have to worry about your paycheck or your job when you have a baby or someone in your family gets sick.
“Nobody in America should have to choose between buying the medicine they need and paying their rent.” -Hillary
https://t.co/HmGeuX2vKz
Did you know Hillary once had a job gutting salmon in Alaska? Read about it in her interview with @lenadunham: http://t.co/SKGEVx9nNf
Did you know Hillary once had a job gutting salmon in Alaska? Read about it in her interview with @lenadunham: http://t.co/SKGEVx9nNf
Hillary has a plan to cap covered prescription drug costs at $250 per month: http://t.co/sjwwXiWxzQ http://t.co/YY6guHTOxk
In school, I learned how to think creatively and stand up for myself. #62MillionGirls don't have that chance. http://t.co/BKNW3A0Oqc -H
#PinkOut for @PPFA because they provide quality, affordable health care to those who need it most. #StandWithPP http://t.co/smM6J6N91B
For nearly 100 yrs, Planned Parenthood has stood up to political attacks on women's health while providing care. GOP: You're outmatched. -H
Health care, college affordability, and pumpkin spice lattes—read everything you missed from Hillary’s Facebook Q&amp;A: http://t.co/cu4KW6rQEx
Excited to be part of @lennyletter's first issue! Read Hillary's interview with @lenadunham: http://t.co/MTOp7YMZ1S http://t.co/UcrkdYZFYv
When Republicans attack Planned Parenthood, they’re attacking women’s health. Proud to #StandWithPP—and always will.
https://t.co/frqgxI6sjG
El Papa Francisco tiene razón. Todos los países...tienen la responsabilidad de prevenir el cambio climático. http://t.co/SIBx6iUX7l
During a Facebook Q&amp;A, Hillary responded to Jeb's claim that Democrats appeal to African Americans with "free stuff": http://t.co/o7YVMNXkru
Wishing all Korean Americans and their families a safe and happy Chuseok!
.@NASA has found water on Mars. There is no limit to what we can discover when we explore, ask questions, and listen to science.
Hillary’s hosting a Facebook Q&amp;A this afternoon! Leave your question here: http://t.co/cTFL9SCLYb http://t.co/BYO5Jy6Lom
Families are working harder than ever, but paychecks have barely budged. That needs to change.
https://t.co/pb6Yk6Rhir
Powerful to see @POTUS sit with federal prisoners for this important conversation. It's time to end mass incarceration. #VICEonHBO
Women’s rights are human rights, period. Join Women for Hillary today.
https://t.co/zewoKIuRAJ
.@amyschumer and @lenadunham stopped by HQ: http://t.co/GCydyb9Mfd
You should not have to be the grandchild of a former president to know that you can make it in America.
https://t.co/4BzHfPli2x
Hillary on her vision for the country: http://t.co/rspNDPyGc8
Hillary is on @meetthepress this morning, check your local listings and tune in. http://t.co/lCGmRuU2uo
Xi hosting a meeting on women's rights at the UN while persecuting feminists? Shameless. #Freethe20 http://t.co/hRkaaAnMMp -H
If the medicine you need costs less in Canada, you should be able to buy it from Canada—or any country that meets our safety standards.
.@lorellapraeli, la Directora de Asuntos Latinos de #Hillary2016, comparte su historia inspiradora: http://t.co/Jwma0lxR4J
America’s diversity is what makes us great. The GOP apparently doesn’t see it that way: https://t.co/uirbqn8YAq
Grateful to @Martin_Dempsey for long and distinguished service to our nation. It was an honor to work with him to keep our country safe. -H
"A feminist is by definition someone who believes in equal rights." —Hillary http://t.co/GEjgbbBH5n http://t.co/RB7qrBQAXa
.@lorellapraeli—DREAMer, activist, #Hillary2016 Latino Outreach Director—shares her story of overcoming obstacles: http://t.co/Jwma0lxR4J
Top CEOs earn 300 times more than a typical American worker. That’s wrong. It’s time for Americans to get a raise.
Making friends in Des Moines, Iowa. http://t.co/GZ703gynld
Mikaylah had to write a sentence using the word “can” for homework. A+. (via Instagram/edenrmz) http://t.co/ayH2D35Jgu
Today in 1981, Sandra Day O’Connor became the first woman appointed to the Supreme Court. http://t.co/TjH56UEYx6
Hillary on @Pontifex's climate message: "There’s no time to waste. We have to act now. Pope Francis is right." http://t.co/ia2Ttt33Eo
You don’t have to be a scientist to take on climate change—you just have to be willing to act.
https://t.co/EpZ0Q7DPQ0
For every daughter who dreams that someday, she’ll be president—join #WomenforHillary: http://t.co/RQ8cDCw0GU
https://t.co/2sy5o8PYDc
Wishing a blessed Eid to those celebrating Eid Al-Adha. My thoughts and prayers are with those affected by the tragedy in Mecca today. -H
The official soundtrack for shattering glass ceilings, by #WomenforHillary on @Spotify: http://t.co/SeyywuBxGw http://t.co/Dpj169XB07
Gracias, @Pontifex. Tenemos que cuidar el medio ambiente, crear oportunidades económicas y defender los derechos y la dignidad de todos.
Hillary believes that what’s good for women is good for America. http://t.co/hZBpaZcO2S http://t.co/HwXEVG59Jp
The Senate was right to block a resolution that would defund Planned Parenthood. Now, stop these attacks—and don't shut down the government.
This is our country, and we won’t stay trapped beneath glass. Join #WomenforHillary: http://t.co/RQ8cDCw0GU
https://t.co/6WL9CVVmA2
Thank you, @Pontifex. We have much to do to care for our planet, strengthen economic opportunity, and defend the rights &amp; dignity of all. -H
"A feminist is by definition someone who believes in equal rights." —Hillary to Lena Dunham: http://t.co/GEjgbbBH5n http://t.co/n1jSaz4HnX
.@lenadunham: "Do you consider yourself a feminist?"
Hillary: "Yes. Absolutely." http://t.co/GEjgbbBH5n http://t.co/mAIB4bL28z
It’s not enough to condemn campus sexual assault. We need to end it. http://t.co/M7x2xuNwpb
We must renew the basic bargain of America: If you work hard and you do your part, you should be able to get ahead and stay ahead.
Lower health care costs means families should see savings, not insurance companies. Hillary's plan addresses this. https://t.co/3vIluYFcz3
Hillary opposes the Keystone pipeline. Read why: http://t.co/Yttouh5fA4 http://t.co/C85aNV07ii
Why Hillary opposes the Keystone pipeline: http://t.co/Yttouh5fA4 http://t.co/pnoQAX4P7Z
Diversity is a strength, not a weakness. The GOP disagrees: https://t.co/uirbqn8YAq
"Baseball is 90% mental—the other half is physical." Yogi gave everything at least 140%. We'll miss him. My prayers are with his family. -H
Hillary is joining Tom Joyner on the @TJMShow! Tune in → http://t.co/dpg08DaOwu
Good that Turing will lower an essential drug's price. Hillary's plan would prevent price gouging in the first place: http://t.co/bcNtasrkMN
Time to invest in a clean energy future—not build a pipeline to carry our continent's dirtiest fuel across the US. I oppose Keystone XL. -H
Good. https://t.co/UkOr0vfeHX
Wishing an easy fast for all those observing Yom Kippur.
Hillary's prescription plan would cap out-of-pocket costs at $250 per month. What would you do with your savings? http://t.co/bTIkVKAdkl
"If we’re serious about raising people’s incomes, we have to bring down out-of-pocket costs." —Hillary
"If the medicine you need costs less in Canada, you should be able to buy it from Canada—or any country that meets our safety standards."
"Under my plan, I’ll cap out-of-pocket drug costs for families. You won’t have to pay more than $250/month for covered medications."—Hillary
Hillary’s prescription drug reform plan: "I want to both protect consumers and promote innovation—while putting an end to profiteering."
The uninsured rate is the lowest in decades, but prescription costs, out-of-pocket costs, and premiums are growing. We need to do better.
Hillary on her plan to stop drug companies' price gouging, boost innovation, and keep money in families' pockets → http://t.co/IzqXHljV8R
Outrageous. When companies put profits ahead of safety and the environment, there should be consequences. https://t.co/8zQ6sQp4hz
The best way to celebrate National Voter Registration Day: Register to vote! → http://t.co/7HK2N8lVRo #CelebrateNVRD
We need labor law reform. The #WAGEAct would protect workers' rights, now Congress should pass it. -H
David Axelrod, former Senior Advisor to President Obama, on Hillary’s greatest accomplishments. http://t.co/mrlJNtvFye
http://t.co/Eb9I7oMbY0
Every child deserves the opportunity to succeed, no matter who their parents are or where they’re from.
https://t.co/nAH4oLRfLo
Couldn't agree more, @HumaAbedin. Welcome to Twitter! https://t.co/T8hBwqschV
Hillary on what the attacks against Planned Parenthood are really about:
https://t.co/fmc7ZD6fq8
HBCUs serve some of our brightest students and are a bridge to equal opportunity. Proud to support them this #HBCUweek and year round. -H
At the #Emmys, @violadavis became the first black woman to win Outstanding Lead Actress in a drama. Bravo, Viola! http://t.co/y6wDrj22aG
Can a Muslim be President of the United States of America? In a word: Yes. Now let's move on. -H http://t.co/AB99hiUPie
Price gouging like this in the specialty drug market is outrageous. Tomorrow I'll lay out a plan to take it on. -H https://t.co/9Z0Aw7aI6h
Hillary’s work “was an important part of the reason their lives were better.” http://t.co/xGKG5tU7qM
"These are our moms and our dads.” Keith from New Hampshire thanks Hillary for speaking up for caregivers:
https://t.co/KEnIge8HFJ
A moving moment backstage: "I'm taking care of my mom, she has Alzheimer's...thank you for speaking up for that."
https://t.co/yOWjZoHY3Q
On September 20, 1973, tennis star @BillieJeanKing defeated Bobby Riggs in a match titled “The Battle of the Sexes.” http://t.co/N4MsCT0fn1
Hillary: A champion for women’s rights. http://t.co/ku922NGL2y
Where are we on gefilte fish? Hillary talks emails with @JimmyFallon.
https://t.co/bYCA9j8pej
Carly Fiorina challenged Democrats to name an accomplishment of Hillary’s. @SenatorLeahy accepted: http://t.co/GvqmSQwocN
Keith from NH works part-time so he can care for his mom. He shared his story with Hillary: http://t.co/I01hCm69Pg http://t.co/LoGi99fGPb
"I cannot imagine anyone being more of an outsider than the first woman president."
https://t.co/ybAEte5WkO
"I believe in America, we should have each other’s backs." Watch Hillary at #nhdems2016:
https://t.co/ITmKiVEhhx
.@POTUS is right: When we ensure black women and girls have the opportunity to live up to their God-given potential, America gets ahead. -H
What Every 20-Something Should Know About Hillary Clinton: http://t.co/72dCwQdDM6 via @Refinery29
It's indisputable that having a Democrat in the White House is good for our economy.
Senator Chuck Schumer: Hillary helped “restore the shattered credibility of the United States.” http://t.co/3LTkgRux1L
The hair’s real; the color’s not. Hillary’s impression of Donald Trump on @FallonTonight:
https://t.co/GoyE02ZrOg
Cheers to you, @jimmyfallon. Happy birthday! 🍷 http://t.co/SBMyEfRzWc
Proud to have the support of New Hampshire’s great governor, @Maggie_Hassan. #603forHRC http://t.co/nVS4nIRLHr
Post-speech dance break at the New Hampshire Democratic Party State Convention. (via @ABCLiz) #603forHRC http://t.co/OTUwgrbXv1
“If you want a president who will listen to you, work her heart out to make your life better—then you’re lookin’ at her."—Hillary #603forHRC
.@BarbaraBoxer on Hillary’s greatest accomplishments, from Iranian sanctions to women’s rights around the world. http://t.co/zfRzOtnsCC
A proud step forward. https://t.co/nFR1jcqMj2
“That is what I intend to do.” http://t.co/kmydlAenUP
.@DavidAxelrod, former Senior Advisor to President Obama, on Hillary’s greatest accomplishments. http://t.co/mOBPhR741J
On selfies, gefilte fish, and of course, Donald Trump, with @jimmyfallon. http://t.co/snnSSlVckr
Otro producto del Partido de Trump—@JohnKasich. Hablar sobre los latinos no solo quiere decir hablar de propinas. http://t.co/uQ29lGgFet
Cutting off Americans from lifesaving health care at Planned Parenthood is wrong. #standwithPP http://t.co/XQbcLdzbUJ
The House voting to defund Planned Parenthood is an attack on women's health—nothing more, nothing less. Republicans should be ashamed.
“Any woman who reports an assault should be heard and believed." —Hillary to @Refinery29. Read the interview: http://t.co/8GQaZ109tE
What is Hillary's greatest accomplishment? Here's a list from 20 top American leaders and strategists: http://t.co/CQ4ALy1AZX
Donald Trump not denouncing false statements about POTUS &amp; hateful rhetoric about Muslims is disturbing, &amp; just plain wrong. Cut it out. -H
Love this idea, @smrtgrls. If you were president, what’s the first thing you would do? #SmartGirlsAsk https://t.co/vx3kU3irke
The @VPCinfo report shows we have more work to do to end violence against women in South Carolina and every state. https://t.co/MIXdhXFdBk
Hillary to @SpeakerBoehner: Shutting down our government over a partisan attack on Planned Parenthood is just wrong.
https://t.co/m7ZEPnkjf6
"Don’t attack women’s health care. And don’t shut down the government." Hillary's message to Republicans: http://t.co/L7Uyb3vYmt
Well said, @jimmyfallon. http://t.co/ahhj6gC6BL
Trump: "Are you writing all this down?"

Hillary: "Let me grab my pen..."
https://t.co/PwuDVvfVEu
Heading to New Hampshire and just read that there's an emu on the loose! Seems like a story with legs. -H http://t.co/DftYf4omsY
#GOPdebate http://t.co/XIWFXiqfqR
No, they’re not talking about the GOP debate. Catch Hillary on @jimmyfallon next! http://t.co/sGp03PRv7Y
For a bunch of people who don't believe in acting on climate change, the Republican candidates seem committed to recycling ideas. #GOPdebate
You don’t have to be a scientist to know that climate change is an urgent challenge that threatens us all. We need to act.
We need commonsense reforms that keep weapons out of the hands of criminals and the violently unstable and respect responsible gun owners.
Tired of the #GOPdebate? 

We asked supporters what they were doing instead. 

Here were some of our favorites: http://t.co/nzKXbcOdsf
Fingers crossed we're getting close to the part when they talk about things they're for—instead of against. #GOPdebate
¿Quieres recibir nuestras reacciones sobre el debate republicano en español por mensajes de texto? Envía DEBATE a 47246.
Still a good time to sign up! https://t.co/lmV2gMr8cm
The defining economic challenge of our time is raising incomes. That's how hardworking Americans will get ahead and stay ahead. #GOPdebate
Los estadounidenses que trabajan duro cada día deberían de poder salir adelante. Nuestro desafío económico es aumentar sus salarios.
The GOP's ideas for the economy are just trickle-down economics in disguise. We need a new plan for the 21st century. #GOPdebate
La libertad incluye el derecho de hablar en cualquier idioma. Eso nos hace fuerte como país y es algo que debemos celebrar—no denigrar.
.@realdonaldtrump should stop complimenting women and start respecting them. #GOPdebate
Hard-working, law-abiding immigrant families deserve a path to earned citizenship—not second-class status. #GOPdebate
La idea de que los Estados Unidos va a deportar 11 millones de personas es absurda—totalmente absurda.
What you’re missing if you’re not getting texts from Hillary. Text “REACT” to 47246 to join the fun. http://t.co/TfwoO49ymm
Women—not the politicians on stage—should make decisions about their own reproductive health care. Period. #GOPdebate
Marriage equality is the law of the land. Officials don't have to agree—but they do have to uphold the law. #GOPdebate
America and our allies—especially Israel—will be safer if we enforce the nuclear agreement with Iran.
Tearing up the Iran nuclear deal isn't leadership—it's recklessness.
Síganos en @TheBriefing2016 para nuestras reacciones sobre el debate republicano que está por empezar.
"Como Presidenta, siempre estaré con la comunidad latina." Lea la op-ed de Hillary: https://t.co/xKF1LyXcB8
Congress must reauthorize the Zadroga Act. We owe it to 9/11 responders to provide them with the care they need. #renew911health
Today’s the day the Republican presidential candidates meet for the second debate. Follow @TheBriefing2016 for fact-checks and more.
Assumptions and fear don't keep us safe—they hold us back. Ahmed, stay curious and keep building. https://t.co/ywrlHUw3g1
See where Hillary stands on many issues, from college affordability to voting rights expansion: http://t.co/IB2KxWgZyR
We’re having a lot of fun on @Snapchat. You should follow us! 👻hillaryclinton https://t.co/duO1inxWMM
Encouraging news. We should make it easier to vote in every state. https://t.co/gnqbXAaMOo
I used to love reading to @ChelseaClinton, and now she's written her own book. I’m so proud. Pick up #ItsYourWorld today! -H
While others attack, insult, and denigrate—today we proudly celebrate the beginning of Hispanic Heritage Month. Sí se puede. -H
Hillary has been fighting for women and families her entire life. If you're with her, chip in today: http://t.co/KX61ZTxsM2
Events in Ferguson stem from structural inequities. We need to acknowledge and confront them to move forward. -H 
https://t.co/lhG6J3jVJx
Hillary to every survivor of sexual assault: You have the right to be heard and believed. We're with you.
https://t.co/HPJ2gPPwMs
Hillary's message to survivors of sexual assault: We're with you.
https://t.co/qhLpgr3Iac
Tune in to @extratv tonight to catch Hillary talking Trump, social media, and @KimKardashian. Sneak preview: http://t.co/I8Uk9o8bMW
Unions help keep working families strong. Scott Walker's attacks on unions and workers' rights aren't leadership—they're bullying. -H
RT to join Hillary in telling survivors of sexual assault: We're with you. http://t.co/VmqaI7YQDu
"To every survivor of sexual assault...You have the right to be heard. You have the right to be believed. We're with you." —Hillary
“Rape is a crime—wherever it happens.” —Hillary
“It is not enough to condemn campus sexual assault. We need to end campus sexual assault.” —Hillary
Watch live now: Hillary speaks on the fight to ensure every woman in America can fulfill her potential → http://t.co/FQpxAxA4LX
“We can’t stop the world from changing, but we can help to shape those changes." Hillary and the Iran Deal:
https://t.co/AcpXl6HS5r
"We can lift each other up and leave no one behind." Hillary's remarks at @FoundryUMC yesterday: http://t.co/ctncf8Zfai
Drug and alcohol addiction is a disease, not a moral failing—and we must treat it as such.
Leadership is about strength, smart choices, and an unyielding commitment to America’s values.
https://t.co/OCcqTwsonz
Happy Grandparents Day! http://t.co/wbs8fTzTCF http://t.co/ZiRUj2MSni
L'Shana Tova! To all who celebrate, wishing you a sweet and healthy new year. -H
Every woman and family deserves safety from violence. On VAWA's anniversary, we have more to do to prevent violence and support survivors.
We have an obligation not just to our own children and grandchildren, but to every child in America. http://t.co/CfQ8gXhQ9R
We need to work to make sure that we give every child in America the same opportunities. http://t.co/PW0BVzXITX
Take it from @TheEllenShow. http://t.co/gdi88RUjKg
We need to put our elections back in the hands of everyday Americans. http://t.co/W16DL9R3E8
Every future president needs one. http://t.co/dLsbiEsVC4
At liftoff 23 years ago today, @maejemison made history &amp; became the first African American woman to travel in space. http://t.co/uzN1nf5Ow4
We lost many brave Americans on September 11, 2001—and in the years since, because of it. Today we mourn and honor them. -H
9/11 responders deserve our support for their sacrifice. Congress must reauthorize the Zadroga 9/11 Health and Compensation Act. -H
Five-year-old Macey tells Hillary about her presidential aspirations backstage at @TheEllenShow:
https://t.co/DMu8d6YAbK
Highlight of the week: A sitdown with America’s cutest presidential history expert.
https://t.co/PmglfKYC8H
Dance break. http://t.co/aAUPlwBWZH
Thanks, @TheEllenShow. http://t.co/G2byrNmHG1
Today on @TheEllenShow: @amyschumer, Hillary, a mini Hillary, Ellen, and @Pink. Don’t miss it. http://t.co/DOgEUzAhG3
Hillary has always been a fighter for women. Let her know you’re in her corner, too—join Women for Hillary: http://t.co/5jY38AcaTm
Watch live now: Hillary details her record of fighting for women’s rights → http://t.co/3nbb6d1mE2
Read Hillary’s strategy for tough, smart, &amp; effective leadership on Iran &amp; the Middle East: http://t.co/QEznWQvE1H http://t.co/LBWCL9VPXN
What do @madeleine and @CecileRichards recall from Hillary’s #Beijing20 speech? Read the story behind her remarks: http://t.co/nHvowABTWP
Hillary’s life wouldn’t have been the same without the guidance of some special teachers. http://t.co/DZBxsuZJ7C http://t.co/uPe0lvvI2t
.@DavidMuir asked: “Is your mother’s voice in your ear?” Watch Hillary's response:
https://t.co/rIMUqtmEck
Hillary on Iran: http://t.co/oOBL6A8sQq
"We can’t stop the world from changing, but we can shape the changes...by leading with strength, smarts &amp; commitment to our values."—Hillary
“I will always stand by Israel’s right to defend itself, as I always have.” —Hillary
“As president, I will take whatever actions are necessary to protect the United States and our allies.” —Hillary
"Here’s my message to Iran’s leaders: The United States will never allow you to acquire a nuclear weapon." —Hillary
"Is it perfect? No agreement like this ever is. But is it a strong agreement? Yes. And we absolutely should not turn it down." —Hillary
"I support this deal—as part of a larger strategy toward Iran." —Hillary
Watch live now: Hillary speaks on the Iran Deal → http://t.co/Y7guNMgvs5
A note from Hillary on her email: http://t.co/sD8jTi5tRJ
Hillary to @DavidMuir: "I should have used two accounts... I’m sorry about that, I take responsibility.”
https://t.co/cDPKnCx9l0
Had so much fun at @theellenshow today. Tune in on Thursday! https://t.co/GSJXlaWDMM
This weekend in Iowa, a mom told Hillary: "I’m counting on you to know what it’s like to be a working mother.”
https://t.co/LhURfBj9As
.@TheEllenShow, see you at 30 Rock this afternoon. Pantsuit up!
“That’s going on the mantel—we don’t have one, but we’ll make one.” Scenes from the Women for Hillary launch in NH:
https://t.co/XTABst2R3T
Hillary is committed to overturning Citizens United, the case that helped unleash secret money into U.S. elections. http://t.co/aWC2PNTj9C
Hillary is passionate about overturning Citizens United because she knows firsthand what it’s done to our democracy.
https://t.co/IRFtcQ03al
Food craving? Binge-watch show of choice? 6 things you probably didn’t know about Hillary, via @MSNBC:
https://t.co/Vqur9WmijA
Happy Labor Day, indeed! @POTUS is right: everyone deserves to earn seven paid sick days and 12 weeks of paid family leave. -H
Safer working conditions, weekends, higher wages, a stronger middle class: all brought to you by the US labor movement. Happy Labor Day! -H
Strong support from Senator @JeanneShaheen: http://t.co/vryppsq7IX
20 years ago, Hillary stood up for women's rights worldwide. What do her words mean to you? Share with @Genius: http://t.co/dauCCOC9no
Food craving? Binge-watch show of choice? 6 things you probably didn’t know about Hillary, via @MSNBC:
https://t.co/f0u5pZSdRW
Together we can break the highest glass ceiling. Join #WomenForHillary: http://t.co/1b9mMi7p8B http://t.co/QSqho7cLa2
Through prevention, treatment, and criminal justice reform, we can combat this country's addiction epidemic. http://t.co/srrjmvAowT
Say you’re on Team #WomenForHillary: http://t.co/CchJZe1Nge http://t.co/tJtS2b4b9V
.@nytimes in 1995: Hillary spoke "more forcefully on human rights than any American dignitary has on Chinese soil." → http://t.co/eGYp0JT7Ha
"I chose Hillary because I know her and I trust her. She is a voice for the voiceless." – @JeanneShaheen in NH http://t.co/ObGx7TnApu
When we join together, we can’t be beat. Say you’re on team #WomenForHillary: http://t.co/o9bIdII2aL http://t.co/IYrnUOZPL2
20 years ago today, Hillary stood up for women's rights worldwide. What do her words mean to you? Share with @Genius: http://t.co/fATVWyrBkw
Hillary, 20 years ago today: “It is no longer acceptable to discuss women's rights as separate from human rights.”
https://t.co/TNEXF8jZF4
6 things you might not know about Hillary’s #Beijing20 speech, from conference attendee @finneyk: http://t.co/FbPRGiyG5F
Not everyone wanted Hillary to give her speech on combatting human rights abuses against women in Beijing. Watch:
https://t.co/1mLygMkqHA
"Women's rights are human rights.” Make a statement—in 6 different languages—wherever you go: http://t.co/ofU2KVwDcU http://t.co/nocsrXPmWc
Hillary está a punto de hablar en San Juan, Puerto Rico. Véanlo aquí: http://t.co/6F9CpL2pO2
Hillary sat down with @mitchellreports to talk about everything from her emails to her vision for America. Watch:
https://t.co/oXOCQ9n4Lc
"When Hillary Clinton cares deeply about something, she is more than willing to be bold and take risks." http://t.co/IwRR3Kf01u #Beijing20
What inspires Hillary about #Beijing20: how women around the world have taken up the call themselves. Watch:
https://t.co/XhMfCKO2aQ
Whatever language you speak, you should feel welcome in America. http://t.co/atdAyenhnT
Our friends at @BitmojiApp are marking the 20th anniversary of Hillary's speech in Beijing. Make yours today! http://t.co/GVEiNbiKbb
Meet "ThxBox"—a personal thank you from Hillary. Get on the waiting list to find out more: http://t.co/VOXlYiycaI http://t.co/NntUpyTOgA
Marriage equality is the law of the land. Officials should be held to their duty to uphold the law—end of story. https://t.co/9WfxgULBga
“I knew we were watching history being made.” What it was like to be there when Hillary stood up for women worldwide: http://t.co/8OCn3BW2x9
"We should be saying that enough is enough.” Read Hillary's plan to address America’s substance use epidemic: http://t.co/t8sDgsOgZS
“Women’s rights are human rights.” Watch Hillary say the words that are as true now as they were in 1995. #Beijing20
https://t.co/BtcIcXaiai
Great news that the Iran Deal has enough votes; as POTUS, I would aggressively enforce it and counter Iran’s other malicious activities. -H
“Our tribe learned the hard way that one-size-fits-all prevention programs don’t work.” http://t.co/gO9kNFeznv http://t.co/jvtO1ej6Vd
"We as a nation need to get over the fiction that willpower is the cure for a brain disease." http://t.co/gO9kNFeznv http://t.co/KSqlV5s5CT
"I rode with Hillary in her car to the conference hall." Watch the story behind Hillary's iconic #Beijing20 speech:
https://t.co/sMD2k1UC04
Starting now! Ask policy experts @mayaharris_ &amp; @sarasolow your questions: http://t.co/LtTRauX0kP https://t.co/Hk1uMgXVWQ
How will Hillary address the substance abuse epidemic? Join @mayaharris_ and @sarasolow for a Q&amp;A today at 12:30 ET: http://t.co/LtTRauX0kP
“For too long, we have had a quiet epidemic on our hands.” Read Hillary’s plan to address drug and alcohol addiction: http://t.co/t8sDgswFBi
Reviewing notes on the way to the conference, Hillary knew the #Beijing20 speech would be her most important yet:
https://t.co/sBIqqeWRyw
Magic hour in Iowa. 🌅 http://t.co/TqWgfbFsFL
Why is @GovHowardDean on Team Hillary? Her sense of justice, smart policies, and commitment to middle-class workers. http://t.co/1hx6ubnw1q
.@GovHowardDean for Hillary: "I want her compassion and leadership in the Oval Office.” http://t.co/1hx6ubF7q0
Born September 1, 1933, Ann Richards was the 1st woman governor of TX in her own right—and a fighter for families. http://t.co/FYXCIEn4Fw
In 1995, Hillary led the US delegation to the UN Women’s Conference, despite opposition. #Beijing20
https://t.co/FdV4cO6MYx
20 years ago, Hillary gave her historic speech to the United Nations Women’s Conference. #Beijing20
https://t.co/aqf58ZbScH
Retweet if you agree. http://t.co/OjW9FBzlfm
Read Hillary and @SenatorBaldwin’s op-ed on a bill to stop the revolving door between Wall Street and our government: http://t.co/XkUGfJqF3c
Read Hillary and @SenatorBaldwin’s new op-ed on a bill that will help restore Americans' trust in government: http://t.co/XkUGfJqF3c
Watch Hillary say: “We have got to do something about gun violence in America—and I will take it on.”
https://t.co/9sbP4UHW41
We must expand access to health care &amp; education in rural areas. That’s the key to strong families &amp; strong futures. http://t.co/q9Qjhvyrtp
http://t.co/pnVyoZkiLg
A big question from a small supporter in Iowa: How will Hillary get things done? See her answer:
https://t.co/GwveqoBuis
101-year-old Jerry—born before women had the vote—joined @TheDemocrats in Minneapolis yesterday for Hillary’s speech. http://t.co/kd2DnSiMWA
A strong America depends on strong rural communities. Learn more: http://t.co/q9Qjhvyrtp http://t.co/5yV7w8nT07
Today, we remember those lost in Katrina &amp; recommit to finishing the work of rebuilding. No city should have to endure what NOLA endured. -H
On this anniversary of the March on Washington, we honor those who fought for civil rights. We must commit to continuing the fight today.
"I want to let you know that as your president, I will first and foremost be a champion for our children."—Hillary http://t.co/7mRxiFXQRl
For prosperity to be real and lasting, it has to take root in small towns and rural areas as well as urban ones. http://t.co/q9Qjhvyrtp
What Republicans are saying about women may be red meat in a GOP primary—but it's wrong in 21st-century America.
https://t.co/SrQVhKJVoq
"If calling for equal pay and paid leave and women's health is playing the gender card, well, then, deal me in."—Hillary
Live from the DNC: Hillary is speaking about strengthening the middle class and moving this country forward. Watch → http://t.co/IE1LPM7wca
Denying women access to health care might be good politics in a Republican primary, but it’s terrible policy in the real world.
May #ErikaPR bring enough rain to end the drought, but cuidado con los vientos. ¡Pensando en ustedes, Puerto Rico! -H
"We've got to come to terms with hard truths about guns in America."
https://t.co/Wf2SFrAZKb
Tome el quiz para ver cómo el plan de Hillary te bajaría los costos de la universidad. Textea UNIVERSIDAD a 47246. http://t.co/eNaE56diCf
We lose people to gun violence every day. It’s time to come to grips with this.
http://t.co/q05u9Hjlgd
Hillary is laying out her vision for strengthening the middle class in Cleveland, Ohio. Watch live: http://t.co/nWCT1TLc2x
"We are smart enough—compassionate enough—to figure out how to balance legitimate Second Amendment rights with preventive measures."—Hillary
Equal pay, paid leave, childcare: These aren't just "women's issues," they're family issues and economic issues. #WomensEqualityDay
We need to recognize that quality, affordable childcare is not a luxury–it's a growth strategy. #WomensEqualityDay
No woman should have to go back to work 24 hours after giving birth. #WomensEqualityDay
The United States is the only country in the developed world without guaranteed paid leave. This needs to change. #WomensEqualityDay
Too many women still earn less than men on the job—and women of color often lose out the most. This needs to change. #WomensEqualityDay
95 years ago, Henrietta fought for women's right to vote. Her granddaughter wrote us a letter: http://t.co/bFiDVCgyVv http://t.co/z8Zca9fnBW
"A strong America depends on strong rural communities." Read Hillary's plan: http://t.co/q9Qjhvyrtp http://t.co/ZSFgZabwHX
"We have got to do something about gun violence in America."
https://t.co/L3xZHMUTVZ
Heartbroken and angry. We must act to stop gun violence, and we cannot wait any longer. Praying for the victims' families in Virginia. -H
"Hillary Clinton has the right policies to strengthen and expand the middle class."—Former Iowa Governor Tom Vilsack http://t.co/l3BTNlQjCQ
Before midnight: Last chance to pitch in and have your name added to the new Donor Wall at HQ!→http://t.co/YK25oJk0RY http://t.co/GQq3Xcr9Pd
“Hillary Clinton is not new to the fight for middle class families.” —Former Iowa Governor Tom Vilsack http://t.co/l3BTNlQjCQ
Tome el quiz para ver cómo el plan de Hillary te bajaría los costos de la universidad. Textea UNIVERSIDAD a 47246. http://t.co/HU5hzD9C76
"AmeriCorps is a...cost-effective solution to some of our nation’s most pressing issues." Hillary wants to expand it: http://t.co/u0wPP0s9fs
Reminder: Jeb isn't the only Republican who wants to defund Planned Parenthood. Hillary's message to all of them:
https://t.co/aayHEMCfNl
What does Jeb think cancer screenings, STI tests and treatments, birth control, and prenatal care are?
https://t.co/30CMcxokfW
Jeb is just wrong.

✔️ 2.7 million patients for
✔️ 900K cancer screenings and
✔️ 4.5M STI tests and treatments/year https://t.co/dpbWI0jn1E
How do Jeb Bush and Donald Trump differ on immigration? Spoiler alert: They don't.
https://t.co/dSPxK07bEC
Purging 34,000+ voters from Kansas elections is no administrative rule—it's a targeted attack on voting rights. http://t.co/gz5VZPjMrB
¿Pueden adivinar cuál es la diferencia entre Donald Trump y Jeb Bush sobre el tema migratorio? Nosotros no.
https://t.co/Jy5kFpY56o
Making being a nerd look cool since 1965. Happy #firstdayofschool to everyone starting today! http://t.co/q59lMx1JGb
No student should have to borrow money to pay tuition at a public college.
It’s never too early to start asking the tough questions. In case you missed it: http://t.co/OVemv3pN3U
Shop the HFA pop-up shop today at @bkflea! For a preview of items for sale, visit the online store: http://t.co/e8PmDiZNKQ
Thank you to these brave servicemen for risking their lives to prevent a far worse tragedy. http://t.co/Bo8S3583PU
Need a better understanding of Hillary's use of email as Secretary of State? @brianefallon is breaking it down now: https://t.co/DgKjPZKv9n
"When you see that you've got CEOs making 300x what the average worker is making, you know the deck is stacked."
https://t.co/PMAX1XZjwO
.@TheEllenShow's new clothing line celebrates girls being themselves, free from gender stereotypes. Hear, hear! http://t.co/A50xMvyU1x
Hillary wants to expand @AmeriCorps from 75,000 to 250,000 members. See how AmeriCorps changed one volunteer’s life: http://t.co/NsNj3yJVVq
About that email "scandal"—we fact-checked the tweets:
https://t.co/FqfFt9m2YL
A dad in TX is taking over our Instagram today. See how Hillary's college plan will help him: http://t.co/N09gfgmFmN http://t.co/FQyIvX23Jp
The determination to never quit knows no gender. I'm so proud of these soldiers. -H  https://t.co/Dm31KZxz0K
From a former @TheJusticeDept official: “Our ridiculous classification rules” are the real problem: http://t.co/zdsAki3KG9
Add us on Snapchat! 👻 hillaryclinton http://t.co/n1S0bnFlSX
Grab the She’s Got Your Back(pack) and gear up for back to school: http://t.co/YFbJHEUOYQ
https://t.co/XhUzTHYSer
Se llaman "bebés," "niños," o "ciudadanos." https://t.co/ofxEG6Za00
Thanks to @nyliberty, Kymora’s back on the court—right where she belongs. #GirlPower http://t.co/Uhn8Ttyvu7
How about "babies," "children," or "American citizens." https://t.co/ofxEG6Za00
They may not have Donald’s pizzazz, but the rest of the GOP candidates are singing his tune:
https://t.co/iR72ZYB4BB
But what about @LinkedIn? http://t.co/6Gh727BbRr https://t.co/26SJu0Ma9W
They're called babies. https://t.co/VyJJA26OVl
After all these years, nobody makes me laugh like @billclinton. Happy birthday! -H http://t.co/8fNuVQ0BKV
.@SenatorHarkin: Hillary's a fighter “for those who have dreams.”
https://t.co/kHXxzGOH53
Question of the day—“Do you think that when you’re president, you’ll be paid as much as a man?” Hear Hillary answer:
https://t.co/IZayRKx31y
About time. https://t.co/cML4UqfCAT
The best way to honor women who broke boundaries before us: Keeping it up. See the timeline: http://t.co/lB63pCTE8v
“Thank you for caring about student parents—I was one 17 years ago!” From one mom (and PhD) to Hillary:
https://t.co/sRjY3Y76Hd
16 million Americans have gained health insurance from the Affordable Care Act. We need to protect it—not repeal it.
95 years ago today, women got one step closer to winning the right to vote. Here’s to making history. http://t.co/tpgGIWkzPI
The Arctic is a unique treasure. Given what we know, it's not worth the risk of drilling. -H
.@madeleine is right: We can't afford another President Bush who would take us backward on Iraq and foreign policy. http://t.co/1el2pxWKeT
Back to school game strong. Shop the new collection: http://t.co/YFbJHEDe7i http://t.co/QL3nUO84dT
Hillary explains why she supports @POTUS's @TheIranDeal—learn more:
https://t.co/nClYHToIpj
Thought you’d never ask. Text “GO” to 47246 for updates from the campaign. http://t.co/cy0IeCompp
"She has so much compassion and it shows. She's a person, she's a grandmother, she's somebody's mother." http://t.co/JoqSQ2bdGc
One of the single biggest ways we can raise incomes is by making college affordable and available to every American.
If you can refinance your mortgage or your car loan, you should be able to refinance your student loan.
If schools load students up with debt for programs that don’t lead to good-paying jobs, they should be accountable, too.
Students should never have to take out a loan to pay for tuition at their state’s public university.
Interning at #Hillary2016 HQ in NYC:
✔️ Free coffee
✔️ Great views
✔️ The chance to make history

Apply today → http://t.co/519xG6Q5h2
Warming up for Team Hillary: Jason Collins visits campaign HQ.
https://t.co/QywK7wQ6De
I am deeply saddened by the passing of Julian Bond. We owe him a debt of gratitude for his fight for equality and justice. -H
Take this quiz to see how Hillary will help you afford college or manage your existing debt: http://t.co/pUmTbVku1E http://t.co/I4D04Hho46
"I’ve been fighting for families and underdogs my entire life and I’m
not going to stop now."—Hillary in Iowa http://t.co/PtIwh4ef0o
Abrimos la embajada estadounidense en La Habana. Simboliza un paso hacia adelante en la relación entre nuestro país y el pueblo Cubano.
We need to make quality education affordable and available to everyone willing to work for it–without saddling them with decades of debt.
More and more, paying for college is pushing people’s dreams further out of reach–and that’s just wrong.
✔️ Lower interest rates
✔️ Never pay more than you can afford
Hillary’s plan will relieve the burden of student debt: http://t.co/A4pWb3fOf4
Why does Hillary love Snapchat? Watch and learn:
https://t.co/ZkevdcvZOY
Watch live: http://t.co/Pt1EItN0EY https://t.co/HRWtcSqTAJ
Devastated by horrific reports of ISIS sex slavery. People of all faiths must unite to condemn &amp; end these crimes. http://t.co/aa8lJrMizg -H
To strengthen American families, we need to prevent systemic drug abuse and support those seeking treatment. http://t.co/sCKeQ1UOR1
Today is Social Security's 80th birthday. Congrats on reaching what some Republicans think should be the retirement age. -H
Last chance! Vote for your favorite design to become the new #Hillary2016 bumper sticker: http://t.co/IaAD4gKOlY http://t.co/84j6JQMqah
We should make voting easier—not harder. Why is voting important to you? Share your story: http://t.co/Z1Nr11mfcz http://t.co/BkN5xrPqd5
This was emailed to us with the subject line 'MESSAGE FROM THE TOP OF MT. DEMOCRAT': http://t.co/QS5hejr1sk
We need to make education affordable and available to every American. Find out how Hillary’s plan will help you: http://t.co/PruKIXQQqo
Team meeting. http://t.co/Ol0MreEjic
QUIZ: How will Hillary's plan help you afford college and pay off student loans? Find out→ http://t.co/PruKIXQQqo http://t.co/xdXefoz1MZ
Proud mom alert: Love what you wrote about #WorldElephantDay, @ChelseaClinton. http://t.co/tXM30ICvC8 -H
My thoughts and prayers are with President Carter and his family. -H
¯\_(ツ)_/¯ 
(But in all seriousness: http://t.co/A4pWb3fOf4) http://t.co/qQBYSnkJZa
Courageous words from @NicoleHockley. We need commonsense gun reform. http://t.co/RpcbQFNZ8m
The Affordable Care Act is working. That's why we're going to defend it. http://t.co/eZ4j6R43SR http://t.co/Y3hQqZiGd0
We can all do our part to make sure every young person has the opportunity to reach her or his full potential. http://t.co/QAgss4qRdD
How does your student loan debt make you feel?
Tell us in 3 emojis or less.
“We do have to speak out about it.” Watch Hillary say we need to stand up against cyberbullying:
https://t.co/qBWQ2clZQL
#Hillary2016 gear + an adorable pup = one amazing family photo. (via andyjameswhite on Instagram) http://t.co/wZ85HkyLhk
What do you think should be the next #Hillary2016 bumper sticker? Vote for your favorite: http://t.co/k4csUNaRff http://t.co/AvY5Evllrr
Republicans like Gov. Walker are making it harder to afford college &amp; pay off debt. Hillary says that’s wrong—watch:
https://t.co/5MUicqTUTm
“I want every young person in America to know that if you work hard, you can get ahead, and I want America to have your back."—Hillary in NH
Access to higher education should be a right, not a privilege for those who can afford it. http://t.co/A4pWb3fOf4 http://t.co/TNWOJw3ZxE
We need to rein in how much higher education costs . It’s time for a new college compact that makes education available to all. -H
Lo que dijo Trump sobre Megyn Kelly es indignante, pero el peor insulto son las políticas de los Republicanos que afectan a la mujer.
Let’s relieve the crushing burden of student debt. Learn more about Hillary’s plan: http://t.co/A4pWb3fOf4 http://t.co/i7mZY9Xoph
Agree that every student should be able to afford public university tuition without taking out a loan? Add your name: http://t.co/eU9R8254o9
Add us on Snapchat! @hillaryclinton 👻 http://t.co/ZpfETuFgDM
What Trump said about Megyn Kelly is outrageous—but what's really outrageous is Republicans' actual positions on issues that affect women.
This is about ensuring families can get ahead—&amp; having the greatest workforce in the world. Win-win. #MillennialMon https://t.co/4VSvLzZZ09
Everyone needs to step up to make education more affordable. Hillary's plan: http://t.co/A4pWb3fOf4 #MillennialMon https://t.co/29oDhkQthk
A5 Rising tuition leaves families with a painful choice: pass up on a degree,  or do whatever it takes—even go way into debt. #MillennialMon
Cost won't be a barrier to an education. Debt won't hold you back. Read Hillary's plan: http://t.co/A4pWb3fOf4 http://t.co/KVyr8SlSVn
Watch live: Hillary is laying out her plan to make college affordable &amp; relieve the crushing burden of student debt → http://t.co/RFZKk4gUcf
Let’s make college affordable, relieve the crushing burden of student debt, and help every family get ahead. Watch:
https://t.co/i3mQP8h4HX
#Hillary2016 is on Snapchat! Add us: @hillaryclinton 👻 http://t.co/JvDuvXrGIm
From Beijing to Brooklyn (with plenty of stops in between)—follow some of Hillary's memorable moments on @Pinterest: http://t.co/cLwTvurEZ6
Voting is “the very essence of the American dream.” Read #MyFirstVote stories on @Tumblr: http://t.co/Z1Nr11mfcz http://t.co/FI4boP54Fg
A year after Ferguson, there is more we must all do to address systemic racism and ensure every American feels safe in their community. -H
Join Hillary's fight to build an America where we don't leave anyone out or anyone behind: http://t.co/fHWH8uaBa4 http://t.co/9MpXn38lzf
Hillary's pinning her way across America! Follow her on the campaign trail: http://t.co/B7MvKOcop8 http://t.co/6JCCAPdW2F
Rolling back rules for Wall Street won’t help families get ahead.
How to say “Go Hillary!” in Spanish. Cómo decir “Go Hillary!” en español. http://t.co/6YPNHJVVGX
Read more #MyFirstVote stories and share your own: http://t.co/Z1Nr11mfcz http://t.co/8nwdXZuHKz
4,000,000 followers. Wow! Thanks for joining us—#TeamHillary wouldn’t be the same without you. http://t.co/K6uVNhTBp2
Hillary's fighting for immigration reform that keeps families together. Read the Facebook Q&amp;A: http://t.co/EVdGCtDdSD http://t.co/GvP88HlAQ8
We need to make sure there’s accountability on Wall Street so there can be prosperity on Main Street.
America's strength lies in families &amp; communities. Sign up to support Hillary's plan for a fairness &amp; growth economy: http://t.co/FeZESF38dD
"Everything is going to change now." Read more #MyFirstVote stories on @tumblr &amp; add your own: http://t.co/Z1Nr11mfcz http://t.co/Ingq3iDUYg
Missing Jon Stewart already. #GOPdebate #JonVoyage -H
RT if you're prouder than ever to be on Team Hillary. http://t.co/3ljORlSvHw
Watch the #GOPdebate? Bet you feel like donating to a Democrat right about now. http://t.co/pGlQCqQgOP http://t.co/QP1e0yObMf
Hillary Clinton sabe que la economía favorece a aquellos con más recursos. La agenda Republicana solo empeoraría el problema.
If GOP attacks on @PPFA feel like an assault on women's health, it's because they are. http://t.co/aBkawOvo3z http://t.co/ZtLJYortD0
No one should be discriminated against because of who they love. http://t.co/hsarT0Kpkv
It's past time for politicians to respect women's right to make their own health decisions. http://t.co/nDxYoPFctb
We should change how we think about business. http://t.co/61YZQWxaPw
Share this if you're proud to support a candidate who's fighting for everyday Americans. http://t.co/Gkas6qvrm2
Access to health care should be a right—not a privilege for those who can afford it. http://t.co/zVkxIhMKq7
Watching the #GOPdebate? Follow @TheBriefing2016 for fact checks and more. https://t.co/fXeiI5XRjd
Fixing our immigration system will strengthen families, our economy, and our country. http://t.co/z3h3ho4fZZ http://t.co/oRF5b3ROSR
Hillary is proud to #StandWithPP. RT if you are too. http://t.co/F5Wq1C054S
Follow @TheBriefing2016 for real-time fact checks on the #GOPdebate—starting now. https://t.co/FkNwtmWGBI
“Republicans are systematically...trying to stop millions of American citizens from voting. What part of democracy are they afraid of?”—HRC
Add your name if you agree with Hillary: We should make voting easier, not harder → http://t.co/unc0PWLnBS http://t.co/vqUMQrD4uE
Watching the #GOPdebate tonight? Follow @TheBriefing2016 for fact checks and more.
On #VRA50, we still have much more work to do to protect the right to vote.
https://t.co/YAuQXEX06v
On the 50th Anniversary of the Voting Rights Act, read #MyFirstVote stories from Americans across the country: http://t.co/Z1Nr11mfcz
50 years after the Voting Rights Act, we can't let anyone undermine America's promise: Everyone's voice and vote count. #VRA50 -H
Hemos tenido muchos abuelos en @lacasablanca, pero nunca hemos tenido una abuela. —Hillary en @scdp: http://t.co/wht093L78R
Good that the appellate court saw the Texas voter ID law for what it is—an assault on the right to vote. http://t.co/dkyhPz3f19
Tomorrow is the 50th Anniversary of the Voting Rights Act—what does the right to vote mean to you? Share your story with #VRA50.
“I'm tired of women being shamed and blamed and dismissed…When you attack women's health, you attack America's health.”—Hillary yesterday
No parent should have to choose between getting a paycheck and caring for their baby. Well done, @Netflix. https://t.co/gDsKCuWrGe
"We’ve had a lot of grandfathers in the White House, but we haven’t had a grandmother." —Hillary at @scdp: http://t.co/4hbdtxe4Ya
The Voting Rights Act turns 50 this week. When did you cast your first ballot &amp; what did it mean to you? Share your story with #MyFirstVote.
To a dear friend, a great boss, and my second favorite president: Happy birthday @POTUS! -H http://t.co/J3WRZJ1KuG
.@JebBush: You are absolutely, unequivocally wrong. https://t.co/a6O17dlEh4
"If we want a competitive future for our kids, they have to be better prepared when they walk into kindergarten."—Hillary
Hillary's spent her entire life standing up for kids &amp; families. Watch one of our first TV ads of the 2016 campaign:
https://t.co/1WNZO5Wavj
Vean los mejores momentos del discurso de Hillary sobre Cuba que pueden compartir por @WhatsApp → http://t.co/qmEuW1gaM4
Hillary stands with Planned Parenthood. Add your name if you do, too: http://t.co/A9YIs0S73W #standwithPP http://t.co/dVY6B1fQ7o
2.7 million Americans turn to Planned Parenthood every year for health care. Proud to #standwithPP. http://t.co/TaMAc3YgEr
.@POTUS is right—we can't wait for another generation to tackle climate change. Our future depends on what we do today &amp; in the next decade.
Republicans are trying to cut millions off from health care. Hillary has a message for them. #standwithPP
https://t.co/iIz1sUPu2z
Their names are emblazoned on our hearts.
https://t.co/flfIColGIl
Decades of fighting for everyday Americans in just 1 board. Follow some of Hillary's memorable moments on @Pinterest: http://t.co/cLwTvurEZ6
Our first TV ad of the 2016 campaign: Watch Hillary tell the story of her mom, Dorothy.
https://t.co/K62hyntMt9
Are you on Team Hillary? Chip in $1 to support this campaign, and get your official limited-edition supporter card: http://t.co/wZNvt33x3g
Three cheers for all the athletes who competed at the @SpecialOlympics this week—your spirit and determination inspire us all! #LA2015
http://t.co/itkbQHFiF7
"We can't go on like this. We are better than this. Things must change." Hillary at @NatUrbanLeague:
https://t.co/wPJXsRUcMe
Become a card-carrying member of Team Hillary! Chip in $1 &amp; get your official supporter card: http://t.co/H3ytOKZQVs http://t.co/WLrEEBvfc4
Fighting to dismantle voting rights, health care, and living wages? That doesn't sound like the right to rise.
https://t.co/QhEGIkCzCP
"Lifting the embargo doesn't set back the advance of freedom. It advances freedom."—Hillary on Cuba http://t.co/QTEtIHgNxr
Voting rights, equal pay, immigration reform, LGBT equality—see more of What We're Fighting For on Pinterest: http://t.co/wXjnrgWUre
Yesterday, Hillary spoke at @NatUrbanLeague on systemic racial inequality in America—and how we can help fix it: http://t.co/PbYFT8KVxO
A photo we had to share: @Wellesley's Alumnae Ultimate team (named for Hillary!) plays in extra-appropriate uniforms. http://t.co/LPIoXHHrWz
Check out Hillary's ideas for a stronger, more prosperous relationship with Cuba and the Americas: http://t.co/2KNm6Be9jW
On Sunday, Sara took over our account for #ADA25—her story inspired @elizejackson to share more #DisabilityStories: http://t.co/8hETXknkXE
"We can't go back to cowboy diplomacy and reckless war-mongering...We need a foreign policy for the future."—Hillary
"The United States needs to lead in the Americas. And if we don't, make no mistake—others will."
Closer ties across Latin America will help our economy at home, and strengthen our influence around the world. http://t.co/RBVgYpGcGu
Republican candidates have it backwards on the Cuba embargo. http://t.co/BO7QBIBOWr
"The Cuba embargo needs to go, once and for all."—Hillary in Miami
"I understand the skepticism...But you've been promised progress for 50 years. We can't wait any longer for a failed policy to bear fruit."
"We must decide between engagement and embargo—between embracing fresh thinking and returning to Cold War deadlock."—Hillary
En vivo desde Miami: Hillary pide el levantamiento del embargo a Cuba → http://t.co/dAPfBBVeLE http://t.co/HEZm5wIL7e
We need to look to the future—not stay stuck in the past. Watch Hillary speak on Cuba: http://t.co/dAPfBBVeLE http://t.co/fs6Yj0l57a
These names are emblazoned on our hearts. http://t.co/beOwVAVwn5
"The opportunity gap that America is facing is not just about economic inequality. It's about racial inequality."—Hillary at @NatUrbanLeague
"Race still plays a significant role in determining who gets ahead in America and who gets left behind." —Hillary today at @NatUrbanLeague
Watch live as Hillary speaks to @NatUrbanLeague in Fort Lauderdale, Florida: http://t.co/vgYXp2Oj1R #SaveOurCities
Proud to stand w/Planned Parenthood &amp; for access to quality, affordable healthcare for women, men &amp; young people. -H https://t.co/XLuRvxzsyZ
Medicare and Medicaid stories: Celebrating 50 years of lives saved. http://t.co/ZzKXlXLFSQ #KeepingUSHealthy http://t.co/05w6Ma8Zw8
Education, equality, and black coffee (sometimes). Read what Hillary's all about in @theskimm! http://t.co/2Vlnj5IWHX http://t.co/GF2E0QWI7P
Medicare and Medicaid have saved lives for half a century. An attack on them is an attack on seniors and vulnerable Americans. -H
Are you on Team Hillary? Chip in $1, and get your official limited-edition supporter card: http://t.co/kYi2GzsT7y http://t.co/MUL8GUJ7qZ
Don't miss the most important updates from Hillary &amp; the campaign. Confirm you're on the official #Hillary2016 list: http://t.co/g2nbXshOrj
Rising fifth grader Emily had a big question for Hillary in New Hampshire:
https://t.co/8U0uY3gD3C
No podemos negar el cambio climático. http://t.co/l2hJBII8ya http://t.co/YV4WUkok7D
"If equal pay for equal work is playing the 'gender card,' then deal me in."—Hillary yesterday in NH
We must take action on climate change. http://t.co/cBn7RAh9Fh
As part of her plan to meet the climate challenge &amp; make the US a clean energy superpower, Hillary's setting 2 goals
https://t.co/uqjEbdJ18G
She gets it. http://t.co/fhCh7bMSiW http://t.co/woCtP4Xj5C
"I want little girls everywhere to grow up knowing they can do anything—even play football." Brava, Coach @jwelter47! http://t.co/TDT9NxWPrX
Fighting #climatechange is critical to protecting our environment, powering our economy &amp; safeguarding our country. http://t.co/WUClDwLhb2
Follow along at #ChatClimate as @HillaryforSC chats with local activists on Hillary's clean energy goals: https://t.co/j9qsBlNBLb
The winds of change are blowing in. Grab the Green Tee to support Hillary's climate agenda: http://t.co/qeBatnUNcT http://t.co/TXmvAELK4A
Hillary just unveiled the first steps of her broad #climatechange agenda. Here is #2: http://t.co/xG0UKQ7To7
Hillary has a plan to take our renewable energy production to the next level. This is just step one: http://t.co/kFlFJPtMN7
Join the fight against #climatechange while wearing the all-new Green Tee: http://t.co/qeBatnUNcT http://t.co/Ic20Aswcbk
Happening now in Des Moines: Hillary's discussing the first steps in her plan to address climate change. Watch live: http://t.co/1IFvzDfZoD
"There has never been a better moment to reimagine how we power America." – @johnpodesta, #Hillary2016 chair: http://t.co/rF84eipt3Z
We don't hide from change. We harness it. Learn more about Hillary's environmental agenda:
https://t.co/pYCDcgWCFU
Stand with Hillary for a healthier climate: http://t.co/l2hJBII8ya http://t.co/a2Z5Hi6eBk
We have to do much more—and we have to do it now. Watch the video:
https://t.co/0nr45wb06j
You don't have to be a scientist to accept scientific evidence. Climate change is real and we must act. -H
https://t.co/jV0k5v5P4I
Today, we handed our account to Sara to celebrate #ADA25 and what it means for families. Read it on @Storify: http://t.co/pVPLubfxJe
Thanks for listening. Follow along at @HillaryforIA as we celebrate #ADA25! —Sara http://t.co/Do6PFzytwb
Iowa's @SenatorHarkin co-authored the ADA. We're proud to have been represented by such a strong champion for people with disabilities.
I’ll never forget the first time Adam met Hillary. At a dinner in 2007, Adam broke away from us &amp; ran up to her.
We’re grateful for supportive teachers. In junior high, his PE teacher called &amp; asked if Adam would go for cross country.
Through Adam, we informally raise awareness for people with disabilities every day: It's as simple as taking pride in the small things.
One thing that concerns us as Adam gets older is what happens after he finishes school.
Adam’s service dog Turbo is a huge part of our lives. He goes everywhere with Adam, including school.
His father Dale &amp; I work, so Adam spends summer days at @TheArcUS. Yesterday we celebrated ADA Night at @CRKernels! http://t.co/n8ysuMoseC
I’m Sara—mom, nurse &amp; lifelong Iowan. I'm taking over @HillaryClinton today for the 25th anniversary of the Americans with Disabilities Act.
Thrilled to hear HHS announced $100 million to help states address opioid abuse &amp; expand treatment. This is an epidemic we must end. -H
Dinner. With Hillary. Yes, that Hillary.
Enter for your spot at the table: → http://t.co/KCQseNmFMJ http://t.co/EDJyPb4jjM
Hillary met some (very) small business owners in Iowa today. 🍋 http://t.co/rtmhIR0DiX
Hillary's fought for women and families her whole life—and she's not stopping any time soon. http://t.co/sBQr01Y3SG
Here's a soup-er idea: Join the official #Hillary2016 list. → http://t.co/284j1HxKaM http://t.co/yPvfDOYxuJ
How to say “Go Hillary!” in Spanish. Cómo decir “Go Hillary!” en español. http://t.co/ssifEcHJ1F
We must hold Wall Street accountable. Read more from Hillary's Facebook Q&amp;A: http://t.co/EVdGCtDdSD http://t.co/wy8erncXFv
Equal pay, paid leave, child care—these are not "women's issues."
https://t.co/cq3h5MRsrX
Businesses need to start focusing more on long-term growth than short-term profits. Hillary's ideas: http://t.co/gEH1VxyuLI
Corporations' responsibility isn't just to their shareholders. http://t.co/rfM3aOPYXh
Hillary wants to change how we think about business. http://t.co/NI35wR5K8z
Quarterly capitalism—focusing only on short-term profits—is bad for wages, bad for business, and bad for our economy. http://t.co/mKBTisZAqN
Watch live: Hillary is sharing her plan to take on "quarterly capitalism" and boost long-term economic growth → http://t.co/dvRILRtunV
Preview: How quarterly capitalism is hurting our long-term economic growth—and what Hillary plans to do about it. http://t.co/kBaU5Ve5Tc
"Both my workers and I were better off." Why this CEO thinks profit-sharing = higher incomes + more productivity: http://t.co/sTbOil1XKU
http://t.co/H1hZAZodsF
Hillary stands up for Planned Parenthood—and women's rights. http://t.co/eZ5LRJyasg
Hot Dogs + Grillary Clinton = A Happy #NationalHotDogDay http://t.co/pUZZxoUTiQ
Add your name if you agree: We need full equality for LGBT Americans. Pass the #EqualityAct. http://t.co/ym2VYOlMvV http://t.co/J1xdbbdKLd
The Equality Act will mean full federal equality for LGBT Americans &amp; stronger anti-discrimination protections for everyone. Past time. -H
Last week, Hillary laid out her plan for an economy that works for everyone. Read her speech: http://t.co/2ta3l1zMU8 http://t.co/gTwk38ncS3
During Hillary's Facebook Q&amp;A, we found out who's really playing the #gendercard. http://t.co/IOqeyJulBs
Black lives matter. Read more from Hillary's Facebook Q&amp;A: http://t.co/L6HriA7KTE http://t.co/42KBb8kMID
"I lived through it, and there are photographs. And we're not going back to that." http://t.co/bU9Soxd8kA
One year ago @jrezaian was arrested in Iran. Let’s continue the fight to bring home Jason &amp; others missing &amp; detained in Iran. #FreeJason -H
Dinner. With Hillary. Yes, that Hillary. Enter for your spot at the table: http://t.co/trsS7tD9fN http://t.co/XZML3zo14O
We need to make sure there’s accountability on Wall Street so there can be prosperity on Main Street.
Hillary doesn't want to go back to the Wild West of Wall Street. Add your name if you agree: http://t.co/jgFiqeyJp3 http://t.co/jrwIrBsUZO
We need to protect reforms we've made to rein in excessive risk on Wall Street, like Dodd-Frank—and go further. http://t.co/xJj1egggPy
Congrats, @BeckyHammon—first woman head coach in the NBA Summer League, and the first woman to win it. (Coincidence?) http://t.co/fAxWYYAUyw
If Hillary is playing the so-called #gendercard, what cards are Republicans holding?
https://t.co/QoldL2hBow
If fighting for policies that help families get ahead is playing the #gendercard—well then, proud to play it. http://t.co/xAbEyfNtka
Think women should be paid equally? You might be playing the #gendercard.
If you think you shouldn't have to choose between taking care of your family and getting a paycheck, you might be playing the #gendercard.
Sen. McConnell thinks unlocking the potential of half the population is playing the #gendercard. We think it's an economic no-brainer.
Dodd-Frank was enacted 5 years ago today &amp; has been under GOP attack ever since. As president I'll defend Wall Street reform &amp; go beyond. -H
How much do you know about Hillary's plan to raise incomes for everyday Americans? Text "ECON101" to take the quiz! 📱 http://t.co/HUjgi8Vxhl
If Sen. McConnell thinks fighting for women and families is playing the "gender card"—okay. Here's our #gendercard: http://t.co/mtSCvJWqAD
Gov. Walker signed dangerous abortion restrictions into law in WI - without exceptions for rape or incest. Extreme and unacceptable. -H
#BlackLivesMatter. http://t.co/cXd9W2AXhC http://t.co/qEKKa0ms23
...and that's why you don't try to pick a fight on women's economic security with Hillary Clinton. http://t.co/85tdES0q3x
"I am running for everyone who's ever been knocked down but refused to be knocked out."—Hillary http://t.co/wa5dpO16aU
Today marks the 167th anniversary of the Seneca Falls Convention—a milestone for women's equality. http://t.co/nOHCOkMoTf
The journey toward women's equality began 167 years ago in Seneca Falls, NY. Today, we must write its future. http://t.co/lBQEdxYd91
167 years ago: The Seneca Falls Convention paved the way for women's equality. It's up to us to make it a reality for all. -H
167 years ago, pioneers in Seneca Falls began the fight for women's equality. Add your name: http://t.co/f0d40JLLDR http://t.co/2TyK3Y5OkL
Hillary's economic vision would give small business owners opportunities to build, grow &amp; hire→http://t.co/2ta3l1zMU8 http://t.co/EAUloPklHY
"A good head and a good heart are always a formidable combination." -Nelson Mandela #MandelaDay http://t.co/4TlbW8g4Jg
Officially the coolest way to support Hillary. Get yours: http://t.co/L8W7cfClE1 http://t.co/c6WzWlVWz1
An Iowa tradition: Hillary is speaking to @iowademocrats at their annual Hall of Fame Dinner. Watch live now: http://t.co/sUHCWFsl1L
All smiles. http://t.co/EDi1mVrtgH
My best wishes to those celebrating the end of the holy month of Ramadan. Eid Mubarak. -H
Thanks for the support, Munir! https://t.co/awRjmMakoS
Profit sharing is just common sense. See Hillary's plan: http://t.co/GLifSxXucA http://t.co/D2Bl3upnRN
Yesterday, Hillary outlined a plan to encourage businesses to share profits with employees: http://t.co/GLifSxXucA http://t.co/wfGHwsR9wa
Today in NH, Hillary called on companies to share profits with workers—giving all employees a stake in success. http://t.co/61okIwyYKg
Building the economy of tomorrow means supporting entrepreneurs today. See Hillary's plan here http://t.co/ltHVOwAm3X http://t.co/7rChdVsB6R
#Hillary2016 is just getting started—and thanks to supporters nationwide, it's off to a strong start. Couldn't be prouder. Thank you.
🌈 40,000 stickers celebrating equality
👕 32,961 pieces of #Hillary2016 swag with new owners
🌟 3 Grammy winners http://t.co/HtuGson6vB
Some great numbers: http://t.co/t5jBofWU6V
In 50 states, 11,869 volunteers are building a powerful grassroots organization—plus one quilt. http://t.co/jX7vCarQdj
In the first 94 days of #Hillary2016, more than 250,000 donors—including 113 Hillarys!—gave more than $46 million. http://t.co/4eXJxFNMRA
Tonight, the #Hillary2016 campaign filed its first official fundraising report with the FEC. Here are some of our favorite parts:
No one should have to choose between keeping a paycheck and caring for a loved one. http://t.co/2ta3l1zMU8 http://t.co/esDQEWhu5u
Bottom line: When women get ahead, America gets ahead. http://t.co/71MA2KUy53
Why is Hillary fighting for comprehensive immigration reform? For people like Betsaida and Rafael:
https://t.co/eX07wuOY4z
Hillary in New York yesterday: http://t.co/YeVehwpWlQ
We have new challenges; we need new solutions. http://t.co/ltHVOwAm3X http://t.co/il2qrjjQwM
.@NASANewHorizons traveled 3 billion miles in nine years to forge a new frontier. Let's always keep exploring. #PlutoFlyBy
Read Hillary's ideas for the economy in her own words: http://t.co/2ta3l1zMU8 http://t.co/Ey3jGrNagx
Hillary tells Donald Trump: Enough.
https://t.co/4fWgBTCN7y
"Para el Señor Trump, solo tengo una palabra." http://t.co/7CJnin3aGh
“Arreglar el sistema migratorio es un imperativo económico. También es un imperativo familiar y moral.”
“He dicho que quiero ser la Presidenta que representa las pequeñas empresas, y lo digo con convicción.”
"The defining economic challenge of our time is clear: We must raise wages for hard-working Americans."
Hillary hablará acerca de cómo podemos ayudar a las familias salir adelante. Vean el discurso en #NCLR15 en vivo: http://t.co/cUpomR7y7t
Hillary stands up for workers against GOP attacks: "They don’t need a lecture — they need a raise."
https://t.co/Km2eFdQiSc
Share this → Hillary's vision to raise incomes for hardworking Americans—in one infographic: http://t.co/HLy6Z9QkQE http://t.co/CGdBVqEBBE
Let's build an economy that works for everyone. Join Hillary: http://t.co/nW2JqXGZT9 http://t.co/qDSTlIljsJ
"I’m running for President to build an America for tomorrow, not yesterday—where if you do your part, you will reap the rewards."—Hillary
"Above all, we have to break out of the poisonous partisan gridlock and focus on the long-term needs of our country."
"Let's get back to making decisions that rely on evidence more than ideology."
"I will appoint and empower regulators who understand that Too Big To Fail is still too big a problem."
"I will offer plans to rein in excessive risk on Wall Street and ensure that stock markets work for everyday investors."
"Too often it has seemed that the human beings responsible get off with limited consequences...This is wrong—&amp; on my watch, it will change."
Hillary on misconduct in the financial industry: "There can be no justification or tolerance for this kind of criminal behavior."
"Workers are assets. Investing in them pays off. Higher wages pay off. And training pays off."
"Too many pressures in our economy today are pushing us toward short-termism." http://t.co/AgJQAOjBB9
"The third key driver of income gains alongside strong growth and fair growth must be long-term growth." http://t.co/3wz5pKFic7
"When all Americans have the chance to study hard, work hard, and share in our country’s prosperity—that’s fair growth."
"To create fair growth, we need to create opportunity for more Americans." http://t.co/zt177GbuwG
"If we want to get serious about raising incomes, we have to get serious about supporting union workers."
"I will propose ways to encourage companies to share profits with their employees. That's good for workers, and good for businesses."
"To get all incomes rising again, we need to strike a better balance. If you work hard, you ought to be paid fairly."
"Let him tell that to the fast food workers marching in the streets for better pay.

They don’t need a lecture—they need a raise."
"You may have heard Gov. Bush say last week that Americans just need to work longer hours. He must not have met very many American workers."
"The evidence is in: Inequality is a drag on our entire economy. This is the problem we need to tackle." http://t.co/Q6Bbhwbtb6
"As President, I’ll fight to put families first—just like I have my entire career."
"For far too long, these challenges have been dismissed by some as 'women’s issues.' Well, those days are over."
"It’s way past time to end the outrage of so many women still earning less than men on the job—and women of color making even less."
"It’s time to recognize that quality, affordable child care is not a luxury—it’s a growth strategy."
"When we leave people out, or write them off, we not only shortchange them—we shortchange our country and shortchange our future."
"We can’t afford to leave talent on the sidelines." http://t.co/wD2Bm5iA3e
Another key to strong growth that often goes overlooked &amp; undervalued: Breaking down barriers to joining the workforce—especially for women.
"There’s no excuse not to make greater investments in cleaner, renewable energy right now."
"Bringing millions of hard-working people into the formal economy would increase our GDP by an estimated $700 billion over 10 years."
"I know it’s not always how we think about this, but another engine of strong growth should be comprehensive immigration reform."
"More growth means more jobs and more new businesses." http://t.co/Fl4eGGalIW
"Today I am proposing an agenda to raise incomes for hard-working Americans. An agenda for strong growth, fair growth, &amp; long-term growth."
"I want to see our economy work for the struggling, the striving, and the successful." http://t.co/zfZSkwCzYg
"The measure of our success must be how much incomes rise for hard-working families—not just for successful CEOs and money managers."
"As President, I will work with every possible partner to turn the tide—to make these currents of change start working for us."
"[Changes in our economy] don’t determine our destiny. The choices we make as a nation matter."
"The defining economic challenge of our time is clear: We must raise incomes for hard-working Americans." http://t.co/nt3xYtbMSd
Wages need to rise to keep up with costs. Paychecks need to grow. Families who work hard &amp; do their part deserve to get ahead &amp; stay ahead.
"I believe we have to build a 'growth and fairness' economy. You can’t have one without the other."
We can’t go back to the old policies that failed us before. http://t.co/HtNAREtpsZ
"For 35 years, Republicans have argued that if we give more wealth to those at the top...it will trickle down to everyone else."
"That bargain has eroded. Our job is to make it strong again." http://t.co/T3ARkHJRsz
"If you work hard and do your part, you should be able to get ahead. And when you get ahead, America gets ahead."
"I’ve had the opportunity to listen to Americans’ concerns about an economy that still isn’t delivering for them the way it should."—Hillary
HAPPENING NOW: Hillary has a vision for an economy in which working families get ahead and stay ahead. Watch live: http://t.co/wktEySP99O
Get a preview of Hillary's vision for the economy before her speech at 10:00 ET: http://t.co/K4xix1uzo7 http://t.co/q08HgdrXNZ
Retweet if you agree with Hillary: We need to do more to make sure women and families can get ahead. http://t.co/Ev9iKhoNZV
Hillary has spent her career fighting for families: http://t.co/uPQ4rwm3OM http://t.co/iLkiVXE54m
Thanks for your support, @AFTunion. Your work builds healthy families, thriving communities, &amp; makes our country stronger. -H
A preview of Hillary's economic plan in seven charts: http://t.co/K4xix1MaMH via @wonkblog http://t.co/tJScCKf5Tu
With great pantsuits comes great responsibility: a transformation inspired by Comic Con. #SDCC http://t.co/6VgUdt7LAP
.@serenawilliams proves yet again: anything is possible when you work hard, dream big, and never stop reaching. #Wimbledon
Between July 4th festivities, Hillary said hello to a fellow grandma and her granddaughter in New Hampshire.
https://t.co/pT3YBnFAFe
Hillary has a birthday 🎁 for you—a custom card. Sign up now: http://t.co/dsl9vl09hf
Love it. #SheBelieves  https://t.co/rOlZRuQS3R
Champions. Welcome to NYC @ussoccer_wnt! https://t.co/w8O8cPBCLy
Thanks to @POTUS, America the beautiful will stay beautiful. Introducing the three newest national monuments: http://t.co/Usiiee94sW
The boys are right. We need everyone's help to get the planet moving in the right direction. http://t.co/rNQSBSmgJ8 #action1D
Donald Trump no es el único que tiene ideas retrogradas acerca de la inmigración. https://t.co/1nqc0gn8rh
Nope—it's not just Donald Trump who has backwards ideas about immigration. https://t.co/1nqc0gn8rh
http://t.co/QU5RvdkYy9
Tales from the trail—pin your way from New Hampshire to Nevada and everywhere in between. http://t.co/B7MvKOcop8 http://t.co/mAgh15ltQv
No American should have to live under the shadow of racism. A proud day in South Carolina. -H
Anyone who believes Americans aren't working hard enough hasn't met enough American workers. http://t.co/wyS1p8zcDo
"I will not quit on you. I will fight for you. I will be there for you every single day."—Hillary (via @HillaryforIA) http://t.co/KIdjK7rDKH
Sharing campaign advice with an aspiring future president in Gorham, New Hampshire:
https://t.co/jCQEnTyesr
Kayakers for Hillary. http://t.co/CgLOXQUBJl http://t.co/VpLom6p92f
"A woman should have her own bill."—Hillary https://t.co/XKUHhLEuzX
"Se trata de proveer una oportunidad justa para Puerto Rico." La declaración de Hillary sobre la economía de PR http://t.co/CXSdNe6c01
Hillary never forgets a birthday. Sign up to get a message on yours: http://t.co/tcOGvCycSv http://t.co/aGlIiLezp9
RT if you're on Team #Hillary2016. http://t.co/6KZzN7ORhp http://t.co/53EJOVuuNO
Today in Iowa City, Hillary shares her plan to help families get ahead and stay ahead. Watch live: http://t.co/RGQqnuKs00
Big (and small) support for Hillary in New Hampshire. http://t.co/nD0kbNcFxn
Sun-inspired styles (because life's better with no ceilings): http://t.co/Ukvqf0ofZL http://t.co/Etoil3Iw7M
A beautiful show of support for Hillary in New Hampshire: http://t.co/SGqU82qJTP via @HillaryforNH http://t.co/uwmQ5wX6DD
Hillary and 3-year-old Louisa in Hanover, NH this weekend. http://t.co/tB5JmEYkKO
Still celebrating? Enjoy the ultimate playlist for champions—inspired by Team #USA: http://t.co/CoaFoju6ch http://t.co/9bd2zC7lB9
From the soccer field to the White House—girls can do anything. http://t.co/C6pTZGI0DR
Here's to fearless women chasing their goals. Congratulations, Team #USA! —H
Think @CarliLloyd and the team have this covered. #SheBelieves  https://t.co/kl3GmJwn15
Be a part of THIS team: http://t.co/FYfvEKoCbf http://t.co/DnQ28NmNcZ
GOOOOOOOOOOOOAL! ⚽️  #SheBelieves
To: @ussoccer_wnt
From: Hillary
#SheBelieves
https://t.co/FTmbqKPuOw
Pinning the stories of women who lift us up and lead us forward: http://t.co/zCgarHr5i8 http://t.co/DB1vFr9u6N
Game time: Hit ▶️ on the #Hillary2016 championship playlist. Go Team #USA! http://t.co/ea46LZxxLd http://t.co/RSeCv1XIcl
Towel, cape—make it what you want. http://t.co/xJ51bx886r http://t.co/PZlEhRYSPd
Consulting with an important advisor at the Fourth of July parade in Gorham, NH. http://t.co/lQGm7cjdFE
Happy Fourth of July. Celebrating this country we love—and 239 years of progress, expanded opportunity, and broken barriers. More to do. -H
Happy Fourth of July! http://t.co/imqDsCjsK8
Dream big. https://t.co/nFuvXGLOuK
A great start to the weekend at Dartmouth College in Hanover, New Hampshire. http://t.co/u41umW75P9
Ready for the long weekend? Show us your style by tagging your photos #Hillary2016. (via chanceyloulou on Instagram) http://t.co/RuBosPk2Ub
http://t.co/6KDyWewGpl
Dinner. With Hillary. Yes, that Hillary. Enter for your spot at the table. → http://t.co/00eQU4vo3v http://t.co/g3tcgym0lt
Now pinning savvy supporters' DIY creations: http://t.co/DeIHEOBZ3d http://t.co/V7aZKRsyqg
Song of the week, brought to you by 93-year-old Jerry R. in California. http://t.co/1KJcSaOvvb #Hillary2016
What this campaign is about: Building a future where every American has the opportunity to get ahead and stay ahead. http://t.co/e7myYGuS12
51 years later, the Civil Rights Act remains one of our country's greatest triumphs—and an enduring call to keep fighting for equality. -H
From Park Ridge to Roosevelt Island and beyond, follow all of Hillary's Memorable Moments on @Pinterest: http://t.co/cLwTvurEZ6
Here's your must-read of the day: http://t.co/mMJICVBwwx http://t.co/U08ggRJYBh
Grandmother knows best. Pins from Hillary's favorite new job: http://t.co/AMSQ9OeA6U http://t.co/eKum9HThfq
Grandmothers' Club unite! Thank you! https://t.co/hmCf6cCQcI
(3/3) Just one thing left to say to everyone who has pitched in to support this campaign: Thank you. -H http://t.co/TQTBWUZ3MW
(2/3) Here's a number we're especially proud of. -H https://t.co/5OF040W57R
(1/3) Still running the numbers—but here's what we know: In the first quarter of this campaign, supporters gave more than $45 million. -H
New US Embassy in Havana helps us engage Cuban people &amp; build on efforts to support positive change. Good step for US &amp; Cuban people. -H
If you've been thinking about donating, now's the time Hillary needs you most! Chip in before midnight local time: http://t.co/l0IiiUIpAC
Last chance! We’re closing the books on this quarter at midnight. Get us over the finish line by chipping in $5: http://t.co/l0IiiUIpAC
To win this, we need to start strong—that's why early donations are so critical. Chip in: http://t.co/cpofiE29TV
The hippest way to spend ten bucks: being one of the first to support #Hillary2016. http://t.co/xvr0lRmmND http://t.co/QZ1y5EfphX
Puerto Rico's debt crisis is not theirs alone. For PR's economy to grow &amp; their people to thrive, they need real tools &amp; real support. -H
The ability to organize &amp; bargain collectively is a fundamental American right. Proud to stand with unions &amp; working families. #SCOTUS -H
Reauthorizing @EximBankUS means supporting America's small businesses. Time for Congress to put politics aside &amp; act. http://t.co/WhXf1smlGU
The positive: This magnet is yours for $10. The negative: Just a few hours left to get one. → http://t.co/ASwZt9AAis http://t.co/8LEoUun70I
Just pinned to our "Women Who Inspire" board: the newest principal ballerina at @ABTBallet. Congrats, @mistyonpointe! http://t.co/7CHabDGyvk
Inscríbete para ganar una cena con Hillary. → http://t.co/GCNjjOPrOG http://t.co/0CIAMFP081
President Obama is right to update overtime rules for the modern workforce—a win for our economy and workers nationwide. -H
Introducing: Pinspiration from Hillary! Follow for granddaughter gift ideas and more: http://t.co/XjY4hmNKcP http://t.co/urM7SP8gpY
Cheers! Grab yours: http://t.co/V4gNWX8wo6 https://t.co/ZuEOp27Ept
Midnight deadline! Put your name on the list of supporters who were with HRC from the start: http://t.co/8W3E2ecCsY http://t.co/x5UHYoBU1E
We have 27 hours to hit our first fundraising goal: 50,000 donors before midnight tomorrow. Can you chip in $5? http://t.co/bPI6uMAik7
Step 1: Pitch in $10 before the first fundraising deadline
Step 2: Get a #Hillary2016 magnet! http://t.co/slunFkDQA5 http://t.co/c5E0joe3MO
Hillary needs you. Help the campaign end its first quarter strong by meeting our goal before the deadline: http://t.co/VUQdxh0NRP
Just one of the millions of reasons why Hillary's fighting for affordable health care: Meghan R. from New Hampshire.
https://t.co/gNrShOlk2z
Fun in the sun—#Hillary2016 style. Shop the all-new summer collection: http://t.co/2yp6AyX9zG http://t.co/7lWMyVgNck
Team #Hillary2016 out in full force at #NYCpride2015—plus a few familiar faces. @ChelseaClinton @jasoncollins98 http://t.co/HfTvFwgFsk
Celebrate history with a free sticker! Just tell us where to send it: http://t.co/ZjEMZEW74y #lovewins http://t.co/t2WYHzedwg
Chip in now, and you can always say you were one of the very first donors of the #Hillary2016 campaign: http://t.co/QutSL0wtJc
Paws up. Get the look: http://t.co/RNgCdXQgKH @ladygaga http://t.co/QldW53nIN7
Hillary lamenta la declaración de un candidato a la presidencia del Partido Republicano sobre los inmigrantes. http://t.co/40Tm1pmWiY
RT if you agree with Hillary: It's time to stop the partisan attacks on health care. http://t.co/WPntVwBGyN http://t.co/OVxyljLlxs
Have a great weekend. (And don't forget to grab your commemorative buttons: http://t.co/rK2EzbeuHv) #lovewins http://t.co/koBcExuN5K
Seven years ago today: unity in Unity, NH. http://t.co/HsBuw8jwZU
Hillary needs you. Help the campaign end its first quarter strong by meeting our goal before the deadline: http://t.co/VXgn1XHr3h
You'll want to read this: Hillary's remarks at the Jefferson Jackson Dinner → http://t.co/lllS5yoNKg http://t.co/ULz8Q17RWf
"Our country at its best." Read Hillary's statement on yesterday's historic win for marriage equality, on @Medium: http://t.co/F12o9NfUtK
Best Pride month ever. Celebrate with the Hillary Pride collection: http://t.co/PMt81ZKcbk #lovewins http://t.co/2lyVeNY436
A proud day. http://t.co/Iedos1hYTk
Don't miss this: Hillary speaks at the @vademocrats Jefferson-Jackson Dinner. Watch live: http://t.co/O7xmM8qUpg
To: Everyone celebrating

From: Hillary for America staff
https://t.co/oMSywbAs7a
H is for history in the making. Get your free celebratory bumper sticker here → http://t.co/3MV8txaDbR http://t.co/WcdHM73eUv
Planning a wedding? We've got the perfect party favors: http://t.co/FCF9NShdYQ http://t.co/d0nvlQiyjz
