{
  "status": "OK",
  "warningMessage": "truncated-oversized-text-content",
  "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
  "url": "",
  "totalTransactions": "2",
  "language": "english",
  "text": "Today and every day, we #StandWithPP. https://t.co/oifqTQLx1XHow did Hillary and @billclinton feel about dropping @ChelseaClinton off at college? “We were both wrecks.”\nhttps://t.co/QiM7Ee0xPN\nOur diversity should be celebrated—not denigrated. https://t.co/PttGbVx4SJ\n\"She has a light and energy about her that makes you want to be your best.\" @OITNB’s @UzoAduba and Dascha Polanco\nhttps://t.co/0lJJOAxDZ4\nSo much to be thankful for. Wishing a happy Thanksgiving to you and yours. -H https://t.co/BxnKu5CKwt\nWe're thankful for our official campaign supporters. Add your name to become one! https://t.co/KCrp9P4yET\nSenior policy advisor @mayaharris_ talks #BlackLivesMatter and being a working mom with @ELLEmagazine: https://t.co/tELMwoy3dV\nFrom Hillary’s record to whether she wears a wig(?!), @creynoldsnc has your back for awkward family political talk. https://t.co/LplkWSDoeL\nSign up and we’ll send you a guide to winning your Thanksgiving table debate: https://t.co/IPQg6CYgzM\nStatement of Hillary Clinton on the shooting of Laquan McDonald: https://t.co/xcvQMUrbFP\nEn un chat Telemundo por la web, Hillary habló de Donald Trump, la educación, y los tacos. https://t.co/bUUI9v753X\nThere’s no place for second-class status in the United States of America. https://t.co/L53sSZGq4o\nHillary answers: What’s it like to watch football with your family? \u0001F3C8\nhttps://t.co/j1DrUnQ7qG\nFrom immigration to education, Trump to tacos: Hillary’s Q&A with @TelemundoNews → https://t.co/9ggDWwJML7\nPoliticians have no right to interfere with women's access to health care—not in Texas, not anywhere. https://t.co/GvKoAxGqFB\nToday, @POTUS awards Shirley Chisholm, the first African American congresswoman, with the #MedalOfFreedom. https://t.co/4bu5n0yo7E\nLatinas no deberían ganar 56 centavos por cada dólar que gana un hombre anglosajón. https://t.co/zfJ5oXb8bk\nAmericans who have served their sentences deserve to have their rights restored. Thank you, Gov. Beshear. https://t.co/GhANLwE3KE\n¡Hillary is doing a Q&A on the @TelemundoNews Facebook page en vivo! Join the conversation: https://t.co/ZWQKNlI2kT\nProviding care for an elderly or sick loved one should not mean sacrificing your own secure retirement.\nFamilies caring for sick or elderly family members shouldn't have to struggle to pay the bills. https://t.co/XtzuegTmNa\nProud to #StandWithPP in the fight for affordable health care. Don’t mess with Texas women's health. https://t.co/PnxV6yI5Xv\nTake an in-depth look at Hillary's plan to defeat ISIS with the campaign's foreign policy expert, @rosenbergerlm: https://t.co/0CN59dcBq8\nThis feminist dad is making sure nothing stands in the way of his daughters’ success. Read his letter to them: https://t.co/yOzWVnQVgW\nCaregiving for elderly and disabled family members in the US in 2013 was estimated to be worth $470 billion. Caregivers deserve our support.\nEvery survivor of sexual assault deserves to be heard, believed, and supported. https://t.co/mkD69RHeBL\nImportant words from someone who found refuge in America: https://t.co/yGdMuUXxhM https://t.co/Pjycs3Y1ag\nWith a GOP majority in Congress, how will Hillary pass laws? See her response to this Q from an astute young lady.\nhttps://t.co/wYQ9Dd98OR\nHow will Hillary’s college plan help you? Find out with this flowchart: https://t.co/7oBYrlK8VS https://t.co/1GnJLqlzei\nWe need to protect our communities from the scourge of gun violence. Thank you, @Bradybuzz. https://t.co/FylLgwFw2D\nIt's snowing in Iowa right now—and organizers and volunteers are still knocking on doors for Hillary. https://t.co/0uapkGzgst\n\"Who would you pick to play you in a movie?\" –@kellyripa\n\n\"Well, Meryl Streep of course!\" –Hillary\nhttps://t.co/M4Yn0O7WpB\nOur values are stronger than fear. Slamming the door on refugees isn’t who we are.\nhttps://t.co/ISEisdQbWf\nLouisiana: Today is Election Day! Text VOTE to 47246 to find your polling place—then go make your voice heard!\nWe’re better than that. https://t.co/ZI9bt8h2a2\nHave you ever met a president? RSVP today for a chance to meet President @billclinton! https://t.co/F9Vz02oCfE https://t.co/YHV3n1P4rD\nDAPA would keep millions of law-abiding families together—and its fate is in the hands of the next president. https://t.co/jzUo3kpRTb\nWe need to say with one voice that transgender people are valued, loved, and deserve to be treated that way. #TDOR https://t.co/RGU9XjMwra\nI will fight for DAPA so millions of children won't fear coming home to empty houses. Strengthening families means keeping them together. -H\nToday, @CoryBooker joins @HillaryforSC for a Twitter chat about what's at stake in this election. Join in→ #CoryinSC https://t.co/JsfYfCHX42\nThis is shocking rhetoric. It should be denounced by all seeking to lead this country. -H \nhttps://t.co/qs2TJI5spu\nNo one working full-time in America should have to raise their kids in poverty.\n.@KellyandMichael asked Hillary: What do you think would be some of the advantages of having a woman president?\nhttps://t.co/xyukcpeyhj\nHillary Clinton called out Republicans for slamming the door on Syrian refugees: “We’re better than that.” https://t.co/qIFY9wQu0o\nWhen workers organize for their rights, it helps fix our unbalanced economy and makes families stronger. #worktogether\nDid you miss Hillary’s big speech on combating terrorism? Here are 3 things you should know: https://t.co/NQ73BRsQeu\nTurning away orphans, discriminating against Muslims, slamming the door on Syrian refugees—that is not who we are.\nhttps://t.co/VAkf6HENpG\nHillary on confronting an ideology of hate: https://t.co/Hl6iKdsdQY\n\"This is not a time for scoring political points... This is a time for American leadership.\" —Hillary on defeating ISIS & the refugee crisis\n\"It would be a cruel irony indeed if ISIS can force families from their homes & then also prevent them from ever finding new ones.\" —Hillary\n\"Remember: many of these Syrian refugees are fleeing the same terrorists who threaten us.\" —Hillary\n\"Turning away orphans, applying a religious test, discriminating against Muslims...that’s just not who we are. We’re better than that.\"\n\"We cannot allow terrorists to intimidate us into abandoning our values and our humanitarian obligations.\" —Hillary\n\"We are in a contest of ideas against an ideology of hate—and we have to win.\" —Hillary https://t.co/URx9h8eN87\n\"Repeating the specific words 'radical Islamic terrorism' is just a distraction...Our priority should be how to fight the enemy.\" —Hillary\n\"Let’s be clear: Islam is not our adversary. Muslims are peaceful and tolerant people and have nothing whatsoever to do with terrorism.\"\n\"This is a worldwide fight—and America must lead it.\" —Hillary on defeating radical jihadism\n\"Our goal is not to deter or contain ISIS, but to defeat and destroy ISIS.\" —Hillary\nWe \"can’t sacrifice our values or turn our backs on those in need. We must choose resolve—and we must lead the world to meet this threat.\"\n\"After a major terrorist attack, every society faces a choice between fear and resolve.\" —Hillary\nHappening now: Hillary lays out her plan to combat terrorism and defeat ISIS. Watch → https://t.co/nsPEP8Nsjq\nThe deck is stacked for the wealthiest Americans—and it’s time to reshuffle.\nhttps://t.co/tRzvymEhtl\nThe defining economic challenge of our time is raising incomes for hardworking families so they can afford everyday life.\nThe loss of lives to terrorism is tragic and abhorrent, in Nigeria as in Europe. We must all come together to end this scourge. -H\nAfter the events in Paris and with thousands of gun deaths in the US each year, hard to fathom this from the GOP. https://t.co/CQp8sCKx7G -H\n.@billclinton popped the question three times before Hillary said yes. How she remembers the proposal that worked: https://t.co/gvn9tS985h\nBorn on this day in 1945, Wilma Mankiller was the first woman elected chief of the @CherokeeNation. https://t.co/vC9XOeM6y5\nProud to have @SEIU on this team. https://t.co/i6skAsTxnG https://t.co/pjNOmt96VY\nHillary is proud to be a champion for workers, and honored to stand with @SEIU.\nhttps://t.co/BWNQbpTUmP\nThe Affordable Care Act helps millions of Americans. We should build on that progress—not go back to square one. https://t.co/WRlMFRDXXy\nIf you like puppies, dancing, and calling out Republicans, you'll love the hillaryclinton Snapchat. https://t.co/3mKmqJvIpb\n51% of the kids in our public schools are eligible for free or reduced cost lunches. We need to raise wages to lift families out of poverty.\nThe @SEIU, representing 2 million workers, has voted to endorse Hillary! https://t.co/Obakxpm0pj\nWe've seen a lot of hateful rhetoric from the GOP. But the idea that we'd turn away refugees because of religion is a new low. -H\nThank you, @SEIU.\n\nhttps://t.co/3Pz951cx9T\nHillary and her supporters take a lot of selfies—and she’s learned a few things along the way.\nhttps://t.co/Eow4QerNXA\nCome for the coffee. Stay for the conversation—about one of this campaign's most important issues. ☕️  https://t.co/zGfTENgQsq\n“It shows her at her wonkish best.\" https://t.co/2mXmIL6ud6 https://t.co/eIA5yjPmWt\nWe asked Senator @clairecmc what a Republican president would mean for women. https://t.co/GgyrAUavZp https://t.co/EZsDjxLVtv\nNo American should work full-time and struggle to get by. Raising the minimum wage will help lift millions out of poverty.\nThank you, @JimObergefell. Our work isn’t over yet. https://t.co/Uk3OZcLIyl\nHow will Hillary’s college compact help you? Find out with this flowchart. https://t.co/Zoq3FGaRJm\nQuality time in Ames, Iowa. https://t.co/W45JRKOS5Q\nAmericans deserve a raise. https://t.co/uJAadCjehT\nYour hard work should be reflected in a rising paycheck. https://t.co/P1Flqso3Fi\nThe president’s job is to do everything she can do to lift up the people of this country.\nhttps://t.co/UgcxhclOCP\nAn artist live-sketched the second #DemDebate. Here’s what caught her attention: https://t.co/O8h9zGsHje https://t.co/QYp1fzmGBM\n7 of Hillary's best moments at the #DemDebate, including one line every little girl should hear. https://t.co/azhqXJcKda\n\"Our prayers are with the people of France tonight, but that is not enough.\" —Hillary https://t.co/vFQltalvzF https://t.co/q1Zb7XSKg9\n\"I’m very proud that...a majority of my donors are women.\" —Hillary at the #DemDebate\nhttps://t.co/iUozjULVvQ\nHillary summed up one of the most important issues of this election at the #DemDebate. https://t.co/wtwMLo6HtL\nGirl Scouts stick together.  https://t.co/PEulNsoNz6\nAre you ready for the first woman president? #DemDebate #Hillary2016\nEl trabajo de un presidente o una presidenta es hacer todo lo posible para que todos puedan salir adelante. —Hillary #DemDebate\nWant Hillary's first thoughts after the #DemDebate? Text ImWithHer now to 47246 to get a message from her!\nStand with Hillary and sign up to get a free #ImWithHer sticker in the mail: https://t.co/BOSoratpZ9 https://t.co/vjH1ATC96g\n\"I think the president's job is to do everything possible—everything she can do—to lift up the people of this country.\" —Hillary #DemDebate\nFor too long, issues affecting women and families—from childcare to paid leave—have been dismissed as \"women's issues.\" Those days are over.\nLa reforma de salud es demasiado importante para ser revocada. #DemDebate\n\"The Affordable Care Act—I don't think we should have to be defending it among Democrats.\" —Hillary #DemDebate\nWe must make community colleges tuition-free across America. #DemDebate\nWhat Hillary believes: No American should have to take out a loan to pay tuition at a public college. #DemDebate\nIt's 2015. Every woman deserves equal pay. Full stop. #DemDebate https://t.co/l0kBI6hPtp\n\"President Obama deserves more credit than he gets for what he got done.\" —Hillary #DemDebate\nWe cannot accept 33,000 gun deaths per year as “normal.” Most Americans—including law-abiding gun owners—believe we can and must do better.\nHay que hacer todo lo posible para detener la violencia con armas de fuego sin importar lo que diga el NRA. #DemDebate\nThere have been approximately 2,800 gun deaths since the last #DemDebate one month ago. We can't wait any longer to act on gun violence.\nWe cannot give up on preventing gun violence. We—and our next president—have to stand up to the NRA. #DemDebate https://t.co/tTeliBglji\nGun dealers and manufacturers should be held accountable when they endanger communities. #DemDebate https://t.co/KiCM0mhxBa\n\"My plan is tougher and more effective because I go after all of Wall Street—not just the big banks.\" —Hillary #DemDebate\nWe need to rein in risk on Wall Street, and make sure middle class American families never have to bail it out again. #DemDebate\nComo presidenta, Hillary protegerá, renovará, y expandirá DACA y DAPA, las órdenes ejecutivas. No cree en separar a las familias. #DemDebate\nHillary will fight to protect DACA/DAPA, pass comprehensive immigration reform, and keep families together. #DemDebate\nHillary will defend President Obama’s executive actions on immigration—and if Congress refuses to act, do everything possible to go further.\nThere is no place in America for second-class citizenship. Hard-working immigrant families deserve a path to full and equal citizenship.\nHillary on the terror attacks in Paris at the #DemDebate:\nhttps://t.co/ov0lBwpS4W\nWe should build on the progress we've made on health care—not go back to square one. #DemDebate https://t.co/24rXGZDReo\nWe should make the tax system fairer: close loopholes for Wall Street money managers and millionaires and give the middle class a tax break.\nA higher minimum wage will help close the pay gap, help lift millions of women out of poverty, and have a ripple effect across our economy.\nNuestro desafío como país no solo es ayudar a aquellos que trabajan duro, pero también asegurar que todos puedan salir adelante. #DemDebate\n--> https://t.co/L7Dd6ULJqp #DemDebate\n\"Hardworking middle class families need a raise—not a tax increase.\" —Hillary #DemDebate\nIf you're not watching the #DemDebate, we can email you the highlights! Sign up here: https://t.co/RyqZrtnMqp https://t.co/ZdfCr2vDnY\n\"We're not at war with Islam…we’re at war with violent extremism.\" —Hillary #DemDebate\nAmerica must continue to lead in a dangerous world—and we do so by exercising smart leadership grounded firmly in our values. #DemDebate\nEsta elección no solo se trata de elegir a un presidente—también se trata de elegir a un comandante en jefe. —Hillary #DemDebate\n\"We have to look at ISIS as the leading threat of an international network. It cannot be contained—it must be defeated.\" —Hillary #DemDebate\n\"All of the other issues we want to deal with depend on our country being secure and strong.\" —Hillary #DemDebate\n\"This election is not only about choosing a president—it's also about choosing our next Commander-in-chief.\" —Hillary #DemDebate\n\"Our prayers are with the people of France tonight but that is not enough.\" —Hillary #DemDebate\nSend Hillary a message of support as she heads into the #DemDebate: https://t.co/oLhmoTCmhi https://t.co/sQ6mh4sgpY\n\"Even after this darkest night, Paris remains the City of Light.\" https://t.co/RvnZ4oHbsX\nThe reports from Paris are harrowing. Praying for the city and families of the victims. -H\nFollow #Hillary2016 campaign staff to stay in the know during tomorrow’s #DemDebate: https://t.co/Ab57ZumWw9\nA five-star review from a four-star general. Thank you, @GeneralClark. https://t.co/emocYkno9P\n\nA five-star review from a four-star general. Thank you, @GeneralClark. https://t.co/emocYkno9PProud of my friend Aung San Suu Kyi and the people of Burma for never giving up in the long struggle to bring change to their country. -H\nThe story of 2 women with moms named Dorothy, sharing beers of the same name, toasting to the first woman president. https://t.co/ZM2anns4Cg\nThat time Donald Trump gushed about one of the most shameful periods in our country’s history: https://t.co/ezEqiVJJMs\n#TBT to when Hillary declared she’s not *just* a progressive at last month’s Democratic Debate. https://t.co/I1waajSkUk\nWe've come too far to see our progress ripped away.https://t.co/obBV1uXu0V\nCreate your own #Hillary2016–inspired cross-stitch. Here’s the pattern to DIY: https://t.co/EIdmMpIj2X https://t.co/y452tnL0L0\nThe U.S. economy would have produced an additional $447.6 billion in 2013 if women received equal pay. https://t.co/tsR4IVlY9E\nWe need to keep guns out of the hands of domestic abusers and convicted stalkers. https://t.co/mGPKEgwaho https://t.co/ENvnWqIKoL\nIn 1991 Hillary Clinton filed her husband's papers to run for president. In 2015 she filed her own. https://t.co/hbmPBXBgkv\n.@Bustle: \"6 Feminist Points In Hillary Clinton's Veterans Plan That Are Awesomely Inclusive\" → https://t.co/SHEKnnJLcA\nBeing a good parent has nothing to do with sexual orientation—thousands of families prove that. https://t.co/xQLh25RAYR\nMentions of Hillary at #GOPdebate: Over 40.\nMentions of equal pay, paid leave, LGBT rights, or racial justice: 0. https://t.co/MOrjgg69iR\nOur veterans have done so much for us; now we need to do more for them. Read Hillary’s op-ed in the @MilitaryTimes: https://t.co/a5i6IYOlGh\n“To all our veterans, and the men and women now serving: You represent the very best that our country has to offer.”\nhttps://t.co/qIqdJGHwKX\nWhat those who served and sacrificed want you to know this Veterans Day: https://t.co/TWlmE1BQnj\nThe idea of tracking down and deporting 11 million people is absurd, inhumane, and un-American. No, Trump. -H https://t.co/uZyqAWXUdh\nAnd if anything's clear from last night's #GOPdebate: \"They don't have a plan—they just hate mine.\" @Lin_Manuel  https://t.co/VMicarTaO3\nOn Veterans Day, to all who have served—you deserve our gratitude, respect, and the best care and benefits in the world. -H\nThe \"winners\" from last night's #GOPDebate: https://t.co/dH8dKopxbZ https://t.co/vMs8b3O5vG\nIf you're proud to be a Democrat after watching tonight's #GOPdebate, add your name here: https://t.co/gcsfX41UyE\n#GOPdebate https://t.co/vqbB3Tpf5r\nTimes Republicans offered helpful ideas for the middle class: 0. \nTimes Republicans attacked Hillary: We lost count. \n#GOPdebate\nNewsflash: You don’t have to be a scientist to know that climate change is real, and act to combat it. #GOPdebate\nYep—Hillary’s resume is full of accomplishments. #GOPdebate https://t.co/QSyZ6fTRWm\nIt’s not the big banks that need relief from Washington—it’s small banks and small businesses. #GOPdebate\nNingún candidato en el escenario apoya una reforma migratoría con un camino a la ciudadanía. Ninguno. #GOPdebate\nApoyar a las familias incluye la baja de maternidad pagada, aumentar el salario mínimo, y acceso a guarderías infantiles. #GOPdebate\nThe @CFPB protects borrowers from unfair and deceptive Wall Street practices. Attacks against it are unfounded and outrageous.\nWhat’s really pro-family: Supporting equal pay, paid leave, affordable child care, and Planned Parenthood. #GOPdebate\nThese candidates don't seem to mind a \"big government\" when it's politicians interfering in women's personal health decisions. #GOPdebate\n#GOPdebate translation: Doubling down on trickle-down economics. \n\nAmerica needs an economy that works for everyone.\nFor 35 years, Republicans have argued that more wealth at the top will trickle down—and twice, a Democrat has had to clean up the mess.\nRepublicans who want to repeal the ACA should try telling that to the 18 million people who have health coverage because of it. #GOPdebate\nNote to candidates who boast that they'd repeal Obamacare: Health care should be a right—not just a privilege for those who can afford it.\nMás posturas absurdas del Partido ReTrumplicano—no vamos a deportar a 11 milliones de personas. No vamos a separar a familias. #GOPdebate\nThe idea that the US will deport 11 million people is absurd. We should not be in the business of tearing families apart. #GOPdebate\nComprehensive immigration reform that brings millions of hardworking people out of the shadows and into the economy: A policy no-brainer.\nIt's hard to declare a \"winner\" in the #GOPDebate when every candidate is trying to move our country backward. https://t.co/lCAYkhm8CZ\nThere is something wrong when top CEOs make 300x more than the typical worker. #GOPdebate\nHow do we get more in the workforce? Paid leave, equal pay, child care—won't hear that from Republicans. https://t.co/xUQEFdxnWO #GOPdebate\nPresident Obama doesn't get the credit he deserves for strengthening our economy. We need to build on that progress, not go backwards.\n.@JohnKasich is right on one thing: The budget was balanced under President Bill Clinton. #GOPdebate\nMillionaires don't need tax breaks. Middle class Americans do. #GOPDebate\nAn idea you won't hear at the #GOPdebate: If you work hard, you should be able to succeed—no matter who you are or where you come from.\nTwo fewer candidates, but the same number of new ideas as the last #GOPdebate: zero.\nRepublicans have it wrong on many issues facing Americans this election. Tell us: What are you fighting for? https://t.co/Bak9Dwvxb4\nEvery woman deserves to make her own decisions about birth control—without interference from politicians or her boss. #ThxBirthControl\nHillary’s dad prepared thousands of sailors during WWII—after he died, Hillary received letters from men he trained.\nhttps://t.co/zZUfzdNNxX\nCelebrating 240 years of @USMC service and sacrifice, from Tun Tavern to Helmand. Happy birthday, Marines!\nHillary’s veterans plan will “ensure access to timely, high quality health care and modernize veterans’ benefits.” https://t.co/3GLLKmyU86\nVets deserve better. My plan will address issues like this by upgrading VA technology & requiring accountability. https://t.co/m3Zok741f1 -H\nLa Corte del 5to Circuito se equivocó. La Corte Suprema tiene que validar a DACA/DAPA para que millones de familias puedan vivir sin miedo.\nThe 5th Circuit is wrong on immigration. SCOTUS should uphold DACA/DAPA so millions of families can stop living in fear. -H\nHappy Diwali! Wishing a bright year ahead to all celebrating the Festival of Lights.\n“The future that scientists have warned us about has arrived.” —Hillary to @LCVoters\nhttps://t.co/kuBWhdPNoF\nFast-food, home care, child care workers: Your advocacy is changing our country for the better. #Fightfor15 -H\n2015 is on track to be the hottest year on record. Climate change is not only real, it's already present.\nThis ice cream shop named a sundae after Hillary Clinton. But that’s only part of the story. https://t.co/Hp2Qa3AXQA\n\"Why are you running for president?\"\n\n\"Because I want to help little kids.\"\nhttps://t.co/r3ZKOxoPnZ\n“When things get tough, Hillary does not back down.” —@repjohnlewis https://t.co/6jqrRIvBC4\n“When it comes to fighting the climate crisis, the stakes couldn’t be higher.” —@LCVoters https://t.co/ngjjNRPMkX https://t.co/2zONDStLVv\nYet another Republican refuses to make it easier to vote. What part of democracy are they so afraid of? -H https://t.co/P4Y4VHr6nS\nWomen shouldn’t make less than men in 2015. Period. https://t.co/NUbM0Fa2eV\nWhat would it mean to have a former secretary of state in the White House? This. https://t.co/G1zjo2uRQd\nToday marks one year from the presidential election. Here’s what’s at stake, in one terrifying flow chart: https://t.co/xsbuCQRoYT\nTune in to @newsone Monday morning at 7 ET for more from Hillary’s South Carolina town hall with @rolandsmartin: https://t.co/QMZg1jq6fN\nWe quantified Hillary’s career—take a look at the numbers. https://t.co/pgyGWnDn08\n“This has to end.” Hillary on gun violence at the First in the South Democratic Candidates Forum.\nhttps://t.co/OrbVa5rXio\nTen women senators say why they’re supporting one of their own: https://t.co/RhDqFmFGIo https://t.co/X0zdOBHBcl\nA young man asked Hillary: What did you learn from @GirlScouts that you would use to be a successful president?\nhttps://t.co/4fJOJveiMh\n“I helped launch African Americans for Hillary. This is my story.” -@KarenCivil https://t.co/vy2mwYEGt2\n“It’s hard for me to understand why the suspension and expulsion rate is so much higher for black kids.” —Hillary\nhttps://t.co/RldOVxhayk\nWatch live: Hillary joins @RolandMartin for the @NewsOne Town Hall in South Carolina #NewsOneNow → https://t.co/lADpr4Ccts\nFollow @HillaryforSC for updates on Hillary’s trip to the Palmetto State and today’s @newsone town hall: https://t.co/lADpr4kBBU #HRCinSC\nHillary Clinton sat down with the mothers of Eric Garner and Dontre Hamilton—here’s what they talked about: https://t.co/z3zPRwwoAN\nSi tuviera que aprender un idioma, Hillary dijo que sería el idioma de Gabriel García Márquez. #DemForum\n\"If you stand for equal rights, if you stand against discrimination, you don't just do it once—you've got to keep fighting.\" —Hillary\nOn foreign policy, the use of force \"should always be the last resort—not the first choice.\" —Hillary\nWe can't wait any longer to act on gun violence prevention. #DemForum\n\"It is hard to understand why the suspension and expulsion rate is so much higher for black kids than for white kids.\" —Hillary\n\"Anybody who thinks that they can influence what I will do doesn't know me very well.\" —Hillary\n\"Pres. Obama doesn't get the credit he deserves for the job he's done...I want to build on that progress—but I want to go further.\" —Hillary\n\"I have been committed to and working on issues that I think are important...in particular to people who are marginalized.\" —Hillary\nWatch now: Hillary joins @maddow at the #FirstintheSouth Democratic Candidates Forum in Rock Hill, SC → https://t.co/68f9wJQYiy\nOur favorites from the Internet this week. https://t.co/kn0TXo2T20\n#FF @HillaryforSC for tonight’s Democratic candidate forum with @maddow. Great weekend ahead in the Palmetto State! \u0001F334#HRCinSC\nHillary on criminal justice reform and more in @EBONYMag: https://t.co/QBAD1iIrqf https://t.co/nvzE5dmYSY\nThe right call. Now it's time to make America a clean energy superpower. -H https://t.co/d6kSvldOLI\n.@MikeyLikesItNY helps people with criminal records find jobs, one scoop at a time. https://t.co/gHAs0Etddn\nHillary is ready to be president. Want to help make it happen? Apply to be a Hillary for America intern: https://t.co/iSbArYiedG\nWhat do you call the male spouse of a female president? Hillary and @JimmyKimmel have some ideas.\nhttps://t.co/QU0THUPn90\nHillary’s spent 40 years in public service, and the numbers speak for themselves. https://t.co/tsj4DYQ4It\nToday on @Snapchat: 10 little girls who are ready for the first woman president. Follow us! \u0001F47B hillaryclinton https://t.co/TJmcOnY89w\nBackstage at @JimmyKimmelLive—tune in tonight! https://t.co/39BrorRCE2\n#TBT to the time Hillary had a @DollyParton-themed birthday party in 1995. \u0001F3A4 https://t.co/f4NZVUJGc3\nWorking hand in hand with tribal nations, the US government can help ensure the strength of Native communities. https://t.co/GjxVAqV0Kb\n50 years ago, @repjohnlewis marched—and bled—for the right to vote. His message today: “We must use the vote.”\nhttps://t.co/NoNHImLS51\nMalala is brave, inspiring—and really onto something here. https://t.co/c3dWxopG7B (via @EmWatson) https://t.co/Zqxxn9sAhx\nOur criminal justice system is broken. Here are 3 things we can do to start fixing it: https://t.co/H2WHRkOrFy https://t.co/NdgnofiDu0\nMeet Olivia, the 12-year-old feminist who wrote Hillary this letter: https://t.co/1PLC2hrymq https://t.co/STEECewzkM\nWe can't sit by while more people die. It's time to stand up to the NRA once and for all. https://t.co/jse2vAytjl\nA 10% price reduction is insulting. As I've said before, the FDA and FTC need to step in to protect consumers. https://t.co/guopHDGOBz -H\nGuilty as charged. \u0001F355 https://t.co/qnKHHsAUE2\nWe should not put 650,000+ promising young people at risk for deportation. Sen. Rubio is wrong on this. -H \nhttps://t.co/763Ok5xBtS\nHillary’s answer shows *exactly* what it would mean to have a former secretary of state in the Oval Office. https://t.co/tWkN1ablD9\nIn 1976, @BarbaraJWalters became the first woman co-anchor on a major network. https://t.co/w6F7J3FZYs\nRacial profiling is demeaning, wrong, and unconstitutional. It's time to put that practice behind us.\nEveryone deserves full and equal protection under the law. This is a reminder of the work still left to do.  https://t.co/r68QAHxxPT\nCongrats @simone_biles, the most decorated woman gymnast of all time! Can’t wait to watch your next winning routine. https://t.co/XotGpSOq6P\nFederal law doesn't prohibit convicted stalkers from purchasing or possessing guns. https://t.co/2tONgsL1Ti https://t.co/0vfxhMfaLe\nOur criminal justice system is in crisis—but we can start changing that now. https://t.co/gdBkpPjBEZ https://t.co/L54c868qHl\n\n.@GregAbbott_TX is right about one thing: equality is one of Hillary's values. Houston—vote #YesOnProp1 today. https://t.co/AI0IWnqhB7When unions are strong, America is strong. Thank you, @AFSCME. https://t.co/wWVOq9WEZe\nVoting is one of our most important and sacred rights. If there's an election near you today, make your voice heard—go vote! -H\nA 12-year-old feminist named Olivia wrote Hillary this brave, heartwarming letter. Olivia 2040, anybody? https://t.co/5ZEKdOpTrQ\nWatch our new ad—why Hillary is working to prevent gun violence:\nhttps://t.co/S7RuSmwzfi\nWhile in Chicago discussing the way forward, another child dies from gun violence just miles away. Devastating. https://t.co/3mXyMSTsxk -H\nRepublicans continue to play politics with families who want to contribute to our economy. Eso no es liderazgo. https://t.co/tl55HEIWwR\nGrateful to spend time today with mothers who have lost a child to violence and turned their grief into a national call to action. -H\nTheir faces say it all. https://t.co/vB2FrSHgDJ\nThe top 25 hedge fund managers make more than all kindergarten teachers in the US—combined. We need to fix that. https://t.co/zTkCxPUd46\n“We need to end private prisons and detention centers once and for all.” —Hillary in Atlanta https://t.co/f6S3zQ3CFQ\nOn the day of the first Democratic debate, Hillary’s granddaughter Charlotte had a big surprise for her.\nhttps://t.co/yxRM6gcTnJ\n¡Feliz Día de los Muertos! Text LATINOS to 47246 to join Latinos for Hillary. https://t.co/kC56iMB4nn\nMore than 1 in 100 American adults is behind bars. Here's how we can start fixing that. https://t.co/Qdz9h116G3\n\"I support Hillary because Hillary supports me.\" @OITNB’s @UzoAduba & Dascha Polanco are on Team Hillary.\nhttps://t.co/wauAhWHLnJ\nAn inside look at an issue that will shape our economy for years to come (yeah, it’s that important). https://t.co/88VTl6B8ec\nWhile Republicans swapped out-of-touch ideas at the #GOPdebate, Hillary was live-texting her reactions. https://t.co/OFyM5HEYbZ\nTop CEOs earn 300 times more than the typical American worker. That's wrong.\nhttps://t.co/SUFDsLTG3m\nThank you for the support, @BilldeBlasio. https://t.co/ylEKVsIpnx\n“I can't stop asking myself once again: Where does my community go from here?” -@claynmiddleton https://t.co/eakToXxU9h\nHappy Halloween! \u0001F383 https://t.co/kjfUE0YO8U\nMore lives lost. We need sensible gun violence prevention measures, and we need them now. https://t.co/uwcYLj1IRi\nRepublican debate-speak, decoded. https://t.co/vQwkoDt11x\nToo often, women still make less on the dollar than men. It's time for equal pay now.\nhttps://t.co/5HdYQXtQE2\nRated “O” for out of touch and out of date: The Zombie Policies. https://t.co/gso2dmzlq1\nGlad to see @USArmy knocking down more barriers to women serving on the front lines. https://t.co/SPbcZxcmG6\nAdd your name for the chance to party with Hillary at @xtina's house in Los Angeles! https://t.co/XVf5cqQxpl https://t.co/PBY52r7Xpo\nNo pagarle lo mismo a las campeonas del mundo de fútbol es más injusto que ganar el mundial con \"la mano de Díos.\" https://t.co/TWmzEETe7v\nRace still plays a role in who gets ahead and who gets held back. Hillary will fight to change that. Join her: https://t.co/eG2ciTEQ4K\nHillary calls to \"ban the box\": \"People who have paid their debt to society need to be able to find jobs, not just closed doors and hearts.\"\n\"I’m pledging to eliminate the disparity in sentencing between crack and cocaine, which disproportionately impacts African Americans.\"\n\"We need to end private prisons. Protecting public safety...should never be outsourced or left to unaccountable corporations.\" —Hillary\n\"We have to end the era of mass incarceration.\" —Hillary\n\"Racial profiling...is wrong, demeaning, doesn’t keep us safe or help solve crimes—it’s time to put that practice behind us.\" —Hillary\nHappening now: Hillary kicks off African Americans for Hillary with @repjohnlewis in Atlanta! Watch → https://t.co/HZ1LppKszD\nIt's intolerable that black children in our country feel unsafe in their own skin. A powerful reminder: https://t.co/afY33gjdsx -H\nWhether you're a teacher, an executive, or a world-champion soccer player, you deserve equal pay. Red card, GOP. https://t.co/TWmzEETe7v\n40 million Americans have student debt. We need to make college affordable once and for all. https://t.co/Hl7pGiZ4iQ\nWe can’t afford to have a Republican in the White House. If you're with Hillary, add your name: https://t.co/3AOKQEfdIA\nAn estimated 1.5 million black men are missing from their communities because of incarceration and premature death. https://t.co/cCSANbV4X1\nEveryone who works hard and does their part should see that work reflected in a rising paycheck.\nTexts from Hillary, #GOPdebate edition. https://t.co/KT21PtrHVP\nNo one should face discrimination for who they are or who they love—I support efforts for equality in Houston & beyond. #HERO #YesOnProp1 -H\nWhy are @OITNB’s @UzoAduba & Dascha Polanco on Team Hillary? \"She cares about the things that are important to us.\"\nhttps://t.co/uKBY0c0NDg\n\"Do you think that when you’re president, you’ll be paid as much as a man?\"\nhttps://t.co/2uQMq2v5ev\nTonight's #GOPDebate made it clear: We cannot afford a Republican in the White House. Get your free sticker: https://t.co/o662Sz9ACJ\n#GOPdebate https://t.co/rBT90JvCmM\nWill repeat this as often as needed: Women—not the politicians on stage—should make decisions about their own health. #GOPdebate\nRepublicans are looking out for the wealthy and well-connected. Hillary is looking out for us. #GOPdebate\nhttps://t.co/zTkCxPCBFw\nRepublicans are refusing to act on climate change. Hillary has a plan to take it on. https://t.co/Jb7DXwL9WS https://t.co/YbSmmW8mW6\nWe can't wait any longer to keep our communities safe. We need to act on gun violence prevention. https://t.co/37QVIbRnpd #GOPdebate\nThere is no place in America for second-class citizenship. We can't wait any longer for comprehensive immigration reform. #GOPdebate\nCommercial break: While Republicans work for those at the top, Hillary is going to bat for middle-class Americans.\nhttps://t.co/TrYTnwSmWu\nWe need to fight for policies that break down barriers to good jobs and help balance work and family: equal pay, child care, and paid leave.\nCommercial break: Hillary wants to make college affordable for every American. Republicans? #GOPdebate\nhttps://t.co/f5iUYZ8Ysp\nEvery woman deserves equal pay. Period. https://t.co/F5uzo79moY #GOPdebate\nLas mujeres deberían de ganar lo mismo por hacer el mismo trabajo que los hombres. Punto. #GOPdebate\nHere's what we can't afford: A Republican in the White House. https://t.co/d5zyMz7NgY #GOPdebate\nFor people who claim to hate big government, Republicans love using it to try and make health care decisions for women. #GOPdebate\nText WATCH to 47246 to get live texts from Hillary during the #GOPDebate! https://t.co/eMl4lCpNSP\nWe need to rein in risky behavior on Wall Street. Hillary's plan: https://t.co/eYdefYHM9a #GOPdebate https://t.co/TOwkGleBJv\nNo American should have to choose between getting the health care they need and paying rent. #GOPdebate\nCommercial break: Hillary is fighting for equal pay for women. Republicans are fighting against it. #GOPdebate\nhttps://t.co/ebzv1UawBM\nLos Republicanos siguen pensando que darle más recursos a los ricos beneficiará a la clase media. #GOPdebate\nHere's the thing: Republicans' ideas are trickle-down economics in disguise. We can't let them take us back to policies that don't work.\nMillionaires don't need tax breaks. Middle-class Americans do. https://t.co/jfTAzxfHGq #CNBCGOPDebate\nThe deck has been stacked in favor of the wealthy and well-connected for too long. https://t.co/nW2JqXGZT9 https://t.co/8wurGMNZIs\nLa retórica ofensiva de los candidatos Republicanos sobre los Latinos es vergonzosa y no tiene lugar en la política. #CNBCGOPDebate\nComprehensive immigration reform will strengthen families, our economy, and our country. #CNBCGOPDebate\nIn the past two Republican debates, no one said a word about equal pay. Maybe the third time's the charm? #GOPdebate\nWhich GOP candidate would you want to see Hillary take on in a debate? Cast your vote! https://t.co/IAf9qEWt7g https://t.co/LdvZ4HytVS\n.@clairecmc on what a GOP president means for women: “June Cleaver? Would people get that?” https://t.co/sYWtTuHgGf https://t.co/1Z34B6koES\nWe need to reauthorize the Export-Import Bank and help American businesses stay in business.\n\"If you're looking for someone to say what is wrong with America, I'm not your candidate. I think there is more right than wrong.\" —Hillary\n\"Paid family leave isn't just good for women.\" —Hillary at #PoliticsAndEggs\n.@StephenAtHome on \"Hillary for Halloween\" costume ideas: Dress up however you want, but stay for 11 hours.\nhttps://t.co/scXyiutlaE\nThat feeling when you picked *just* the right outfit. https://t.co/cOdpX0rzDU\n.@StephenAtHome: \"I was playing a character who did not care for you.\"\n\nHillary: \"I can say it now—it was mutual.\"\nhttps://t.co/RP8cPdEoh3\nDon’t miss Hillary’s first meeting with the real @stephenathome, tonight on @colbertlateshow! https://t.co/cCUqPSpPU7\nSome of America's most powerful women tell us why they support Hillary: https://t.co/6jEh4h6odZ https://t.co/a87Gq7tYhY\nCosign, @POTUS. https://t.co/NEBLEl7hkt\nNo hay ninguna excusa para usar violencia en nuestras escuelas. Punto. #AssaultAtSpringValleyHigh https://t.co/vIuWOAPFi2\n“Strong women help create strong families!” Read @katyperry’s note for Hillary's birthday: https://t.co/657n4LeA36 https://t.co/N78xLo4OfZ\nHumorous! https://t.co/3zbyqTIn0O\nThere is no excuse for violence inside a school. The #AssaultAtSpringValleyHigh is unacceptable—schools should be safe places. -H\nHillary has a plan to make affordable childcare a reality—and this supporter in Alexandria, Virginia knows it.\nhttps://t.co/BorYwrNJCv\nGiving students a world class education also means making sure adjunct faculty are paid fairly. #CampusEquityWeek https://t.co/jRsMhHWeRg\nThe GOP should stop trying to roll back consumer protections—standing with @POTUS to defend middle class savings. -H https://t.co/fi0BaHq013\nWell done, Ole Miss. Symbols of hate have no business flying over a place of learning. -H https://t.co/t3WL4pJcjV\nIt's her \u0001F447 birthday! https://t.co/OokdGojmJJ https://t.co/3p34BYrX3K\n♪ ♪ Qué linda está la mañana en que vengo a saludarte, venimos todos con gusto y placer a felicitarte... ♪ ♪ https://t.co/lGDjG7Dk9q\nQuick questions with Hillary: What family memories still make you laugh?\nhttps://t.co/5dm5GOWmHE\nToday is Hillary's birthday! Sign her card–it will make her day: https://t.co/1M7kkxbKLw https://t.co/RF7okkxPnk\nHillary is fighting for all of us. #IDPJJ https://t.co/VG2IKJItST\n.@ricky_martin tiene razón—hay que ser respetuoso y Hillary continuará demandando que los Republicanos lo sean. https://t.co/HLTxSHr5Ct\nIt was quite a week. Catch up on these stories before you start the new one. https://t.co/jkI929GhSL\nHighlights and behind-the-scenes moments from a big day in Iowa. https://t.co/Cd83dyGlPb #IDPJJ\n\"If talking about equal pay, paid family leave, child care, & women's health is playing the gender card—deal me in.\"\nhttps://t.co/hu1ELwXVp9\nHillary stands with parents and educators in calling for better, fairer, and fewer tests. On @usedgov's new plan: https://t.co/w53TrBGp8L\nHillary's birthday is tomorrow—and she's still on track to be the youngest woman US president ever. Sign her card! https://t.co/cLhVnvmvp1\nHappy birthday, @KatyPerry! \u0001F389 https://t.co/JO1BI6SxJz\n.@katyperry, you bring the campaign dress code to the next level. Thanks for hanging out with us in Iowa! -H https://t.co/nctt1B4ilH\n\"Go win this thing, Madam Secretary.\" Thanks, @davidplouffe. https://t.co/inR1TAxdVu\nHillary and @maddow talked about everything from Syria to health care—but first, Rachel was curious about one thing. https://t.co/oNtp766MgM\nA roaring good time at the Iowa JJ. https://t.co/2VzV5u2fQe\nDid Hillary rock at #IDPJJ? https://t.co/Y8tu28CEKa\n\"Together we’re going to build an America where...a father can tell his daughter, 'you can be anything you want to be—including president.'\"\n\"I’m listening to you. I’m fighting for you. And with your support, I’m going to deliver.\" —Hillary at #IDPJJ\n\"I’ve spent my life working for children, women, families, and our country...and I’m just getting warmed up.\" —Hillary at #IDPJJ\nWhy Hillary fights to prevent gun violence: \"You should be safe when you go to school, when you go to the movies, when you go to church.\"\n\"Yes—Black Lives Matter.\" —Hillary at #IDPJJ\n\"When you short-change women, you short-change families and you short-change America.\" —Hillary on why she's fighting for equal pay #IDPJJ\nHillary at the #IDPJJ: https://t.co/reLfQa31DJ\n\"Companies that ship jobs and profits overseas shouldn’t get a tax break—you should.\" —Hillary at #IDPJJ\nHillary on what she's fighting for: \"At the top of the list is this: Americans need a raise.\" #IDPJJ\n\"As a smart man once said, there’s nothing wrong with America that can’t be fixed by what is right with America.\" —Hillary #IDPJJ\n\"It’s not enough just to rail against the Republicans or the billionaires. We have to...make a difference in people’s lives.\" —Hillary\nHillary at the Iowa Jefferson-Jackson dinner. #ImWithHer https://t.co/TchCBBw7hp\n\"For people who claim they hate big government, Republicans sure love using government to step in and make decisions for women.\" —Hillary\n\"We are going to stop Wall Street hurting Main Street.\" —Hillary at the #IDPJJ\n\"There is something wrong when the top 25 hedge fund managers make more than all the kindergarten teachers in America combined.\" —Hillary\n\"We need to defend the progress we’ve made under President Obama and build on it.\" —Hillary at #IDPJJ\n\"When there’s a Democrat in the White House, America creates more jobs, the economy grows faster, and deficits are smaller.\" —Hillary\nHillary on the GOP debates: \"It's reality TV—with a cast of characters who don't care much about actual reality.\" #IDPJJ\nWATCH LIVE: Hillary speaks at the Iowa Jefferson-Jackson dinner, 100 days before the #IAcaucus → https://t.co/SMrVPsIJDM #IDPJJ\nThank you, @davidplouffe​. https://t.co/rRXnLazrPU -H\nAgreed, President @billclinton! https://t.co/rsAiHQ2ma7\n\"Sometimes, you just have to ROAR!\" —Hillary after @katyperry's performance at the @HillaryforIA rally in Des Moines. #HillYes\n\"I'm tired of the stranglehold that women have had on presidential spouse.” —President @billclinton at the @HillaryforIA rally in Des Moines\nLive from Des Moines, Iowa: @billclinton, @KatyPerry, and team @HillaryforIA! Watch → https://t.co/aKD8HTHf9b #HillYes\nThanks for following our incredible day in Iowa—stay tuned to hear @katyperry, @billclinton, and Hillary! #HillYes https://t.co/f24SyhXI9Z\nSO EXCITED to see @katyperry—but while we wait, she's taking over Hillary's Instagram! https://t.co/FMBZnWcMdY https://t.co/fJkSnaLGZ7\nWhy #ImWithHer: I trust Hillary. She will make the world better for me, my husband, and my mom. #HillYes https://t.co/jeNEQJjecb\nThere are people across IA doing what I do every day: knocking on doors, making calls, and doing our part to win the caucus on Feb 1!\nMy team has become a 2nd family. Here’s us the day the Supreme Court legalized marriage equality—I’m in the middle. https://t.co/IUGrptxYqd\nI organize in rural Iowa. Knocking doors here means driving 20 minutes between each house—but it's not all bad. https://t.co/9NBq1m0F6Z\nI got to introduce Hillary at an event in Dubuque a few months ago—it was an experience I’ll never forget. #HillYes https://t.co/yy6Y4Bsyd5\nAs a military spouse, I stand with Hillary on national security—& she'll make sure I won't have to worry about getting fired for who I love.\nMore than anyone, Hillary knows that the decisions she will make as President affect me and my family. #HillYes https://t.co/DwR2Ec3A5N\nBefore Iowa, I was in NC with my husband Aaron & our cat Pretzel. When Hillary announced I knew I had to be here. https://t.co/IRmyhhpoi8\n\nAs an organizer in Iowa, I spend my days talking to folks in my community about Hillary and her vision for America. https://t.co/9aUQXzHAhkHi! I’m James, a @HillaryforIA organizer in NE Iowa. I’ll be tweeting today ahead of the Jefferson-Jackson dinner! https://t.co/2nGjODKbHS\nHillary on the stakes of this election on @maddow tonight: https://t.co/JdxOTmQbDv\nPost-hearing activities: \"We sat around eating Indian food and drinking wine & beer.\" Tune in to @maddow at 9pm ET! https://t.co/pv74TfXmxG\nHillary and Rachel. Tune in to @maddow at 9:00 pm ET!\nAnyone who’s sick of Hillary standing up for women had better get ready for a long campaign. https://t.co/6yfsZLIgr7\n11 hours. One candidate who showed she’s ready to be president. https://t.co/C48a403ei0\nWelcome to @sesamestreet, Julia! Kudos to @SesameWorkshop & @autismspeaks for educating parents & kids about autism. https://t.co/v0gDxpVdjj\nTo everyone in the path of #HurricanePatricia, follow @CENAPRED_mex for shelter locations and emergency info. Thinking of you—stay safe. -H\n“I am a little feminist growing up to help all women with equal rights.” Meet Olivia: https://t.co/xN2sFbF4Rm\n\"I'm running for President, because after listening to people across our country, your fights are my fights.\" https://t.co/h8qECEPqsx\nWatch live as Hillary takes the stage in Alexandria, VA with @TerryMcAuliffe → https://t.co/8hVpwXewIi\nThanks for your support, brothers & sisters of @AFSCME. You never stop fighting for working families, & I'll never stop fighting for you. -H\nHillary on those who tell her to \"stop shouting\" on issues that matter. https://t.co/pmZ4FJihvH\n\"I'm doing everything I can to make sure the issues that matter most to women and families are front and center in this election.\" —Hillary\nIf you're proud to stand with Hillary, show the world with your free sticker → https://t.co/0Xb1A8C8L3\n11 hours in → #ImWithHer https://t.co/0t9V3oqZGQ https://t.co/wxtU2atLte\nIf you're standing with Hillary, let her know: https://t.co/6CRK1JCS8t\nHillary's email use can be summed up in four sentences: https://t.co/N8ba4DBSBx #BenghaziCommittee\nIf you're standing with Hillary today, let her know: https://t.co/6CRK1JCS8t\nAs Secretary, Hillary implemented reforms to protect diplomats and help prevent future attacks. #BenghaziCommittee\nhttps://t.co/PbkQZVlxLI\nAmerica must continue to lead in a dangerous world. To do otherwise would mean drawing the wrong lesson from the Benghazi tragedy.\nA lesson from Benghazi: Congress needs to do its part to ensure that our diplomats in dangerous parts of the world are as safe as possible.\nWe need leadership that puts national security ahead of politics and ideology. #BenghaziCommittee\nhttps://t.co/8nBtzV0E6K\nHillary this morning at the House Select Committee on Benghazi. https://t.co/ZxhcSJVAfI\n\"The American people expect us to lead. To learn the right lessons. To rise above partisanship and reach for statesmanship.\" —Hillary\n\"I am here, despite all the previous investigations...to honor those we lost and to do what I can to aid those who serve us still.\" —Hillary\n\"We should debate on the basis of fact, not fear. We should resist denigrating the patriotism or loyalty of those who disagree with us.\"\nAmerica \"has a long history of bipartisan cooperation on foreign policy...I know it’s possible to find common ground because I’ve done it.\"\n\"We need leadership at home to match our leadership abroad. Leadership that puts national security ahead of politics and ideology.\" —Hillary\n\"Efforts to establish a modern joint training center are being held up by Congress. The men and women who serve our country deserve better.\"\n\"There is more to do, and no administration can do it alone. Congress has to be our partner as it has been after previous tragedies.\"\n\"I pledged that...every one [of the Accountability Review Board's recommendations] would be on the way to implementation. And they were.\"\n\"We have a responsibility to provide diplomats with the resources & support they need to do their jobs as safely & effectively as possible.\"\nHillary on fallen Americans in Libya: \"They believed—as I do—that America is greatest force for peace & progress the world has ever known.\"\n\"We need creative, confident...leadership that integrates and balances the tools of diplomacy, development, and defense.\" —Hillary\n\"Retreat from the world is not an option. America cannot shrink from our responsibility to lead.\" —Hillary\n\"We have learned the hard way when America is absent, especially from unstable places, there are consequences.\" —Hillary #BenghaziCommittee\n\"If you ask our most experienced ambassadors, they’ll tell you they can’t do their jobs for us from bunkers.\" —Hillary\nHillary at the #BenghaziCommittee. https://t.co/Op750p9avA\n\"We inevitably must accept a level of risk to protect our country and advance our interests and values.\" —Hillary\n\"America must lead in a dangerous world, and our diplomats must continue representing us in dangerous places.\" —Hillary\n\"Today I would like to share three observations about how we can learn from this tragedy and move forward as a nation.\" —Hillary\n\"I launched reforms to better protect our people in the field and help reduce the chances of another tragedy happening.\" —Hillary\n\"I am here to honor the service of those four men...and the work their colleagues do every single day all over the world.\" —Hillary\nThe #BenghaziCommittee explained, by @johnpodesta. https://t.co/g4Br5qrJT4\nThe @HouseBenghazi hearing is starting now. Follow @TheBriefing2016 for the facts you need to know. https://t.co/rneb003Nzs\nThis morning, Hillary testifies before @HouseBenghazi. Follow @TheBriefing2016 for fact-checks from the hearing. https://t.co/CWUkoewxD3\nHillary is testifying before @HouseBenghazi today. Here's what you need to know. https://t.co/1U6IIHE1pe\nThank you, @POTUS, for taking these critical steps to end the qu",
  "entities": [
    {
      "type": "Person",
      "relevance": "0.861402",
      "sentiment": {
        "type": "positive",
        "score": "0.0670398",
        "mixed": "1"
      },
      "count": "115",
      "text": "Hillary",
      "quotations": [
        {
          "quotation": "\nHillary calls to \"ban the box\": \"People who have paid their debt to society need to be able to find jobs, not just closed doors and hearts.\"",
          "sentiment": {
            "type": "negative",
            "score": "-0.0623549"
          }
        },
        {
          "quotation": "\nHillary calls to \"ban the box\": \"People who have paid their debt to society need to be able to find jobs, not just closed doors and hearts.\"\n\"I’m pledging to eliminate the disparity in sentencing between crack and cocaine, which disproportionately impacts African Americans.\"\n\"We need to end private prisons. Protecting public safety...should never be outsourced or left to unaccountable corporations.\"",
          "sentiment": {
            "type": "negative",
            "score": "-0.038712",
            "mixed": "1"
          }
        },
        {
          "quotation": "\nHillary calls to \"ban the box\": \"People who have paid their debt to society need to be able to find jobs, not just closed doors and hearts.\"\n\"I’m pledging to eliminate the disparity in sentencing between crack and cocaine, which disproportionately impacts African Americans.\"\n\"We need to end private prisons. Protecting public safety...should never be outsourced or left to unaccountable corporations.\" —Hillary\n\"We have to end the era of mass incarceration.\"",
          "sentiment": {
            "type": "negative",
            "score": "-0.0230221",
            "mixed": "1"
          }
        },
        {
          "quotation": "\nHillary calls to \"ban the box\": \"People who have paid their debt to society need to be able to find jobs, not just closed doors and hearts.\"\n\"I’m pledging to eliminate the disparity in sentencing between crack and cocaine, which disproportionately impacts African Americans.\"\n\"We need to end private prisons. Protecting public safety...should never be outsourced or left to unaccountable corporations.\" —Hillary\n\"We have to end the era of mass incarceration.\" —Hillary\n\"Racial profiling...is wrong, demeaning, doesn’t keep us safe or help solve crimes—it’s time to put that practice behind us.\"",
          "sentiment": {
            "type": "negative",
            "score": "-0.0220932",
            "mixed": "1"
          }
        },
        {
          "quotation": "\n\"Strong women help create strong families!\" Read @katyperry’s note for Hillary ...",
          "sentiment": {
            "type": "positive",
            "score": "0.137714"
          }
        },
        {
          "quotation": "\nHillary on those who tell her to \"stop shouting\" ...",
          "sentiment": {
            "type": "negative",
            "score": "-0.0242043"
          }
        }
      ]
    },
    {
      "type": "Person",
      "relevance": "0.447321",
      "sentiment": {
        "type": "negative",
        "score": "-0.252846",
        "mixed": "1"
      },
      "count": "6",
      "text": "Hillary Clinton",
      "disambiguated": {
        "subType": [
          "Politician",
          "Appointee",
          "AwardWinner",
          "BoardMember",
          "Celebrity",
          "HallOfFameInductee",
          "OperaCharacter",
          "Senator",
          "U.S.Congressperson",
          "TVActor"
        ],
        "name": "Hillary Rodham Clinton",
        "website": "http://www.state.gov/secretary/index.htm",
        "dbpedia": "http://dbpedia.org/resource/Hillary_Rodham_Clinton",
        "freebase": "http://rdf.freebase.com/ns/m.0d06m5",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvV7SqpwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Hillary_Rodham_Clinton"
      },
      "quotations": [
        {
          "quotation": "\nHillary Clinton called out Republicans for slamming the door on Syrian refugees: \"We’re better than that.\" ...",
          "sentiment": {
            "type": "negative",
            "score": "-0.0188758",
            "mixed": "1"
          }
        }
      ]
    },
    {
      "type": "JobTitle",
      "relevance": "0.413047",
      "sentiment": {
        "type": "positive",
        "score": "0.0463742",
        "mixed": "1"
      },
      "count": "26",
      "text": "president"
    },
    {
      "type": "Continent",
      "relevance": "0.391626",
      "sentiment": {
        "type": "positive",
        "score": "0.0803875",
        "mixed": "1"
      },
      "count": "26",
      "text": "America"
    },
    {
      "type": "Person",
      "relevance": "0.285738",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Hillary habló"
    },
    {
      "type": "Country",
      "relevance": "0.257187",
      "sentiment": {
        "type": "negative",
        "score": "-0.239472",
        "mixed": "1"
      },
      "count": "7",
      "text": "United States",
      "disambiguated": {
        "subType": [
          "Location",
          "Region",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "FilmEditor"
        ],
        "name": "United States",
        "website": "http://www.usa.gov/",
        "dbpedia": "http://dbpedia.org/resource/United_States",
        "freebase": "http://rdf.freebase.com/ns/m.09c7w0",
        "ciaFactbook": "http://www4.wiwiss.fu-berlin.de/factbook/resource/United_States",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVikKpwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/United_States"
      }
    },
    {
      "type": "Person",
      "relevance": "0.239985",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Hillary rock"
    },
    {
      "type": "Person",
      "relevance": "0.235625",
      "sentiment": {
        "type": "negative",
        "score": "-0.33921",
        "mixed": "1"
      },
      "count": "5",
      "text": "President Obama"
    },
    {
      "type": "Person",
      "relevance": "0.226312",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Hillary protegerá"
    },
    {
      "type": "Organization",
      "relevance": "0.221696",
      "sentiment": {
        "type": "negative",
        "score": "-0.737145"
      },
      "count": "6",
      "text": "GOP",
      "quotations": [
        {
          "quotation": "GOP debates: \"It's reality TV—with a cast of characters who don't care much about actual reality.\"",
          "sentiment": {
            "type": "negative",
            "score": "-0.151773"
          }
        }
      ]
    },
    {
      "type": "FieldTerminology",
      "relevance": "0.213282",
      "sentiment": {
        "type": "positive",
        "score": "0.410023"
      },
      "count": "4",
      "text": "comprehensive immigration reform"
    },
    {
      "type": "Organization",
      "relevance": "0.212631",
      "sentiment": {
        "type": "negative",
        "score": "-0.289998",
        "mixed": "1"
      },
      "count": "6",
      "text": "ISIS",
      "disambiguated": {
        "subType": [
          "MusicalGroup",
          "MusicalArtist",
          "MusicalGroupMember"
        ],
        "name": "Isis (band)",
        "website": "http://www.isistheband.com/",
        "dbpedia": "http://dbpedia.org/resource/Isis_(band)",
        "freebase": "http://rdf.freebase.com/ns/m.052k44",
        "yago": "http://yago-knowledge.org/resource/Isis_(band)",
        "musicBrainz": "http://zitgist.com/music/artist/5e521e8c-0ab2-44c4-8fd8-14d8d3321265"
      }
    },
    {
      "type": "City",
      "relevance": "0.194944",
      "sentiment": {
        "type": "negative",
        "score": "-0.0368541",
        "mixed": "1"
      },
      "count": "4",
      "text": "Paris"
    },
    {
      "type": "Organization",
      "relevance": "0.194526",
      "sentiment": {
        "type": "negative",
        "score": "-0.507824"
      },
      "count": "5",
      "text": "Congress",
      "disambiguated": {
        "subType": [
          "Dedicator",
          "GovernmentalBody",
          "Legislature",
          "NaturalOrCulturalPreservationAgency"
        ],
        "name": "United States Congress",
        "website": "http://www.house.gov/",
        "dbpedia": "http://dbpedia.org/resource/United_States_Congress",
        "freebase": "http://rdf.freebase.com/ns/m.07t31",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rwP1W2JwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/United_States_Congress"
      }
    },
    {
      "type": "FieldTerminology",
      "relevance": "0.187325",
      "sentiment": {
        "type": "positive",
        "score": "0.126969",
        "mixed": "1"
      },
      "count": "3",
      "text": "foreign policy"
    },
    {
      "type": "FieldTerminology",
      "relevance": "0.184041",
      "sentiment": {
        "type": "negative",
        "score": "-0.515692"
      },
      "count": "3",
      "text": "climate change"
    },
    {
      "type": "Facility",
      "relevance": "0.183577",
      "sentiment": {
        "type": "negative",
        "score": "-0.299985"
      },
      "count": "4",
      "text": "White House"
    },
    {
      "type": "Person",
      "relevance": "0.18178",
      "sentiment": {
        "type": "negative",
        "score": "-0.169633",
        "mixed": "1"
      },
      "count": "3",
      "text": "Donald Trump",
      "disambiguated": {
        "subType": [
          "AwardNominee",
          "AwardWinner",
          "Celebrity",
          "CompanyFounder",
          "TVPersonality",
          "TVProducer",
          "FilmActor",
          "TVActor"
        ],
        "name": "Donald Trump",
        "website": "http://www.trumponline.com/",
        "dbpedia": "http://dbpedia.org/resource/Donald_Trump",
        "freebase": "http://rdf.freebase.com/ns/m.0cqt90",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rv0ncIZwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Donald_Trump"
      }
    },
    {
      "type": "Holiday",
      "relevance": "0.170968",
      "sentiment": {
        "type": "positive",
        "score": "0.691386"
      },
      "count": "2",
      "text": "Thanksgiving",
      "disambiguated": {
        "subType": [],
        "name": "Thanksgiving (United States)",
        "dbpedia": "http://dbpedia.org/resource/Thanksgiving_(United_States)",
        "freebase": "http://rdf.freebase.com/ns/m.026zqzc",
        "yago": "http://yago-knowledge.org/resource/Thanksgiving_(United_States)"
      }
    },
    {
      "type": "Person",
      "relevance": "0.169705",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Shirley Chisholm",
      "disambiguated": {
        "subType": [
          "Politician",
          "AwardNominee",
          "U.S.Congressperson",
          "HallOfFameInductee"
        ],
        "name": "Shirley Chisholm",
        "dbpedia": "http://dbpedia.org/resource/Shirley_Chisholm",
        "freebase": "http://rdf.freebase.com/ns/m.02qt3_",
        "yago": "http://yago-knowledge.org/resource/Shirley_Chisholm"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.169546",
      "sentiment": {
        "type": "negative",
        "score": "-0.407539"
      },
      "count": "2",
      "text": "Texas",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "Texas",
        "geo": "31.0 -100.0",
        "website": "http://www.texasonline.com/",
        "dbpedia": "http://dbpedia.org/resource/Texas",
        "freebase": "http://rdf.freebase.com/ns/m.07b_l",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVkBk5wpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Texas"
      }
    },
    {
      "type": "Person",
      "relevance": "0.169182",
      "sentiment": {
        "type": "positive",
        "score": "0.707657"
      },
      "count": "1",
      "text": "Meryl Streep",
      "disambiguated": {
        "subType": [
          "Actor",
          "MusicalArtist",
          "AwardNominee",
          "AwardWinner",
          "Celebrity",
          "FilmActor",
          "MusicalGroupMember",
          "TheaterActor",
          "TVActor"
        ],
        "name": "Meryl Streep",
        "website": "http://www.merylstreeponline.net/",
        "dbpedia": "http://dbpedia.org/resource/Meryl_Streep",
        "freebase": "http://rdf.freebase.com/ns/m.0h0wc",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvjId15wpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Meryl_Streep",
        "musicBrainz": "http://zitgist.com/music/artist/eb8b0a8a-dc7d-480c-b83a-70a069150d05"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.168493",
      "sentiment": {
        "type": "positive",
        "score": "0.375268",
        "mixed": "1"
      },
      "count": "10",
      "text": "Iowa",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "Iowa",
        "website": "http://www.iowa.gov",
        "dbpedia": "http://dbpedia.org/resource/Iowa",
        "freebase": "http://rdf.freebase.com/ns/m.03s0w",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVi3ipwpEbGdrcN5Y29ycA",
        "census": "http://www.rdfabout.com/rdf/usgov/geo/us/ia",
        "yago": "http://yago-knowledge.org/resource/Iowa"
      }
    },
    {
      "type": "Company",
      "relevance": "0.167862",
      "sentiment": {
        "type": "positive",
        "score": "0.628475"
      },
      "count": "1",
      "text": "Twitter",
      "disambiguated": {
        "subType": [
          "Website",
          "VentureFundedCompany"
        ],
        "name": "Twitter",
        "website": "http://twitter.com/",
        "dbpedia": "http://dbpedia.org/resource/Twitter",
        "freebase": "http://rdf.freebase.com/ns/m.0289n8t",
        "crunchbase": "http://www.crunchbase.com/company/twitter"
      }
    },
    {
      "type": "Person",
      "relevance": "0.164118",
      "sentiment": {
        "type": "positive",
        "score": "0.469355"
      },
      "count": "3",
      "text": "Dascha Polanco"
    },
    {
      "type": "Person",
      "relevance": "0.164055",
      "sentiment": {
        "type": "negative",
        "score": "-0.399406"
      },
      "count": "2",
      "text": "Hillary."
    },
    {
      "type": "Organization",
      "relevance": "0.163392",
      "sentiment": {
        "type": "positive",
        "score": "0.356143"
      },
      "count": "3",
      "text": "NRA."
    },
    {
      "type": "Crime",
      "relevance": "0.162317",
      "sentiment": {
        "type": "negative",
        "score": "-0.290774"
      },
      "count": "1",
      "text": "assault"
    },
    {
      "type": "JobTitle",
      "relevance": "0.159627",
      "sentiment": {
        "type": "negative",
        "score": "-0.211505"
      },
      "count": "2",
      "text": "scientist"
    },
    {
      "type": "Person",
      "relevance": "0.159402",
      "sentiment": {
        "type": "positive",
        "score": "0.419343"
      },
      "count": "4",
      "text": "Olivia 2040"
    },
    {
      "type": "JobTitle",
      "relevance": "0.157855",
      "sentiment": {
        "type": "positive",
        "score": "0.552817"
      },
      "count": "1",
      "text": "Senior policy advisor"
    },
    {
      "type": "Organization",
      "relevance": "0.15736",
      "sentiment": {
        "type": "negative",
        "score": "-0.670808"
      },
      "count": "2",
      "text": "DAPA"
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.157094",
      "sentiment": {
        "type": "neutral"
      },
      "count": "2",
      "text": "Virginia",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "Virginia",
        "website": "http://www.virginia.gov",
        "dbpedia": "http://dbpedia.org/resource/Virginia",
        "freebase": "http://rdf.freebase.com/ns/m.0f2wcp",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvViztZwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Virginia"
      }
    },
    {
      "type": "Person",
      "relevance": "0.157081",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "¡Hillary"
    },
    {
      "type": "JobTitle",
      "relevance": "0.157031",
      "sentiment": {
        "type": "positive",
        "score": "0.807322"
      },
      "count": "1",
      "text": "official"
    },
    {
      "type": "Person",
      "relevance": "0.156149",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Gov. Beshear."
    },
    {
      "type": "FieldTerminology",
      "relevance": "0.155485",
      "sentiment": {
        "type": "negative",
        "score": "-0.147461",
        "mixed": "1"
      },
      "count": "3",
      "text": "African Americans"
    },
    {
      "type": "Organization",
      "relevance": "0.154832",
      "sentiment": {
        "type": "negative",
        "score": "-0.626707"
      },
      "count": "2",
      "text": "GOP."
    },
    {
      "type": "Person",
      "relevance": "0.154668",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Wilma Mankiller",
      "disambiguated": {
        "subType": [
          "Politician",
          "AwardWinner",
          "HallOfFameInductee"
        ],
        "name": "Wilma Mankiller",
        "dbpedia": "http://dbpedia.org/resource/Wilma_Mankiller",
        "freebase": "http://rdf.freebase.com/ns/m.033dhz",
        "yago": "http://yago-knowledge.org/resource/Wilma_Mankiller"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.153853",
      "sentiment": {
        "type": "positive",
        "score": "0.62251"
      },
      "count": "2",
      "text": "Iowa."
    },
    {
      "type": "FieldTerminology",
      "relevance": "0.153771",
      "sentiment": {
        "type": "neutral"
      },
      "count": "2",
      "text": "secretary of state"
    },
    {
      "type": "FieldTerminology",
      "relevance": "0.153129",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Election Day"
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.152816",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Louisiana"
    },
    {
      "type": "Organization",
      "relevance": "0.152671",
      "sentiment": {
        "type": "positive",
        "score": "0.562766"
      },
      "count": "4",
      "text": "SEIU",
      "disambiguated": {
        "subType": [
          "TradeUnion"
        ],
        "name": "Service Employees International Union",
        "website": "http://www.seiu.org/",
        "dbpedia": "http://dbpedia.org/resource/Service_Employees_International_Union",
        "freebase": "http://rdf.freebase.com/ns/m.02fxxs",
        "yago": "http://yago-knowledge.org/resource/Service_Employees_International_Union"
      }
    },
    {
      "type": "Country",
      "relevance": "0.151908",
      "sentiment": {
        "type": "neutral"
      },
      "count": "2",
      "text": "France",
      "disambiguated": {
        "subType": [
          "Location",
          "Region",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "FilmDirector"
        ],
        "name": "France",
        "geo": "47.0 2.0",
        "website": "http://www.service-public.fr/etranger/english.html",
        "dbpedia": "http://dbpedia.org/resource/France",
        "freebase": "http://rdf.freebase.com/ns/m.0f8l9c",
        "ciaFactbook": "http://www4.wiwiss.fu-berlin.de/factbook/resource/France",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVj6EJwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/France"
      }
    },
    {
      "type": "City",
      "relevance": "0.151355",
      "sentiment": {
        "type": "positive",
        "score": "0.610025"
      },
      "count": "2",
      "text": "Alexandria",
      "disambiguated": {
        "subType": [
          "AdministrativeDivision"
        ],
        "name": "Alexandria",
        "geo": "31.198 29.9192",
        "website": "http://www.alexandria.gov.eg/default.aspx",
        "dbpedia": "http://dbpedia.org/resource/Alexandria",
        "freebase": "http://rdf.freebase.com/ns/m.013g3",
        "geonames": "http://sws.geonames.org/361058/",
        "yago": "http://yago-knowledge.org/resource/Alexandria"
      }
    },
    {
      "type": "JobTitle",
      "relevance": "0.151302",
      "sentiment": {
        "type": "negative",
        "score": "-0.0718928",
        "mixed": "1"
      },
      "count": "2",
      "text": "executive"
    },
    {
      "type": "Organization",
      "relevance": "0.150496",
      "sentiment": {
        "type": "negative",
        "score": "-0.643837"
      },
      "count": "2",
      "text": "Republicans"
    },
    {
      "type": "City",
      "relevance": "0.150197",
      "sentiment": {
        "type": "positive",
        "score": "0.412144"
      },
      "count": "1",
      "text": "Ames",
      "disambiguated": {
        "subType": [],
        "name": "Ames, Iowa",
        "website": "http://www.cityofames.org/",
        "dbpedia": "http://dbpedia.org/resource/Ames,_Iowa",
        "freebase": "http://rdf.freebase.com/ns/m.0nmj",
        "geonames": "http://sws.geonames.org/4846834/",
        "yago": "http://yago-knowledge.org/resource/Ames,_Iowa"
      }
    },
    {
      "type": "Holiday",
      "relevance": "0.149776",
      "sentiment": {
        "type": "positive",
        "score": "0.645766"
      },
      "count": "2",
      "text": "Halloween"
    }
  ]
}