{
  "status": "OK",
  "warningMessage": "truncated-oversized-text-content",
  "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
  "url": "",
  "totalTransactions": "2",
  "language": "english",
  "text": "\"@thatx209xguy: @realDonaldTrump @DailyCaller Trump is our last hope to make America great again. #Trump2016\" So true!\"@Asmurfinmypants: I can't wait to vote for @realDonaldTrump #MakeAmericaGreatAgain\"\n\"@DailyCaller: How High Corporate Taxes Lost America The World’s Next Biggest Drug Company https://t.co/tsrFghb7l2 https://t.co/12vwdc0cPs\n\"@Allibiis: @realDonaldTrump @ArtPar17 @CNN story is bogus. Donald Trump has the most diverse group of voters/supporters in the GOP field.\"\n.@CNN has to do better reporting if it wants to keep up with the crowd.So totally one-sided and biased against me that it is becoming boring\n\"@Pablo44x: @CNN @realDonaldTrump Another hit piece by CNN. \"What? We're not biased!\"\"\nI will be on @meetthepress in an interview with @chucktodd on Sunday morning. So much to talk about!\n\"@ArtPar17: @CNN   Your story is a total fraud\"  I agree!\n\"@JacoH: @CNN @realDonaldTrump I can't believe how low CNN can go. Obviously a bunch of Killary fans.\" @CNN only says negative-bad reporters\nThe Sarasota, Florida, rally today was amazing. 12,000 people chanting their love for our country. It's going to happen, this is a MOVEMENT!\n.@CNN Kayleigh McEnany was great on you network today. You should have her  on more often! Thank you Kayleigh for your nice words.\n\"@buckleybro40:  @RichLowry @maggieNYT @TheFix @pbump @realDonaldTrump so great in Sarasota, FL! #TurntTrump We're following T all the way!\"\n\"@nobaddog: @RepBJNikkel @CindyBlackwel12 JohnKasich  All you career Politicians are shaking in your shoes for fear Trump gets elected\"\n\"@Jameslauer6: @David360NC @azblonde2015 NOW'S THE TIME 4 CHRISTIANS TO GET OUT THE VOTE BIG TIME TO SAVE CHRISTIANITY ONCE & 4 ALL. TRUMP\"\nSarasota was an unbelievable success. We expected 5,000, a record, but 12,000 showed up! Great love in the air! https://t.co/utmlCpGNGu\nWe boarded the helicopter for Sarasota earlier & will be landing soon! See you there. #Trump2016 https://t.co/x4RbbKXHCu\n\"@munciewolves: @realDonaldTrump America backs you. Your our next President!!!!\" Thank you!\nVirtually no-one has spent more money in helping the  American people with disabilities than me. Will discuss today at my speech in Sarasota\nThe reporter who pulled-back from his 14 year old never retracted story is having fun. I don't know what he looks like and don't know him!\nI will be going to Sarasota, Florida, today for a big rally with amazing people! I have one goal on mind: MAKE AMERICA GREAT AGAIN!\n\"@Trump2016online: Live Stream: Donald Trump Rally in Sarasota, FL Nov 28 - 12:00 PM (EST) https://t.co/OSkVKDRhrr #Trump2016 #RobartsArena\n\"@tweetybird2009: @GulfWarVet123 That's why @realDonaldTrump's THE MAN. CANNOT BE BOUGHT BY #Establishment #Media #PUNDITS. #TheyRMad\nPollster Trend \nNational GOP Average\n223 national polls & 33 pollsters.\n#MakeAmericaGreatAgain #Trump2016 https://t.co/mILAGwjvS2\n\"@MargaretCrowth1: @realDonaldTrump Incompetence now the norm. NYTimes is an example. Need competent leader as role model. Trump2016\"\n\"@reallyo1: @realDonaldTrump @MarkSimoneNY Don't let the jackals in the media trip u up. Their getting desperate\"\n\"@MargaretCrowth1: @realDonaldTrump So like the media to make something out of nothing. Don't let them sidetrack from the message.\"\n\"@DeusVultGeorgia: @MingBlueTeaCup @RickCanton @_Holly_Renee @realDonaldTrump should the reporter's dishonesty be shielded from ridicule?\"\n\"@VaughnVhalen: Donald Trump Rises to 38% Nationally; Ted Cruz Edges into 2nd at 12%\n\"@MarkSimoneNY: Great twitter quote about Donald Trump: \"Never apologize for fake controversies whipped up by the perpetually offended media\n\"@Rketeltas: @realDonaldTrump If you combine the business models for both Macy's & the NY Times, both are on a rapid decline, such a pity.\"\n\"@pthebnyc: @realDonaldTrump @Sari_Swensen @nytimes no need to explain, Sir. We've got your back.\"  Thanks!\n\"@BeezakaMrB: @realDonaldTrump Shopping @Macys is NO LONGER a family CHRISTMAS TIME tradition in my house.\" Great, a very disloyal chain!\nThe failing @nytimes should focus on fair and balanced reporting rather than constant hit jobs on me. Yesterday 3 boring articles, today2!\nI do not know the reporter for the @nytimes, or what he looks like. I was showing a person groveling to take back a statement made long ago!\nGreat new poll numbers! Thank you for your support! #Trump2016 https://t.co/vmrsOnsMRo\n\"@PrisonPlanet: .@realDonaldTrump gets it. Never apologize for fake controversies whipped up by the perpetually offended  media.\"\nhttps://t.co/T5JBFXOz3F\nHappy Thanksgiving to all. Have a great day and look forward to the future. We will MAKE AMERICA GREAT AGAIN!\nThe numbers at the @nytimes  are so dismal, especially advertising revenue, that big help will be needed fast. A once great institution-SAD!\nSo, since the people at the @nytimes have made all bad decisions over the last decade, why do people care what they write. Incompetent!\nThe dopes at the @nytimes bought the Boston Globe for $1.3 billion and sold it for $1.00. Their great old headquarters-gave it away! So dumb\nThe @nytimes is so poorly run and managed that other family members are looking to take over control. With unfunded liabilities-big trouble!\n\"@RioSunny3: @realDonaldTrump @WKRG I lived in New Jersey at that time and witnessed all that as well.\nThe failing @nytimes should be focused on good reporting and the papers financial survival and not with constant hits on Donald Trump!\n\"@Keeping__Real: So good to see the @realDonaldTrump family out with him on the campaign trail! It really shows the family man that he is!\"\nCredible Source on 9-11 Muslim Celebrations: FBI\nhttps://t.co/UICDNcftJS via @WKRG\n#MakeAmericaGreatAgain #Trump2016 https://t.co/r9ARuMdyMn\nI LIVE IN NEW JERSEY & @realDonaldTrump IS RIGHT: MUSLIMS DID CELEBRATE ON 9/11 HERE! WE SAW IT! https://t.co/1SksZU9qlj\n\"@realdctaylor: The Establishment is afraid of @realDonaldTrump. Once we try a business man we may never want a politician again! #TeamTrump\nThank you for your continued support!\n#MakeAmericaGreatAgain #Trump2016 https://t.co/SLo49cY9KB\n\"@FranMFarber:  @Morning_Joe @FoxNews @morningmika did not say very nice things about you this morning on her show. Typical liberal!\" True!\n\"@jbclemson: @realDonaldTrump @karl @Morning_Joe @FoxNews Bombed is an understatement. Pathetic attempt by #GOP. Rove embarrassed himself\"\n\"@raider8381:  @Morning_Joe @FoxNews   America wants DONALD TRUMP! \"TV Heads\" still refuse to embrace that reality! Media are LIARS.\"\n\"@patty_laughlin: DonaldTrump @karl @Morning_Joe @FoxNews Never thought much of Carl.. Make America Great Again Trump for President 2016\"\n\"@DonnySmith557: @karl @Morning_Joe @FoxNews Karl is a total joke!!!! If he didn't have the Bush family and Fox he wouldn't have anything! !\nSouth Carolina was so great last night. Will be back soon!\nWhy would @greta use @KarlRove as an election analyst when he has made so many mistakes. He still thinks Romney won. An establishment dope!\n\"@idawhannadoyou: @realDonaldTrump @OANN Love it. Wish I could get @OANN I hear good things about them such as objective unbiased reporting.\n\"@GlendaAhrens: @realDonaldTrump @OANN Fantastic winning all the way to WH #Trump2016\"\n\"@MichaelCohen212: .@realDonaldTrump @OANN no one is even close to #Trump\"\nMyrtle Beach, South Carolina \n#MakeAmericaGreatAgain #Trump2016 https://t.co/JlY5sbumpY\nA wonderful evening in South Carolina - big crowd, amazing energy!\n\"@PatSheldon10913: @realDonaldTrump had a great time in Myrtle Beach tonight.\"\nNew @OANN national poll released. Thank you America! #Trump2016 https://t.co/yopcngFzFv\nThank you for your nice words @MikeNeedham @Heritage for the nice words on @FoxNewsSunday with Chris Wallace. #FNS #Trump2016\nWhat is Frank VanderSloot getting for agreeing to back Marco Rubio? Last victim was Mitt Romney - see how that turned out.\n.@BradPaisley came up to see me. A really nice and talented guy. https://t.co/duJ7vXLGZw\n\"@cecki: Leave our candidate @realDonaldTrump alone! Do not embarrass yourselves further.\n\"@Maryland4T: @SmallBiz4Trump Keep up the good work! Americans of ALL kinds are rallying behind jlDonaldTrump to help #MakeAmericaGreatAgain\n\"@Nick95B: @realDonaldTrump I'll only vote for TRUMP! If eGOP screw things up I won't vote for ANY republicans; ANY https://t.co/mHyCIL9VpD\n\"@AnnCoulter: If you run anyone but Trump, Hillary wins. So Rubio, Christie, Jeb! & Kasich must hate the country. https://t.co/lExEBrwDT3\"\nWill be doing @seanhannity at 10 PM on @FoxNews.  As always with Sean, will be interesting!\nHeading to Myrtle Beach, South Carolina. Really big crowd—so much to talk about!\nRepublicans must stop relying on losers like @KarlRove if they want to start winning presidential elections. Be tough and get smart!\n\"@Good2bqueen67: .@realDonaldTrump @Sandikay60 I enjoyed the speech so much tonight, you were on point \u0001F446 Sir!\"  Thanks.\n\"@Sandikay60: @realDonaldTrump it was awesome! #Trumponly. Great crowd! Wonderful\"\n\"@Port3Star: @JDiamond1 @CNNPolitics You know he has great vision. The very best. Many people have told him so. Thousands of people!\"\n\"@JeffPage5: @realDonaldTrump @WSJ @GOP they're finally gettin the message, we're fed up & we're not going establishment.\n\"@David360NC: We have a voice with DonaldTrump, Let’s do our part & VOTE IN THE R PRIMARY 4 #Trump2016 #TeamTrump https://t.co/2xHujNNNFT\"\n\"@beingmesuzieeJ: @realDonaldTrump... You ROCKED IT AGAIN IN OHIO!!!! Come to Nebraska.. Please!! Trump 2016!!\" Thanks and I will!\nJust left Columbus rally of 14,000 people --- a far bigger crowd than even I expected! Unbelievable evening, incredible spirit in the arena!\n\"@iliveamongyou:  @BostonGlobe: Ben Carson advisers say he struggles with foreign policy https://t.co/phTAgT5qP6 https://t.co/044xgNYLth\"\n\"@DonnySmith557: @realDonaldTrump Everything Mr. Trump touches turns to gold, what a great negotiator! !!!!!\" Thanks.\nHeading for Ohio - really big crowd of amazing people! Much to talk about!\nGoing to Ohio, home of one of the worst presidential candidates in history--Kasich. Can't debate, loves #ObamaCare--dummy!\n.@WSJ reports that @GOP getting ready to treat me unfairly—big spending planned against me. That wasn’t the deal!\nVia @washingtonpost 9/18/01. I want an apology! Many people have tweeted that I am right! https://t.co/CpsMxs54qv https://t.co/wrDEhXJlvR\nWhen you do your Christmas shopping remember how disloyal @Macys was to the subject of illegal immigration. #BoycottMacys #DumpMacys\nHillary, there is nothing to laugh about- https://t.co/bkmWFZ9JI9\nGoing to Columbus, Ohio today for a tremendous rally of thousands. The silent majority is no longer silent!\n.@AP has one of the worst reporters in the business -- @JeffHorwitz wouldn’t know the truth if it hit him in the face.\n.@AP continues to do extremely dishonest reporting. Always looking for a hit to bring them back into relevancy—ain’t working!\n.@MatthewJDowd thank you for the nice comments recently, especially on @BarbaraJWalters. My family & I greatly appreciate your kind words.\nHillary Clinton is weak on illegal immigration, among many other things. She is strong on corruption - corruption is what she's best at!\n\"@ny_conservative:  @BarbMuenchen #CrippledAmerica is an excellent resource for the 2016 race #TeamTrump #Trump2016 #MakeAmericaGreatAgain\"\n\"@ktd101551: @CNNPolitics Trump gave a great speech in Ala. What's more important a protester? I wouldn't give these folks 1 sec of attn\"\n\"@jrpantiques: @realDonaldTrump @TheFix @pbump THE SCRIPT FOR A GREAT WORLD CHANGING LEADER TO ARISE HAS BEEN WRITTEN & IT WAS FOR MR. TRUMP\n\"@bloggerjulie: @FoxNews The reporter is the one who mentioned the national database FIRST and not DonaldTrump. Y not report HONEST NEWS?\"\n\"@MJP1370: @realDonaldTrump @TheFix @pbump We need Trump now! Obama isn't protecting Americans !!\"\n\"@TheFix: The Paris attacks have only made Donald Trump stronger https://t.co/F8vgxYNa5t https://t.co/Y3SevhrRp1\" Very interesting!\n\"@drewtheg:  Trump is the epitome of integrity, good spirit, forthright honesty... you pull no punches and call a spade a spade. diggin it!\"\n\"@jakub_lisa:  @HillaryClinton A Clinton Cannot be trusted!How many x's do we allow them to disgrace this country? #NoClintonInWHEverAgain\"\n\"@SeanSean252: @WayneDupreeShow @Rockprincess818 @CheriJacobus    https://t.co/5GUwhhtvyN\"\n\"@heiressarts: @realDonaldTrump By going after you, Jindal also lost the LA governor race! Politicians Beware.\nGreat poll numbers! Thank you!\n#MakeAmericaGreatAgain #Trump2016 https://t.co/51CRR6m5Eg\nWe better get tough with RADICAL ISLAMIC TERRORISTS, and get tough now, or the life and safety of our wonderful country will be in jeopardy!\n13 Syrian refugees were caught trying to get into the U.S. through the Southern Border. How many made it?  WE NEED THE WALL!\nGreat poll numbers all over and beating Hillary Clinton one on one. Thank you!\nBig new @ABC Poll to be announced at 9:00 A.M. on This Week with @GStephanopoulos. I will be interviewed on show!\n.@GStephanopoulos just announced that I am leading  BIG in the new @ABC Poll which will be shown on This Week at 9:00 A.M. I will be on show\nWill be interviewed on @foxandfriends at 8:00 A.M.\nI find that @Reuters is a far more professional operation than @AP.\n.ccolvinj @AP is one of the truly bad reporters---working for an organization that has totally lost its way. Stories are fictional garbage.\n\"@iliveamongyou: URGENT “@GOP…in an effort to destroy their own front runner.” #MakeAmericaGreatAgain https://t.co/HWABcAeu8z\"  I HIT BACK!\n\"@2timeslucky: @steph93065 @FoxNews Kimberly G. hosted Greta last nights& told the TRUTH about Trump! https://t.co/wwmKjAbIlR\"\n\"@TomLydon: What Financial Pros Can Learn from Donald Trump's Communication Style https://t.co/D5fG5cY25U @DanSondhelm\" Very nice, thanks!\n\"@boreed615: Donald Trump retakes lead in GOP race; Ted Cruz makes gains: poll: https://t.co/G8z5ek7emn # via AOL\"\n\"@Ma1973sk: Great family. Great interview @realDonaldTrump ! https://t.co/IFcjTwd5ey\"\n\"@marklevinshow: Well said https://t.co/Is4xshwUpg\"\n\"@WayneDupreeShow: \"It’s clear that Donald Trump was NOT even talking about a Muslim Database!\" https://t.co/3tLDZj2WGV\"\n\"@FortuneMagazine: Do successful CEOs sleep less than everyone else? https://t.co/SBkP1QZKEh https://t.co/15ZgyzSr1J\"\n\"@foxnation: Report: #DonaldTrump Heckler Convicted Of Attempting To Blow Up Marine Recruitment Center https://t.co/8p4yBnbEL5\"\n\"@politico: Palin on 2016: \"I think it would come down to Cruz and Trump!  https://t.co/jSNS5Yv7Pt | Getty https://t.co/y5wN0AhK0E\"\n\"@GStephanopoulos: I’ll talk to Donald Trump about his comments on Syrian refugees, and much more, Sunday on @ThisWeekABC.\"\n\"@THR: Trump's Wife, Children Open Up About GOP Candidate: \"There’s No One Else Like Him\" https://t.co/wOn9AwEyNk https://t.co/WXsq41nK17\"\n.@heytana, great job - we are all proud of you!\nThank you to all law enforcement agencies for a fabulous job!\n#LEO #LESM #Trump2016 https://t.co/SuH1jfOQR4\nThank you for a great afternoon Birmingham, Alabama! #Trump2016 #MakeAmericaGreatAgain https://t.co/FrOkqCzBoD\nIt's too bad so few people showed up to @bobvanderplaats Family Leader dinner. Next year I'll try & be there- and they'll have a huge crowd!\nThank you John Nolte for \nwonderful analysis & reporting.\nRumor has it - Pataki, Kasich, & Senator Lindsey Graham are dropping out of the race very soon. Hope it's not true, they're so easy to beat!\nSo nice when media properly polices media. Thank you @BreitbartNews. \nhttps://t.co/IGUh57zOJz\nA woman who got fired after two days of working with Scott Walker - a wacko - now trying to raise funds to fight me.\nHeading to Birmingham, Alabama, and a massive crowd of incredible people! 12 noon - will be wild.\nTo show you how politicians act, Bobby Jindal spent $1,000 to register in New Hampshire & dropped out the next day. Such a waste!\nWe're stuck with the worst mayor in the United States. Too bad, but New York City will survive!\nPeople are really liking my new book, \"Crippled America.\" Check it out!\n\"@tas0727: @realDonaldTrump Make America Great again vote Donald Trump\"\n\"@jaazee1: @CNN anchor's shocked that DonaldTrump's  comments resonate with GOP base will go apoplectic that he does with democrats too.\n\"@STATinc2015:  @BarbaraJWalters @ABC @MELANIATRUMP @IvankaTrump saw the interview tonight. Thought it was great. Can't wait till November.\"\n\"@thetylerjames9: @realDonaldTrump cannot be bought! Therefore he cannot be silenced!\"\n\"@RustyBlissUSA:  @realDonaldTrump we're ready to thwart the establishment attempts in the Buckeye State. #Trump2016 #TeamTrump\"\n\"@TLCastle: @realDonaldTrump Do you plan on making any campaign stops in West Virginia?\" YES, soon.\n\"@RenaSummersLtd: Watched @ABCNetwork special tonight! You have such amazing children. Lots to be proud of! Love your wife! Class Act!\"\n\"@michaelglassner: A GREAT DAY in South Carolina for DonaldTrump & #TeamTrump! #Trump2016 #MakeAmericaGreatAgain https://t.co/Re655JmhqJ\"\n\"@realkingrobbo:  @hotroddergirl You're the hero America needs! #Trump2016\"  Thank you, I only want to make America great again!\n\"@BornToBeGOP: @realDonaldTrump Your family is a better watch than the Kardashians by a mile!\" Cute!\n\"@hiddenspeed42: @AY4WEB  No pay or compensation to make our beautiful country again!! That's his promise to us!! We love u trump\"\n\"@TCash78: @realDonaldTrump @VincentKunicki @kimguilfoyle @FoxNews he will make America great again\n\"@realkingrobbo: @realDonaldTrump @Greg39529063 @ABC2020 @ABC @BarbaraJWalters the best man for the job!\" Thanks!\n\"@ClassySnobbb: @realDonaldTrump AMAZING interview. You and your family will be great role models for America!!!  #MakeAmericaGreatAgain\"\n\"@Greg39529063:  @ABC2020 @ABC @BarbaraJWalters Watching now! Great! Always true to his word and the USA! A real leader! So nice to hear!!!\"\n\"@hotroddergirl: @realDonaldTrump trump 20/20 shows just what hard work and good family can do. Blue collar with you.\"\n\"@VincentKunicki: @realDonaldTrump @kimguilfoyle @FoxNews Long live Donald Trump our next Ronald Reagan!!! God bless you we need you\" Nice!\nJoin us at 10pmE on @ABC2020 @ABC with @BarbaraJWalters! #MeetTheTrumps #ABC2020 https://t.co/vMeLS00GnJ\n#ICYMI: I joined #OnTheRecord with @kimguilfoyle on @FoxNews this evening. #Trump2016 #MakeAmericaGreatAgain\nhttps://t.co/FlJutjpR35\n\"@2timeslucky:  No one can take @realDonaldTrump down because it is the WILL of the people for him to win!\n\"@JamesPWilson1: @realDonaldTrump When you become president, we will avenge all of the innocents who isis killed\"\n\"@mia_liner: @GSRPygmies  @realDonaldTrump Trump supporters are a very loyal breed! We see the truth, only Trump can fix this mess we are in\nLooking forward to watching the legendary @BarbaraJWalters interview my family (and me) tonight on @ABC at 10:00. Many things to talk about!\n\"@smith_jere: @realDonaldTrump You are amazing Mr. Trump! Thank you!!!\"  So nice.\nTune into the legendary @BarbaraJWalters at 10pmE on\n@ABC2020 tonight. #MeetTheTrumps for a full hour @ABC #ABC2020! https://t.co/exF5aUhrEW\n.@washingtonpost  @BretBaier  Please thank Charles Lane for his new found confidence. He has made a very good bet!\n\"@The2ndguardsUS: @realDonaldTrump ROLL TIDE\"\n\"@samsellars: @realDonaldTrump North Carolina. Come on down.\"  Will be there very soon!\n\"@meganweaver321: @realDonaldTrump Alabama loves you\"  Great!\n\"@Unicurls: @realDonaldTrump I'll be in attendance. #YUGE #MakeAmericaGreatAgain #bamaforTrump\"  Nice!\n\"@GeraldSoelz: Awesome news. Keep your focus on the issues. You just might get more blue collar Democrats to vote for you than Reagan.\"\n.@Gracematters Thank you, a very wise bet! Best wishes.\nJust got back from South Carolina. Going to Alabama tomorrow!\n.@HillaryClinton is weak on illegal immigration & totally incompetent as a manager and leader - no strength or stamina to be #POTUS!\nThe legendary @BarbaraJWalters interviews my family and me tonight at 10:00 on @ABC2020 . Don't miss it! https://t.co/JHTF7f9aTo\n.@BilldeBlasio should focus on running #NYC & all of the problems that he has caused with his ineptitude, & not be so focused on me!\nCan you believe the worst Mayor in the U.S., & probably the worst Mayor in the history of #NYC, @BilldeBlasio, just called me a blow hard!\nThank you for a great afternoon, South Carolina! See you next Tuesday! #MakeAmericaGreatAgain #Trump2016 https://t.co/kWWMlmy7gQ\nI didn't suggest a database-a reporter did. We must defeat Islamic terrorism & have surveillance, including a watch list, to protect America\nUnder our President, ISIS is gaining great strength- https://t.co/28VsmV8xng\nMy family has the honor of being interviewed for a full hour by the legendary @BarbaraJWalters tonight @ABC - 10pmE. https://t.co/cm4fv1Ye9L\n.@mkhammer, a Fox contributor, isn't smart enough to know what is going on at the border. @TheJuanWilliams made the point far better!\nGoing to South Carolina now, great place, SRO crowd. Iowa was amazing yesterday!\nThe media must denigrate ISIS at all levels or youth will continue to be drawn to it. These are low level degenerates, NOT masterminds!\nThe media must immediately stop calling ISIS leaders \"MASTERMINDS.\" Call them instead thugs and losers. Young people must not go into ISIS!\nA wonderful afternoon in Iowa! Great people! Heading now to Florida - tomorrow, South Carolina! #MakeAmericaGreatAgain #Trump2016\nA great evening in Iowa! Thank you Des Moines Area Community College for a great forum! #Trump2016 #IAForums https://t.co/092t2VrMEw\nJohn Kasich was managing director of Lehman Brothers when it crashed, bringing down the world and ruining people's lives. A total failure!\nOnce John Kasich announced he was running for president, and opened his mouth, people realized he was a complete & total dud!\nJohn Kasich fell right into President Obama’s trap on ObamaCare, and the people of Ohio are suffering for it. Shame!\nDoesn’t help Kasich to do negative ads on me because he still has to go through everyone else  - he’s almost last.\nJohn Kasich ad guy wanted to work for me, but his proposal was a rip off – I said NO! Now ripping Kasich.\nI loved beating John Kasich in the debates, but it was easy—he came in dead last!\nKasich has already spent $6 million on ads in New Hampshire and his numbers have gone down. People from NH are smart!\nWatch Kasich squirm --- if he is not truthful in his negative ads I will sue him just for fun!\nI want to do negative ads on John Kasich, but he is so irrelevant to the race that I don’t want to waste my money.\nJohn Kasich, despite being Governor of Ohio, is losing to me in the Ohio polls. Pathetic!\nJohn Kasich should focus his special interest money on building up his failed image, not negative ads on me.\nGovernor Kasich, whose failed campaign & debating skills have brought him way down in the polls, is going to spend $2.5 million against me.\nThe legendary Barbara Walters interviews Melania Trump and me on a special this Friday night at 10:00 on ABC. Don't miss it!\nThe legendary Barbara Walters interviews Melania Trump and me on a special this Friday night at 10:00 on ABC. Don't miss it!\nThank you Worcester, Massachusetts!#MakeAmericaGreatAgain #Trump2016 https://t.co/D6QinyBLW6 https://t.co/sZDJr3Tkd8\nJust the beginning & it is going to get worse. Rates & deductibles are so high nobody is going to be able to use it. https://t.co/iwqLODke50\nHas anybody read this story about Marco Rubio - devastating! \nhttps://t.co/xeAB74nndD\nI told you! Premiums are soaring! #RepealObamacare #Trump2016 \nhttps://t.co/Ey50582uND\nThank you (Chris) @TheFix. I have great respect for professionals that are willing to report so honestly & fairly. https://t.co/hT9v8LEhSe\n#MakeAmericaGreatAgain #Trump2016 https://t.co/Zqd1RWW2C5\nThank you for your support! Together we can #MakeAmericaGreatAgain! #Trump2016 https://t.co/qni36GI6fV\nThe POLICE in Paris did a fantastic job. Very brave - not easy!\nA great review of my Aberdeen course by prestigious @GolfMonthly.  Some say greatest ever built. @TrumpScotland  https://t.co/zYcraTAwzs\nEveryone is now saying how right I was with illegal immigration & the wall. After Paris, they’re all on the bandwagon.\nWe need new leadership- fast! https://t.co/WCLMe1JKvx\nI skipped a speech given years ago at Mar-a-Lago by dopey @GeorgeWill because he’s BORING—he never forgot!\nDopey @GeorgeWill, a big proponent of the Iraq War and other catastrophes, doesn’t like me very much. That means I win!\nBroken down political pundit @GeorgeWill, who is wrong almost all of the time, should be thrown off @FoxNews. Boring and totally biased!\nEight Syrians were just caught on the southern border trying to get into the U.S. ISIS maybe? I told you so. WE NEED A BIG & BEAUTIFUL WALL!\nBen Carson is being severely criticized for being incapable of understanding foreign policy be one of his top consultants. Not good!\n\"@FoxNews New Hampshire Poll: @realDonaldTrump 'Rules GOP Race in New Hampshire.' Trump 27, Rubio 13, Cruz 11, Bush 9, Carson 9, & Kasich 7\"\nVia Politico: \"Trump Extends Lead in New Hampshire Poll\" https://t.co/PaJOAi3rGa\nVery nice article from Daily Mail  https://t.co/SIxmYzPXv1\nGreat New Poll  https://t.co/178k1ERFqT\nHow does Ben Carson survive this problem – really big. Similar story on front page of New York Times.\n  https://t.co/y9fqUUYRnD\n\"@KatrinaPierson: #MakeAmericaGreatAgain #Trump2016 https://t.co/Aja00L81uf\"  Katrina, great job on @FoxNews last night!\nThank you for all of your support! Let's #MakeAmericaGreatAgain! #Trump2016 https://t.co/G7o6b0cfZz\nThe great Barbara Walters interviews Melania Trump and me on a Special Friday night at 10:00 on ABC.… https://t.co/28q3QgfIbM\n\"@Ashevillelaura: @realDonaldTrump @seanhannity @FoxNews Obama has no credibility on terrorist threats & ISIS. Trump best to protect us\"\nI will be interviewed by  @seanhannity tonight at 10:00 on @FoxNews . Much, much, much to talk about!\nMelania and I just had interview with the legendary @BarbaraJWalters. Watch #abc2020 this Friday. Tonight we talk ISIS @WNTonight\n.@AP is doing very badly. I can say from experience their reporting is terrible & highly inaccurate. Sadly, they are now irrelevant!\nOne of the saddest things in journalism is what happened to the formerly great @AP. They have lost their way and are no longer credible.\nWhat is our President doing? https://t.co/8p0A80kaaX\n\"GOP Voters Trust Donald Trump to Keep Our Country Safe\" https://t.co/TWslpJPQG0\nRefugees from Syria are now pouring into our great country. Who knows who they are - some could be ISIS. Is our president insane?\nI, along with almost everyone else, have so little confidence in President Obama. He has a horrible attitude-a man who is resigned to defeat\nSo many great polls like Reuters - big leads everywhere. New Hampshire really special! We will win big and MAKE AMERICA GREAT AGAIN!\nThank you Tennessee! #Trump2016 https://t.co/RNZ3hvbVvM\nJust received a copy of @SarahPalinUSA new book -- a great read! Sarah is a terrific person.\nGreat poll numbers out of @UMassAmherst. Thank you! #Trump2016 #MakeAmericaGreatAgain \nhttps://t.co/ePlQRgjMYw\nJust leaving Knoxville, TN --- what a crowd, what amazing people! #Trump2016 #MakeAmericaGreatAgain https://t.co/5qr5deOlEl\nJust landing in Knoxville, Tennessee! Massive crowd expected! Will all have a great time, despite serious subject matter.\nI agree! The headline says it all. #Trump2016 #MakeAmericaGreatAgain\nhttps://t.co/TWslpJPQG0\nDiscussing #SyrianRefugees with @EricBolling on @FoxNews back on 10/3/2015. #ISIS https://t.co/rUX57o2BzM\nWill be landing in Knoxville, Tennessee shortly - tremendous crowd expected. It's all very simple, we want to #MakeAmericaGreatAgain!\nRepublicans must stop listening to dopes like @KarlRove who still insists Mitt Romney won the last election. Think big & think strong!\nWow, @Macys shares are down more than 40% this year. I never knew my ties & shirts not being sold there would have such a big impact!\nInteresting article from highly respected Wayne Allyn Root https://t.co/1esS0QV46V\nRemember, I was the one who said attack the oil (ISIS source of wealth) a long time ago. Everyone scoffed, now they're attacking the oil.\n\"@SarahPalinUSA: From St. Patrick's Cathedral, NYC: blessings, prayers and heartfelt concern for those in Paris.\n\"@StreetR77:  @JohnLegere @TMobile didn't know he was CEO of tmobile, I have T-Mobile, it's pathetic, dropped calls, no service.\"\nTom Brady just did it again. He is not only a great guy, he is, without question, the BEST quarterback!\nPresident Obama just told President Putin how important the Russian air strikes against ISIS have been. I TOLD YOU SO!\n.@JohnLegere  @TMobile  John, focus on running your company, I think the service is terrible! Try hiring some good managers.\n\"@peg4cats: @TerryLambert201 @realDonaldTrump you are so right. I only trust Trump to be tough on immigration\"\n\"@760_831: @DanSaltsman @realDonaldTrump @MichaelCohen212 @IvankaTrump  I have faith he will win and save America\"\n\"@760_831: @DanSaltsman @realDonaldTrump @MichaelCohen212 @IvankaTrump i have faith he will win and save America\"\n\"@Parker_Votes: We finally have a voice with  Let’s do our part & VOTE IN THE R PRIMARY, 4 #Trump2016 #TrumpArmy https://t.co/fIl3hXOERS\"\n\"@syoka68: Reading the comments of the leftists on here makes me nauseated. We SO NEED YOU, MR. TRUMP! Make America Great Again\"\n\"@davenorthYV: Does anybody ever realize that HillaryClinton doesn't make eye contact with anyone, even the camera. That's a sign of lying\"\n\"@RealReagan0503: If you missed it, here is the most popular link among people I follow https://t.co/lOppBvYMRy by @realDonaldTrump\"\n\"@Hturne:  @VanityFair  You're spot on! He tries 2b an intellectual elitist.The truth: he has a low IQ, no imagination, no creativity\"\nGlad to see that @RondaRousey lost her championship fight last night. Was soundly beaten - not a nice person!\nI have watched sloppy Graydon Carter fail and close Spy Magazine and now am watching him fail at @VanityFair Magazine. He is a total loser!\n.@VanityFair Magazine is doing really poorly. It has gotten worse and worse over the years, and has lost almost all of it's former allure!\n\"@USATrumpDiva: Donald Trump surges in poll among likely Republican voters https://t.co/uZ5nZUuqKq\"\n\"@mholsbunes: Donald Trump says tough gun control laws in Paris contributed to tragedy: https://t.co/ifVJmLw2Sx Presidential candidate??\"\n\"@thewatcher23579: One of Paris terrorist came as Syrian refugee. Donald Trump is right again. BOMB THEIR OIL - TAKE AWAY THEIR FUNDING\"\nWe need strong, tough and brilliant leadership now more than ever!  MAKE AMERICA GREAT AGAIN!\nI had a great time in Texas yesterday. A tremendous crowd of wonderful and enthusiastic people. Will be back soon!\n.@realDonaldTrump on ISIS&OIL FIELDS! Saying it for years! @AndersonCooper, you should acknowledge this! #Trump2016 https://t.co/ocoB9WlP7R\nWhen will President Obama issue the words RADICAL ISLAMIC TERRORISM? He  can't say it, and unless he will,  the problem will not be solved!\n\"@mnrosrnr: @realDonaldTrump the best book I've read in years, Trump is right on every issue and has the best ideas, a true economic genius\"\n\"@TejadaDennes: @realDonaldTrump Crippled America is an incredible book! People need to read truth. #HispanicsForTrump #DemocratsForTrump\"\n\"@tasteofaz: Poll: Trump Surges to 42% Nationally; ‘Bad News for Marco Rubio’ https://t.co/9IrLrlpjfM @realdonaldtrump\"  Great news!\nI think everyone will like my new and very successful book, Crippled America. Go get it and let me know what you think!\nWow, Bernie Sanders just admitted that the real unemployment rate is 10% (it is actually over 20%) and for  African American youth - 51%.\nHillary and Sanders are not doing well, but what is the failed former Mayor of Baltimore doing on that stage? O'Malley is a clown.\nWhy won't President Obama use the term Islamic Terrorism? Isn't it now, after all of this time and so much death, about time!\n\"@Oliviaand24: @realDonaldTrump TrumpOn America needs you in office Now! #MakeAmericaGreatAgain #Trump2016\"\n\"@redletter99: @realDonaldTrump I absolutely love this, can't wait till u debate Clinton\"\n\"@TomRichey: Enough of these party debates. What I wanna see is a @SenSanders vs @realDonaldTrump one on one debate!\" That would be easy!\n\"@jaslohr_: @realDonaldTrump are you watching this circus?!? #DemDebate what a joke! #Trump2016\"\n\"@jcooper75: #DemDebate this debate stinks. CBS News, major fail. @realDonaldTrump\"\nGreat news out of New Hampshire! DonaldTrump is pulling away from the pack w/ 2nd is 17% behind him! #Trump2016 https://t.co/hASWradHMe\"\n\"@MikeOG_: @realDonaldTrump was right! close the borders! #Trump2016\"\n\"@Gman0623: @realDonaldTrump @HaloOneForTrump @FoxNews @CNN @GOP I love you Trump! MAKE AMERICA GREAT AGAIN!\"\n\"@shawnlivinlife: I still haven't heard the WH say the words islamic terrorist. Call it what it is. #Trump2016 can't happen fast enough.\n\"@HaloOneForTrump: @realDonaldTrump has what MONEY CAN'T BUY: VISION & LOYAL & MOTIVATED SUPPORT! #veterans #military  @foxnews @cnn @GOP\"\n\"@jrpantiques: @realDonaldTrump @ABCinSC @KatrinaPierson THE WORLD IS PLAYING EVERYTHING RIGHT FOR TRUMP! EVERY DAY HIS POINTS ARE PROVEN\"\n\"@dlt912: @realDonaldTrump you definitely have my vote!\u0001F44D\u0001F3FB\"\n\"@ABCinSC: @realDonaldTrump - a tough man for a tough job in tough times. Gloves off, game on! https://t.co/l2ea1ZJ5Ps\"\n\"@Mario_Posillico: @realDonaldTrump you need to win for not just America, but for humanity.\"\nWe need much tougher, much smarter leadership - and we need it NOW!\nPresident Obama said \"ISIL continues to shrink\" in an interview just hours before the horrible attack in Paris. He is just so bad! CHANGE.\nMy prayers are with the victims and hostages in the horrible Paris attacks. May God be with you all.\nBoy is this guy @ShepNewsTeam tough on me. So totally biased. As a reporter, he should be ashamed of himself! #Trump2016\nThey laughed at me when I said to bomb the ISIS controlled oil fields. Now they are not laughing and doing what I said. #Trump2016\nThank you @JakeTapper for giving me credit for my vision on bombing the oil fields. Should have been done long ago. #Trump2016\nGreat honor to be inducted into the NJ Boxing Hall of Fame last night. Thank you! Timing could not have been better! https://t.co/IU6peXoVL2\n.@seanhannity  Carly, whose campaign is dead, is making false statements about me in order to salvage hope! Sad.\n.@CarlyFiorina had to inject herself into my factual statements concerning Ben Carson in order to breathe life into her failing campaign!\n.@CarlyFiorina I only said I was on @60Minutes four weeks ago with Putin—never said I was in Green Room. Separate pieces—great ratings!\n.@CarlyFiorina  Ben Carson said in his own book that he has a pathological temper & pathological disease. I didn’t say it, he did. Apology?\n.@CarlyFiorina Carly—I did graduate from Wharton and did very well. Who is your fact checker? Will you apologize?\n.@CarlyFiorina Carly, not just you, I also told Gov. Kasich to “let Jeb talk, give him a chance” because Kasich was constantly cutting in.\n\"@DRUDGE_REPORT: REUTERS 5-DAY ROLLING POLL: TRUMP 34%, CARSON 19.6%, RUBIO 9.7%, CRUZ 7.7%...\" Thank you - a great honor!\nHappy Friday the 13th https://t.co/Br6AUzgGoi\nThank you Iowa! I appreciate all of your support @IowaCentral & @ethanolbyPOET this evening! #Trump2016 #IACaucus https://t.co/mJzLcXjtpf\nFirst candidate in Virginia with over 16,000 validated signatures for the ballot. An honor - thank you! #Trump2016 #MakeAmericaGreatAgain\nI will be on @OutFrontCNN with @ErinBurnett at 7PM. Tune in!\n#Trump2016\nI will be on with @BretBaier tonight at 6PM. #Trump2016\nMacy’s was very disloyal to me bc of my strong stance on illegal immigration. Their stock has crashed! #BoycottMacys https://t.co/WsvZtwZbBf\nThank you @Forbes for showing the @WSJ was wrong. So dishonest! https://t.co/wOjEXdEkNg\nFrom 2% to 27% in Texas - quite a jump into first place!\nWow, pres. candidate Ben Carson, who is very weak on illegal Immigration, just said  he likes amnesty and a pathway to citizenship.\nTotal fool @KarlRove is part of the Republican Establishment problem. An all talk, no action dummy! \n  https://t.co/CxLHA87hS1\n.@WSJ and dopey Karl Rove made a mistake and purposely mischaracterized my statement on the terrible TPP deal.\nhttps://t.co/t9JZGIUAYl\nWhy does the failing @WSJ write a false editorial about me and let dummy @KarlRove make the same mistake in the same edition of the paper?\n.@KarlRove is a biased dope who wrote falsely about me re China and TPP. This moron wasted $430 million on political campaigns and lost 100%\nWe, as a country, either have borders or we don't. IF WE DON'T HAVE BORDERS, WE DON'T HAVE A COUNTRY!\nWhy wouldn't the @WSJ call for comment or clarification before writing an editorial which is so totally wrong. No wonder it is doing poorly!\nWhen and how are the dummies at the @WSJ going to apologize to me for their totally incorrect Editorial on me. I want \"smart\" trade deals.\nThe @WSJ Editorial Board is so wrong, so often. They got info from an incorrect story in another pub. Why not watch and listen to debate.\n.@WSJ Editorial Board should review my debate statement re China and T.P.P. and apologize. China not part but will get their way in later.\nToday's @WSJ Editorial is WRONG again. I know that China is not in the new T.P.P. trade deal but would come in latter through a back door.\nI will be interviewed on @MariaBartiromo @FoxBusiness at 7:30\nAll seven on-line polls, including Drudge and Time, with thousands of respondents, said I won the debate. @krauthammer said I was \"so, so.\"\n\"@ellenEspence: I'm not convinced that any candidate other than @realDonaldTrump is committed to securing our borders. #VoteTrump2016\"\n\"@BornToBeGOP: @realDonaldTrump You will bring out more voters to vote for you than we've seen in any election!\" Great.\n\"@frankieguy85: This 92-Year-Old Woman Registered to Vote Just to Cast a Ballot for Trump https://t.co/6REhiGankb\"\n\"@Christianlord12:  RUBIO sat back during debate on Immigration hoping no 1 would ask him about Gang of 8. https://t.co/sevUe7bikR\"\nWill be interviewed by @oreillyfactor tonight at 8 PM.\nI will be on @marklevinshow at 8PM tonight. Tune in!\n.@gerardtbaker Gerard—wonderful job last night as moderator of the debate. I told many, “really smart and elegant.”\nI never said that China was in the bad TPP trade deal but that China would come in the back door at a later date. @CNN @FoxBusiness\nJust returned home from the great state of New Hampshire. Have made so many friends there--special place!\nHappy Veterans Day. To those who have served, thank you for your special work.\nThank you @Morning_Joe & @morningmika -- a great show! #Trump2016 #MakeAmericaGreatAgain https://t.co/teauhiQd3i\nLoved doing the debate...won Drudge and all on-line polls! Amazing evening, moderators did an outstanding job.\nWill be on @Morning_Joe live from New Hampshire - 7:00 A.M. Talking about the debate and more!\n\"@Rmac747:  Keep up the good work, Donald! Hello from Vancouver where the new & amazing Trump Tower and Hotel almost complete!\nI will be on @Morning_Joe live from New Hampshire tomorrow at 7am. #Trump2016 #MakeAmericaGreatAgain\nPeople Magazine: \"Donald Trump Was Right: He Gave SNL Its Best Ratings in Nearly 4 Years--Plus, What You Didn't See\" https://t.co/Bh7K8l0bIO\nThank you South Carolina! #Trump2016 https://t.co/DDK89IcmxX\nThank you New Jersey! #Trump2016 https://t.co/YUIBEP7JcZ\nGo out and buy CRIPPLED AMERICA: How to Make America Great Again. Doing really well. Great Thanksgiving or Christmas present!\n\"@ray_aub:  Funny all the real polls have @realDonaldTrump way ahead.\n\"@jspence80: @jspence80: Like him or hate him @realDonaldTrump runs a brilliant campaign for #POTUS2016 !\"  Thank you!\n\"@curtismuddog: @limbaugh @seanhannity @realDonaldTrump is Hillary's worst nightmare! Just take a look at Illinois rally last night.\"\n\"@JezzaK: If the Trump Hotel Honolulu is any reflection how you would be as President then I think the U.S will be in good hands\" Thank you!\nI will be interviewed by @GStephanopoulos on @GMA at 7:00 A.M. There is much to talk about!\n\"@foxnation: #DonaldTrump Gives SNL Its Biggest Ratings In Years https://t.co/zMnZoMamu9\"\n\"@piersmorgan: Why @realdonaldtrump nailed SNL. My new column. https://t.co/2mIMzNRMOc\"\n\"@USATODAY: Donald Trump lifted #SNL to its best ratings since 2012.  https://t.co/h2jQI9PpvP (Photo: NBC) https://t.co/YLlXQO9mtf\"\n\"@foxandfriends:  Trump helps ‘SNL’ blow roof off the ratings, most viewers since 2012 https://t.co/Z0pCZYXxcp https://t.co/a28U65mge6\"\n\"@Fox411: DonaldTrump 'Saturday Night Live' episode garners highest viewership since 2012 https://t.co/AFMcaRWGm2 https://t.co/n5Zw20H9zp\"\n\"@TODAYshow: Trump's #SNL show delivered the biggest overnight ratings since early 2012: https://t.co/JA9Tn6MgdT https://t.co/c27GxQjrRz\"\n\"@BreitbartNews: Ratings were HUGE for @realDonaldTrump's appearance on Saturday Night Live -> https://t.co/wdQXRq36yF\"\n\"@JimmyGould07: Only one man has the appeal, nerve, commitment, ideas, & motivation. He's the icon, business tycoon, and lovable DonaldTrump\n\"@burgettn: @AB1132 @realDonaldTrump it's the only way we can make America great again.\"\n\"@kniala: @realDonaldTrump Exactly. Marco has no accomplishments.\"\n\"@RM1792: @realDonaldTrump Man, I love the where you spoke the truth about Hillary. We have waited so long for someone to do this.\"\n\"@freedoms411: @wakeuppeopleSOS @mitchellvii  @CNN @ABC @CBS It shouldn't be ignored, and I doubt it will be, Carson will drop in polls.\"\n\"@teed_chris: @Loyal2Trump2016 @TrumpAlabama  @FoxNews Look when you try to kill Your mom,that's it for me ,no walking on water\"\n\"@KazmierskiR: @realDonaldTrump @DonaldJTrumpJr OuTsTaNdInG!!! Is obvious that Jr. has much of his father's 'charisma' and intelligence!\"\n#MakeAmericaGreatAgain #Trump2016 https://t.co/arJERjlYCO\nThank you to @NYPost's Robert Rorke for the really nice review of #SNL. So many enjoyed it - very gratifying! https://t.co/TT29WgelUT\nMarco Rubio is totally weak on illegal immigration & in favor of easy amnesty. A lightweight choker - bad for #USA!\nMarco Rubio couldn't even respond properly to President Obama's State of the Union Speech without pouring sweat & chugging water. He choked!\nMarco Rubio is a total lightweight who I wouldn’t hire to run one of my smaller companies - a highly overrated politician!\nA great evening in Springfield, Illinois. Thank you for all of the support! #Trump2016 https://t.co/mqOfuI08PX\nGreat job on @Greta @DonaldJTrumpJr. Nobody could have done it better!\nThanks Piers. Greatly appreciated. @piersmorgan  https://t.co/2mIMzNRMOc\n.@CNN  should listen. Ana Navarro has no talent, no TV persona, and works for Bush—a total conflict of interest.  https://t.co/mynTMrdTE9\n.@Betsy_McCaughey Thanks so much. Really appreciate your comments.  I will help the veterans like no one else.   https://t.co/2iK0mWpuJx\n\"@dlustv: Trump SNL Episode Generates Highest Ratings Since 2012: At the very least, Donald Trump is making Sat... https://t.co/sNQZv8YPaO\"\nThank you to all of those who gave me such wonderful reviews for my performance on @nbcsnl Saturday Night Live. Best ratings in 4 years!\n\"@TradingStreetCo:Donald Trump Is Ratings ‘Gold’ For SNL: Donald Trump Is Ratings ‘Gold’ For SNL... https://t.co/leEPs9OoAe  @FoxNews  @CNN\n\"@Variety: Ratings: DonaldTrump lifted #SNL to a near four-year high. https://t.co/DDhsj9SZ03 https://t.co/jFYaKx2WYW\" TRUMP RATINGS GOLD!\n\"@Watchman4the1: Chuck Schumer: Sen Marco Rubio Is “Totally Committed To Obama’s Immigration Agenda” https://t.co/yieqFMRxwH DonaldTrump\n\"@salyboy3: @realDonaldTrump great job on SNL mr trump, funny funny.\"  Thanks.\n\"@WineChics: Trump Winery: https://t.co/JBFhqq2OGt via @WineChics Always an amazing experience at Trump Winery​ Beautiful fall foliage\n\"@mcjeff42: @realDonaldTrump you made SNL great again\"  @nbcsnl\n\"@SpecialKMB1969: @nbcsnl  @realDonaldTrump was hilarious ty we so enjoyed it! #TrumpTrainSNL #TrumpOnSNL #MakeAmericaGreatAgain\"\n\"@MyPresidentme: @EricShawnonFox That's because people are interested in you, & you've got a great sense of humor, unlike Hillary #Trump2016\n\"@tegodreaux: @realDonaldTrump @EricShawnonFox HUUUUUGE\"\n\"@EmitteLucemTuam: @realDonaldTrump @EricShawnonFox Great job Donald! Good luck from Canada!\"\n\"@coltsfan322: @realDonaldTrump @EricShawnonFox https://t.co/bO63wm27qE\"\n.@EricShawnonFox Highest rated Saturday Night Live in four years. 47% higher than their opening night with Hillary & Miley Cyrus. Nice words\nTelevision ratings for @nbcsnl Saturday Night Live just came out and they were great - the best since 2011. Very few protesters!\n\"@CleopattraUSA: @realDonaldTrump @nbcsnl You've got it going on!!! Nothing is boring or low energy about you. #EverybodyRockW/TrumpNow #SNL\nAt 10:30 I will be interviewed on both @meetthepress by @chucktodd and @CBSNews Face The Nation by John Dickerson. This after long evening!\nI will be interviewed by  @GStephanopoulos on @ABC   at 10:00 A.M.\n.@CNN  Will be interviewed by Jake Tapper at 9:00 A.M. Enjoy.\n\"@HillsGypsydad05:  @foxandfriends Awesome time on Saturday Night Live Mr. Trump! Thanks for being YOU! #MakeAmericaGreatAgain\"  Thank you!\n\"@justintupper: @realDonaldTrump You are a machine. Success leaves clues. #MakeAmericaGreatAgain\"\n.@nbcsnl - So much fun last night!\n\"@nbcsnl: What a show. Thanks for watching, everyone! #SNL https://t.co/10fmssLyDE\"\n\"@mcjeff42: @realDonaldTrump you made SNL great again\"\n\"@EEGRC98: @realDonaldTrump I am Hispanic - I am with you\"\n\"@syoka68: @realDonaldTrump Trump rocked SNL!\"\n\"@ccakul: @realDonaldTrump it was a great show!\"\n\"@PizzaPartyBen: @realDonaldTrump we need you elected tomorrow!\"\n\"@jackmarchione: @realDonaldTrump Loved the show!\"\n\"@wakeupfla: Please stand up for American Hispanic families and fight illegal immigration it is destroying USA! https://t.co/AKZO4lTnLj\"\n\"@ChristineMMoran: @realDonaldTrump great show !!! https://t.co/gcvaTeo4lk\"\n\"@redletter99: @realDonaldTrump thanks donald great show,when r u coming back to massachusetts?\" Very soon!\n\"@David360NC: We finally have a voice with   Let’s do our part & VOTE IN THE R PRIMARY 4 #Trump2016 #TrumpArmy https://t.co/ri0ORHBefU\"\n\"@martydrinksbeer: @realDonaldTrump It was FANTASTIC!!\"\n\"@b_ranzetta: The books great @realDonaldTrump #CrippledAmerica https://t.co/SIQSKhZa9s\"\n\"@PearlsPolkaDots: @realDonaldTrump Loved the show! Best #SNL in years! #TrumpTrainSNL\"\nWill be on @foxandfriends at 8:00 A.M.\nAmazing evening at Saturday Night Live!\nI am at the Saturday Night Live Studio - electricity all over the place. We will be doing a \"tweeting\" skit, so stay tuned!\n\"@sherrysue66: I am working a #12HR #AMERICAN SHIFT BUT WILL STAY UP 2 WATCH! I COULD USE A SATURDAY NIGHT LIVE LAUGH! #WE♡U. Nice.\n\"@jak00seven: If you like how @HillaryClinton handled #Benghazi, then you'll just ♥ her as Commander-in-Chief  #MakeAmericaGreatAgain\"\n\"@Waxking911: @CBSNews @realDonaldTrump  https://t.co/3r0jabQKzi\"\n\"@BornToBeGOP: @realDonaldTrump You want them here legally and they want to be here legally!\"\n\"@AmesMoreno: @DesignerDeb3 @garyinlv01 @sueinwny @megynkelly @realDonaldTrump https://t.co/mGgGuxnYiG\"  Wow Marco, is this true?\n\"@BMW_e38forever: @realDonaldTrump so let it be written, so lets get him elected in a landslide victory in 2016! https://t.co/V6fXXEFSvD\"\n\"@RealCinders2: @realDonaldTrump use SNL to tell Hispanics you are for them , you want them to have jobs and be here legally\" Great idea!\n\"@Albusinvogue: @Sia is performing, DonaldTrump is hosting. Tonight's #saturdaynightlive is going to be legendary. https://t.co/hMB6OreNh9\"\n\"@nbcsnl: From the last time Donald Trump hosted #SNL — The Boardroom Band. https://t.co/dL7y4dCWhL https://t.co/apGm3gKNdD\"\n\"@nbcsnl: Backstage with Trump. #SNL https://t.co/8CTmfAnyro\"\n\"@nbcsnl: Everyone loves @Sia’s new look. #SNL https://t.co/oqsASGtwpb\"\n\"@nbcsnl: Cecily also has a Trump impression. https://t.co/rlMwEqXFG3 #SNL https://t.co/Kk1JFO7RDC\"\n\"@nbcsnl: See you at Rockefeller Center. #SNL https://t.co/C4Kx5qId6M\"\n\"@nbcsnl: We're live from Studio 8H tonight. #SNL https://t.co/Uiq9llzwEC\"\n\"@tazz53098: @realDonaldTrump can't wait to watch. #trump for president #saturday night live\"\n\"@keksec_org: @realDonaldTrump I haven't seen anyone carry themselves so Presidential since Reagan. #MakeAmericaGreatAgain\" Great!\nThey are saying that tickets to tonight's Saturday Night Live are the hardest to get in the history of this great show! Off to a good start!\n\"@HouseCracka: Donald Trump is going to win the Presidency. Get on board the #TrumpTrain its going to be #YUGE\"  Thanks.\n\"@Live5News: Live from New York, Donald Trump will soon be hosting 'SNL': https://t.co/LAIUCTCxGb\" Frazier, enjoy the show and best wishes!\n\"@SocialInNewYork: We unearthed Donald Trump's Vine account from 2013 and it's incredible https://t.co/UVMusN4Bmv\" Thank you.\nSaturday Night Live has some incredible things in store tonight. The great thing about playing myself is that it will be authentic! Enjoy\n.@RobertGBeckel Please thank your brother for his nice words on television. Seems like a great guy and character! @CNN\n\"@essygalloway: @realDonaldTrump @nbcsnl @Sia  I can't wait to watch snl tomorrow.\" A really big show!\nOne of the dumbest political pundits on television is Chris Stirewalt of @FoxNews. Wrong facts - check Fox debate rankings, Trump #1. Dope!\n\"@Bubbachitchat1: THIS IS WHY THE POLLS ARE WRONG! @Hanan_Khan2: I am a lifelong democrat. And I will be voting trump! #democratsfortrump\"\"\n\"@nbcsnl: One more day! Donald Trump hosts #SNL with @Sia tomorrow. https://t.co/MMRYVpPpKu https://t.co/ENx4acClxg\" Will be a wild night!\nWould be nice if @jmartNYT learned how to read the polls before writing his next story. Probably done on purpose, but not good reporting!\n\"@FBeadon: @realDonaldTrump don't let the Keystone Pipeline die. The US needs to be good neighbors with Canada, and energy independent.\"\n\"@PhinsDiehard: @CNN  Only Donald Trump can #MakeAmericaGreatAgain\" Thank you!\nWill be on @oreillyfactor tonight. Signing a copy of Crippled America for Bill! https://t.co/AgYUvlCU1u\nSo sad that Obama rejected Keystone Pipeline. Thousands of jobs, good for the environment, no downside!\nHappy Birthday to the great @BillyGraham. He's done so many wonderful things, not the least of which is his fantastic family. I love Billy!\n\"@swargcoming:  @AnnCoulter @rushlimbaugh @greta @OANN @FoxNews IS CARSON HALLUCINATING? NOW LIES ABOUT WESTPOINT? https://t.co/lvv0MRfgtH\"\n\"@bob_forbes2: DonaldTrump has built a lifetime reputation of doing what he says he will do. He keeps his promises. https://t.co/VBFuJOWIMa\n\"@pjs307: @WalshFreedom Will be highest rated show ever, @realDonaldTrump is a marketing genius #SNL\" Hope it does well!\n\"@DefendingtheUSA: GREAT Video. Which of these 4 Polls is Suspect? Kudos to @OANN  https://t.co/kKlRLIDrLC #Trump https://t.co/BiEUTt2k6Z\"\n\"@eric_wagaman94: Super excited to watch @realDonaldTrum",
  "entities": [
    {
      "type": "Person",
      "relevance": "0.929998",
      "sentiment": {
        "type": "positive",
        "score": "0.396524",
        "mixed": "1"
      },
      "count": "45",
      "text": "Donald Trump",
      "disambiguated": {
        "subType": [
          "AwardNominee",
          "AwardWinner",
          "Celebrity",
          "CompanyFounder",
          "TVPersonality",
          "TVProducer",
          "FilmActor",
          "TVActor"
        ],
        "name": "Donald Trump",
        "website": "http://www.trumponline.com/",
        "dbpedia": "http://dbpedia.org/resource/Donald_Trump",
        "freebase": "http://rdf.freebase.com/ns/m.0cqt90",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rv0ncIZwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Donald_Trump"
      },
      "quotations": [
        {
          "quotation": "\"\n\"@nobaddog: @RepBJNikkel @CindyBlackwel12 JohnKasich  All you career Politicians are shaking in your shoes for fear Trump ...",
          "sentiment": {
            "type": "negative",
            "score": "-0.123728",
            "mixed": "1"
          }
        }
      ]
    },
    {
      "type": "Continent",
      "relevance": "0.550078",
      "sentiment": {
        "type": "positive",
        "score": "0.418893",
        "mixed": "1"
      },
      "count": "24",
      "text": "America"
    },
    {
      "type": "Person",
      "relevance": "0.542196",
      "sentiment": {
        "type": "negative",
        "score": "-0.672585"
      },
      "count": "8",
      "text": "Trump"
    },
    {
      "type": "Company",
      "relevance": "0.492555",
      "sentiment": {
        "type": "positive",
        "score": "0.579786"
      },
      "count": "7",
      "text": "Trump"
    },
    {
      "type": "Organization",
      "relevance": "0.425293",
      "sentiment": {
        "type": "positive",
        "score": "0.267321",
        "mixed": "1"
      },
      "count": "12",
      "text": "GOP"
    },
    {
      "type": "Company",
      "relevance": "0.416267",
      "sentiment": {
        "type": "positive",
        "score": "0.198397",
        "mixed": "1"
      },
      "count": "17",
      "text": "CNN",
      "disambiguated": {
        "subType": [
          "Broadcast",
          "AwardWinner",
          "RadioNetwork",
          "TVNetwork"
        ],
        "name": "CNN",
        "website": "http://www.cnn.com/",
        "dbpedia": "http://dbpedia.org/resource/CNN",
        "freebase": "http://rdf.freebase.com/ns/m.0gsgr",
        "yago": "http://yago-knowledge.org/resource/CNN"
      }
    },
    {
      "type": "Person",
      "relevance": "0.410729",
      "sentiment": {
        "type": "positive",
        "score": "0.569587"
      },
      "count": "13",
      "text": "Sen Marco Rubio",
      "disambiguated": {
        "subType": [
          "Politician",
          "OfficeHolder"
        ],
        "name": "Marco Rubio",
        "website": "http://www.marcorubio.com/",
        "dbpedia": "http://dbpedia.org/resource/Marco_Rubio",
        "freebase": "http://rdf.freebase.com/ns/m.0dpr5f",
        "yago": "http://yago-knowledge.org/resource/Marco_Rubio"
      }
    },
    {
      "type": "Person",
      "relevance": "0.407655",
      "sentiment": {
        "type": "negative",
        "score": "-0.561796"
      },
      "count": "11",
      "text": "President Obama",
      "disambiguated": {
        "subType": [
          "Politician",
          "President",
          "Appointer",
          "AwardWinner",
          "Celebrity",
          "PoliticalAppointer",
          "U.S.Congressperson",
          "USPresident",
          "TVActor"
        ],
        "name": "Barack Obama",
        "website": "http://www.whitehouse.gov/",
        "dbpedia": "http://dbpedia.org/resource/Barack_Obama",
        "freebase": "http://rdf.freebase.com/ns/m.02mjmr",
        "yago": "http://yago-knowledge.org/resource/Barack_Obama"
      }
    },
    {
      "type": "Person",
      "relevance": "0.384351",
      "sentiment": {
        "type": "positive",
        "score": "0.646007"
      },
      "count": "8",
      "text": "Ben Carson",
      "disambiguated": {
        "subType": [
          "Physician",
          "Academic",
          "AwardWinner",
          "FilmMusicContributor",
          "Scientist"
        ],
        "name": "Ben Carson",
        "dbpedia": "http://dbpedia.org/resource/Ben_Carson",
        "freebase": "http://rdf.freebase.com/ns/m.03znkl",
        "yago": "http://yago-knowledge.org/resource/Ben_Carson"
      }
    },
    {
      "type": "Company",
      "relevance": "0.382621",
      "sentiment": {
        "type": "negative",
        "score": "-0.187974",
        "mixed": "1"
      },
      "count": "11",
      "text": "DonaldTrump",
      "quotations": [
        {
          "quotation": "\n\"@jrpantiques: @realDonaldTrump @TheFix @pbump THE SCRIPT FOR A GREAT WORLD CHANGING LEADER TO ARISE HAS BEEN WRITTEN & IT WAS FOR MR. TRUMP\n\"@bloggerjulie: @FoxNews The reporter is the one who mentioned the national database FIRST and not DonaldTrump ...",
          "sentiment": {
            "type": "positive",
            "score": "0.0446639"
          }
        }
      ]
    },
    {
      "type": "Company",
      "relevance": "0.369554",
      "sentiment": {
        "type": "neutral"
      },
      "count": "11",
      "text": "FoxNews"
    },
    {
      "type": "Person",
      "relevance": "0.36681",
      "sentiment": {
        "type": "positive",
        "score": "0.888818"
      },
      "count": "17",
      "text": "Governor Kasich"
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.352332",
      "sentiment": {
        "type": "negative",
        "score": "-0.334112"
      },
      "count": "8",
      "text": "New Hampshire",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "New Hampshire",
        "website": "http://www.nh.gov",
        "dbpedia": "http://dbpedia.org/resource/New_Hampshire",
        "freebase": "http://rdf.freebase.com/ns/m.059f4",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVih1JwpEbGdrcN5Y29ycA",
        "census": "http://www.rdfabout.com/rdf/usgov/geo/us/nh",
        "yago": "http://yago-knowledge.org/resource/New_Hampshire"
      }
    },
    {
      "type": "Country",
      "relevance": "0.347507",
      "sentiment": {
        "type": "neutral"
      },
      "count": "9",
      "text": "United States",
      "disambiguated": {
        "subType": [
          "Location",
          "Region",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "FilmEditor"
        ],
        "name": "United States",
        "website": "http://www.usa.gov/",
        "dbpedia": "http://dbpedia.org/resource/United_States",
        "freebase": "http://rdf.freebase.com/ns/m.09c7w0",
        "ciaFactbook": "http://www4.wiwiss.fu-berlin.de/factbook/resource/United_States",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVikKpwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/United_States"
      }
    },
    {
      "type": "JobTitle",
      "relevance": "0.338228",
      "sentiment": {
        "type": "positive",
        "score": "0.431659"
      },
      "count": "7",
      "text": "president"
    },
    {
      "type": "JobTitle",
      "relevance": "0.336251",
      "sentiment": {
        "type": "positive",
        "score": "0.626347"
      },
      "count": "5",
      "text": "President"
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.326145",
      "sentiment": {
        "type": "neutral"
      },
      "count": "10",
      "text": "South Carolina",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "South Carolina",
        "website": "http://www.sc.gov",
        "dbpedia": "http://dbpedia.org/resource/South_Carolina",
        "freebase": "http://rdf.freebase.com/ns/m.06yxd",
        "geonames": "http://sws.geonames.org/4597040/",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvViphZwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/South_Carolina"
      }
    },
    {
      "type": "Person",
      "relevance": "0.320304",
      "sentiment": {
        "type": "negative",
        "score": "-0.646336"
      },
      "count": "5",
      "text": "Melania Trump",
      "disambiguated": {
        "subType": [
          "Celebrity",
          "Model"
        ],
        "name": "Melania Trump",
        "website": "http://www.melaniatrump.com",
        "dbpedia": "http://dbpedia.org/resource/Melania_Trump",
        "freebase": "http://rdf.freebase.com/ns/m.04hfnv",
        "yago": "http://yago-knowledge.org/resource/Melania_Trump"
      }
    },
    {
      "type": "Person",
      "relevance": "0.319507",
      "sentiment": {
        "type": "neutral"
      },
      "count": "11",
      "text": "Hillary Clinton",
      "disambiguated": {
        "subType": [
          "Politician",
          "Appointee",
          "AwardWinner",
          "BoardMember",
          "Celebrity",
          "HallOfFameInductee",
          "OperaCharacter",
          "Senator",
          "U.S.Congressperson",
          "TVActor"
        ],
        "name": "Hillary Rodham Clinton",
        "website": "http://www.state.gov/secretary/index.htm",
        "dbpedia": "http://dbpedia.org/resource/Hillary_Rodham_Clinton",
        "freebase": "http://rdf.freebase.com/ns/m.0d06m5",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvV7SqpwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Hillary_Rodham_Clinton"
      }
    },
    {
      "type": "TelevisionShow",
      "relevance": "0.316651",
      "sentiment": {
        "type": "negative",
        "score": "-0.0577491",
        "mixed": "1"
      },
      "count": "20",
      "text": "Saturday Night Live",
      "disambiguated": {
        "subType": [
          "AwardWinner"
        ],
        "name": "Saturday Night Live",
        "website": "http://www.nbc.com/Saturday_Night_Live/",
        "dbpedia": "http://dbpedia.org/resource/Saturday_Night_Live",
        "freebase": "http://rdf.freebase.com/ns/m.039cq4",
        "yago": "http://yago-knowledge.org/resource/Saturday_Night_Live"
      }
    },
    {
      "type": "JobTitle",
      "relevance": "0.313285",
      "sentiment": {
        "type": "negative",
        "score": "-0.247524",
        "mixed": "1"
      },
      "count": "6",
      "text": "reporter"
    },
    {
      "type": "City",
      "relevance": "0.306035",
      "sentiment": {
        "type": "negative",
        "score": "-0.264543"
      },
      "count": "5",
      "text": "New York City",
      "disambiguated": {
        "subType": [
          "PoliticalDistrict",
          "GovernmentalJurisdiction",
          "PlaceWithNeighborhoods",
          "WineRegion",
          "FilmScreeningVenue"
        ],
        "name": "New York City",
        "geo": "40.71666666666667 -74.0",
        "website": "http://www.nyc.gov/",
        "dbpedia": "http://dbpedia.org/resource/New_York_City",
        "freebase": "http://rdf.freebase.com/ns/m.02_286",
        "geonames": "http://sws.geonames.org/5128581/",
        "yago": "http://yago-knowledge.org/resource/New_York_City"
      }
    },
    {
      "type": "City",
      "relevance": "0.295762",
      "sentiment": {
        "type": "positive",
        "score": "0.509279"
      },
      "count": "8",
      "text": "Paris"
    },
    {
      "type": "Organization",
      "relevance": "0.285481",
      "sentiment": {
        "type": "neutral"
      },
      "count": "8",
      "text": "ISIS",
      "disambiguated": {
        "subType": [
          "MusicalGroup",
          "MusicalArtist",
          "MusicalGroupMember"
        ],
        "name": "Isis (band)",
        "website": "http://www.isistheband.com/",
        "dbpedia": "http://dbpedia.org/resource/Isis_(band)",
        "freebase": "http://rdf.freebase.com/ns/m.052k44",
        "yago": "http://yago-knowledge.org/resource/Isis_(band)",
        "musicBrainz": "http://zitgist.com/music/artist/5e521e8c-0ab2-44c4-8fd8-14d8d3321265"
      },
      "quotations": [
        {
          "quotation": "ISIS leaders \"MASTERMINDS.\"",
          "sentiment": {
            "type": "neutral"
          }
        }
      ]
    },
    {
      "type": "Company",
      "relevance": "0.2771",
      "sentiment": {
        "type": "positive",
        "score": "0.623188"
      },
      "count": "9",
      "text": "ABC",
      "disambiguated": {
        "subType": [
          "Broadcast",
          "TVNetwork",
          "AwardNominee",
          "AwardWinner"
        ],
        "name": "American Broadcasting Company",
        "website": "http://abc.go.com",
        "dbpedia": "http://dbpedia.org/resource/American_Broadcasting_Company",
        "freebase": "http://rdf.freebase.com/ns/m.0gsg7",
        "yago": "http://yago-knowledge.org/resource/American_Broadcasting_Company"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.274819",
      "sentiment": {
        "type": "negative",
        "score": "-0.643091"
      },
      "count": "7",
      "text": "OHIO"
    },
    {
      "type": "Company",
      "relevance": "0.272872",
      "sentiment": {
        "type": "negative",
        "score": "-0.551804"
      },
      "count": "3",
      "text": "Macys",
      "disambiguated": {
        "subType": [
          "Location"
        ],
        "name": "Macy's",
        "geo": "40.75083333333333 -73.98916666666666",
        "website": "http://www.macys.com/",
        "dbpedia": "http://dbpedia.org/resource/Macy's",
        "freebase": "http://rdf.freebase.com/ns/m.01pkxd",
        "yago": "http://yago-knowledge.org/resource/Macy's"
      }
    },
    {
      "type": "PrintMedia",
      "relevance": "0.269271",
      "sentiment": {
        "type": "neutral"
      },
      "count": "6",
      "text": "New York Times",
      "disambiguated": {
        "subType": [
          "Organization",
          "Company",
          "AwardPresentingOrganization",
          "AwardWinner",
          "CompanyShareholder",
          "Newspaper"
        ],
        "name": "The New York Times",
        "website": "http://www.nytimes.com",
        "dbpedia": "http://dbpedia.org/resource/The_New_York_Times",
        "freebase": "http://rdf.freebase.com/ns/m.07k2d",
        "yago": "http://yago-knowledge.org/resource/The_New_York_Times"
      }
    },
    {
      "type": "Holiday",
      "relevance": "0.2676",
      "sentiment": {
        "type": "negative",
        "score": "-0.338587"
      },
      "count": "3",
      "text": "Christmas",
      "disambiguated": {
        "subType": [],
        "name": "Christmas",
        "dbpedia": "http://dbpedia.org/resource/Christmas",
        "freebase": "http://rdf.freebase.com/ns/m.01vq3",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rwPfXpZwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Christmas"
      }
    },
    {
      "type": "Company",
      "relevance": "0.26646",
      "sentiment": {
        "type": "positive",
        "score": "0.76564"
      },
      "count": "3",
      "text": "Reuters",
      "disambiguated": {
        "subType": [],
        "name": "Reuters",
        "website": "http://www.reuters.com",
        "dbpedia": "http://dbpedia.org/resource/Reuters",
        "freebase": "http://rdf.freebase.com/ns/m.0ps53",
        "yago": "http://yago-knowledge.org/resource/Reuters",
        "crunchbase": "http://www.crunchbase.com/company/reuters"
      }
    },
    {
      "type": "Person",
      "relevance": "0.26287",
      "sentiment": {
        "type": "negative",
        "score": "-0.646336"
      },
      "count": "1",
      "text": "MR. TRUMP"
    },
    {
      "type": "Company",
      "relevance": "0.257262",
      "sentiment": {
        "type": "negative",
        "score": "-0.552099"
      },
      "count": "7",
      "text": "WSJ"
    },
    {
      "type": "Organization",
      "relevance": "0.25492",
      "sentiment": {
        "type": "negative",
        "score": "-0.369307"
      },
      "count": "5",
      "text": "SNL"
    },
    {
      "type": "Person",
      "relevance": "0.252252",
      "sentiment": {
        "type": "positive",
        "score": "0.152921",
        "mixed": "1"
      },
      "count": "4",
      "text": "Ted Cruz",
      "disambiguated": {
        "subType": [
          "Politician"
        ],
        "name": "Ted Cruz",
        "website": "http://www.TedCruz.Org",
        "dbpedia": "http://dbpedia.org/resource/Ted_Cruz",
        "freebase": "http://rdf.freebase.com/ns/m.07j6ty",
        "yago": "http://yago-knowledge.org/resource/Ted_Cruz"
      }
    },
    {
      "type": "Facility",
      "relevance": "0.248787",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Trump Winery"
    },
    {
      "type": "City",
      "relevance": "0.244849",
      "sentiment": {
        "type": "positive",
        "score": "0.542512"
      },
      "count": "7",
      "text": "Sarasota",
      "disambiguated": {
        "subType": [],
        "name": "Sarasota, Florida",
        "geo": "27.337222222222223 -82.53527777777778",
        "website": "http://www.sarasotagov.com",
        "dbpedia": "http://dbpedia.org/resource/Sarasota,_Florida",
        "freebase": "http://rdf.freebase.com/ns/m.0rrwt",
        "geonames": "http://sws.geonames.org/4172131/",
        "yago": "http://yago-knowledge.org/resource/Sarasota,_Florida"
      }
    },
    {
      "type": "Facility",
      "relevance": "0.242788",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Trump Hotel Honolulu"
    },
    {
      "type": "Company",
      "relevance": "0.240631",
      "sentiment": {
        "type": "positive",
        "score": "0.643026"
      },
      "count": "4",
      "text": "nytimes"
    },
    {
      "type": "Person",
      "relevance": "0.2405",
      "sentiment": {
        "type": "positive",
        "score": "0.867329"
      },
      "count": "3",
      "text": "Mitt Romney",
      "disambiguated": {
        "subType": [
          "Politician",
          "CompanyFounder",
          "TVActor"
        ],
        "name": "Mitt Romney",
        "dbpedia": "http://dbpedia.org/resource/Mitt_Romney",
        "freebase": "http://rdf.freebase.com/ns/m.0271_s",
        "yago": "http://yago-knowledge.org/resource/Mitt_Romney"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.238524",
      "sentiment": {
        "type": "neutral"
      },
      "count": "3",
      "text": "Florida",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "Florida",
        "geo": "28.133333333333333 -81.63166666666666",
        "website": "http://www.myflorida.com",
        "dbpedia": "http://dbpedia.org/resource/Florida",
        "freebase": "http://rdf.freebase.com/ns/m.0711wp",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvViELJwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Florida"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.2368",
      "sentiment": {
        "type": "neutral"
      },
      "count": "4",
      "text": "Alabama",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "Alabama",
        "geo": "33.0 -86.66666666666667",
        "website": "http://www.alabama.gov",
        "dbpedia": "http://dbpedia.org/resource/Alabama",
        "freebase": "http://rdf.freebase.com/ns/m.0gyh",
        "geonames": "http://sws.geonames.org/4829764/",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVkAzpwpEbGdrcN5Y29ycA",
        "census": "http://www.rdfabout.com/rdf/usgov/geo/us/al",
        "yago": "http://yago-knowledge.org/resource/Alabama"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.236511",
      "sentiment": {
        "type": "neutral"
      },
      "count": "2",
      "text": "New Jersey",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "New Jersey",
        "website": "http://www.nj.gov",
        "dbpedia": "http://dbpedia.org/resource/New_Jersey",
        "freebase": "http://rdf.freebase.com/ns/m.05fjf",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvViy85wpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/New_Jersey"
      }
    },
    {
      "type": "Facility",
      "relevance": "0.236472",
      "sentiment": {
        "type": "neutral"
      },
      "count": "1",
      "text": "Trump Tower and Hotel"
    },
    {
      "type": "City",
      "relevance": "0.234567",
      "sentiment": {
        "type": "negative",
        "score": "-0.342492"
      },
      "count": "2",
      "text": "Birmingham",
      "disambiguated": {
        "subType": [],
        "name": "Birmingham, Indiana",
        "geo": "40.937777777777775 -86.10944444444445",
        "dbpedia": "http://dbpedia.org/resource/Birmingham,_Indiana",
        "freebase": "http://rdf.freebase.com/ns/m.03m447j"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.233529",
      "sentiment": {
        "type": "positive",
        "score": "0.880771"
      },
      "count": "4",
      "text": "Iowa",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "Iowa",
        "website": "http://www.iowa.gov",
        "dbpedia": "http://dbpedia.org/resource/Iowa",
        "freebase": "http://rdf.freebase.com/ns/m.03s0w",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVi3ipwpEbGdrcN5Y29ycA",
        "census": "http://www.rdfabout.com/rdf/usgov/geo/us/ia",
        "yago": "http://yago-knowledge.org/resource/Iowa"
      }
    },
    {
      "type": "Company",
      "relevance": "0.231618",
      "sentiment": {
        "type": "positive",
        "score": "0.54123"
      },
      "count": "6",
      "text": "SNL"
    },
    {
      "type": "Person",
      "relevance": "0.228974",
      "sentiment": {
        "type": "neutral"
      },
      "count": "2",
      "text": "Bobby Jindal",
      "disambiguated": {
        "subType": [
          "Politician",
          "Governor",
          "U.S.Congressperson"
        ],
        "name": "Bobby Jindal",
        "website": "http://www.gov.louisiana.gov/",
        "dbpedia": "http://dbpedia.org/resource/Bobby_Jindal",
        "freebase": "http://rdf.freebase.com/ns/m.049356",
        "yago": "http://yago-knowledge.org/resource/Bobby_Jindal"
      }
    },
    {
      "type": "StateOrCounty",
      "relevance": "0.227091",
      "sentiment": {
        "type": "positive",
        "score": "0.578596"
      },
      "count": "2",
      "text": "Massachusetts",
      "disambiguated": {
        "subType": [
          "Location",
          "PoliticalDistrict",
          "AdministrativeDivision",
          "GovernmentalJurisdiction",
          "USState"
        ],
        "name": "Massachusetts",
        "website": "http://www.mass.gov",
        "dbpedia": "http://dbpedia.org/resource/Massachusetts",
        "freebase": "http://rdf.freebase.com/ns/m.05k7sb",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rvVi4QpwpEbGdrcN5Y29ycA",
        "yago": "http://yago-knowledge.org/resource/Massachusetts"
      }
    },
    {
      "type": "Person",
      "relevance": "0.224131",
      "sentiment": {
        "type": "negative",
        "score": "-0.622002"
      },
      "count": "1",
      "text": "John Kasich",
      "disambiguated": {
        "subType": [
          "Politician",
          "U.S.Congressperson",
          "TVActor"
        ],
        "name": "John Kasich",
        "website": "http://www.kasichforohio.com/",
        "dbpedia": "http://dbpedia.org/resource/John_Kasich",
        "freebase": "http://rdf.freebase.com/ns/m.02zzm_",
        "yago": "http://yago-knowledge.org/resource/John_Kasich"
      }
    },
    {
      "type": "Person",
      "relevance": "0.223903",
      "sentiment": {
        "type": "neutral"
      },
      "count": "3",
      "text": "Barbara Walters",
      "disambiguated": {
        "subType": [
          "Celebrity",
          "HallOfFameInductee",
          "Journalist",
          "TVPersonality",
          "TVProducer",
          "TVActor"
        ],
        "name": "Barbara Walters",
        "dbpedia": "http://dbpedia.org/resource/Barbara_Walters",
        "freebase": "http://rdf.freebase.com/ns/m.01xcr4",
        "opencyc": "http://sw.opencyc.org/concept/Mx4rlyIosyp4EdiUfwAH6RYvSQ",
        "yago": "http://yago-knowledge.org/resource/Barbara_Walters"
      }
    }
  ]
}